// Class Solarland.3DMeshWidget
// Size: 0x238 (Inherited: 0x228)
struct A3DMeshWidget : AActor {
	struct USceneComponent* DefaultSceneRoot; // 0x228(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x230(0x08)
};

// Class Solarland.3DMeshWidgetTrack
// Size: 0x2d8 (Inherited: 0x238)
struct A3DMeshWidgetTrack : A3DMeshWidget {
	char pad_238[0x8]; // 0x238(0x08)
	struct FVector BoxHalfExtent; // 0x240(0x0c)
	float PlayerNearbyAlpha; // 0x24c(0x04)
	bool bDebugCollision; // 0x250(0x01)
	char pad_251[0x3]; // 0x251(0x03)
	struct FName MaterialAlphaParamName; // 0x254(0x08)
	struct FName MaterialCountDownName; // 0x25c(0x08)
	float MaxTraceDist; // 0x264(0x04)
	float DistFromGround; // 0x268(0x04)
	char pad_26C[0x4]; // 0x26c(0x04)
	struct UStaticMeshComponent* StaticMeshCountDown; // 0x270(0x08)
	struct UTextRenderComponent* DistTextComp; // 0x278(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialIcon; // 0x280(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialCountDown; // 0x288(0x08)
	struct UMaterialInstanceDynamic* DynamicMaterialDistText; // 0x290(0x08)
	char pad_298[0x40]; // 0x298(0x40)
};

// Class Solarland.AbilityTask_WaitAbilityEnd
// Size: 0x148 (Inherited: 0x80)
struct UAbilityTask_WaitAbilityEnd : UAbilityTask {
	struct FMulticastInlineDelegate OnEnd; // 0x80(0x10)
	char pad_90[0xb8]; // 0x90(0xb8)

	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEndWithTagRequirements(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements TagRequirements, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEndWithTagRequirements // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c2b0e0
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd_Query(struct UGameplayAbility* OwningAbility, struct FGameplayTagQuery Query, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd_Query // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c2b2e0
	struct UAbilityTask_WaitAbilityEnd* WaitForAbilityEnd(struct UGameplayAbility* OwningAbility, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool InIncludeTriggeredAbilities, bool InTriggerOnce); // Function Solarland.AbilityTask_WaitAbilityEnd.WaitForAbilityEnd // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c2af50
	void OnAbilityEnd(struct FAbilityEndedData& EndedData); // Function Solarland.AbilityTask_WaitAbilityEnd.OnAbilityEnd // (Final|Native|Protected|HasOutParms) // @ game+0x1c29f50
};

// Class Solarland.SolarAbilityTask
// Size: 0x80 (Inherited: 0x80)
struct USolarAbilityTask : UAbilityTask {
};

// Class Solarland.AbilityTask_WaitAttributeChangeWithOldValue
// Size: 0xf8 (Inherited: 0x80)
struct UAbilityTask_WaitAttributeChangeWithOldValue : USolarAbilityTask {
	struct FMulticastInlineDelegate OnChange; // 0x80(0x10)
	char pad_90[0x60]; // 0x90(0x60)
	struct UAbilitySystemComponent* ExternalOwner; // 0xf0(0x08)

	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChangeWithComparison(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, enum class EWaitAttributeChangeComparison InComparisonType, float InComparisonValue, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChangeWithComparison // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c2b760
	struct UAbilityTask_WaitAttributeChangeWithOldValue* WaitForAttributeChange(struct UGameplayAbility* OwningAbility, struct FGameplayAttribute InAttribute, struct FGameplayTag InWithTag, struct FGameplayTag InWithoutTag, bool bTriggerOnce, struct AActor* OptionalExternalOwner); // Function Solarland.AbilityTask_WaitAttributeChangeWithOldValue.WaitForAttributeChange // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c2b4a0
};

// Class Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent
// Size: 0xc0 (Inherited: 0x80)
struct UAbilityTask_WaitDelayAndResetOnGameplayEvent : USolarAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	struct FDelegate OnRecalculateWaitDelayOnEventTriggered; // 0x90(0x10)
	char pad_A0[0x20]; // 0xa0(0x20)

	struct UAbilityTask_WaitDelayAndResetOnGameplayEvent* CreateTask(struct UGameplayAbility* OwningAbility, float DelayTime, struct FGameplayTag& EventTag); // Function Solarland.AbilityTask_WaitDelayAndResetOnGameplayEvent.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1c28570
};

// Class Solarland.AbilityTask_WaitEvaluation
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitEvaluation : USolarAbilityTask {
	struct FMulticastInlineDelegate OnGotDesiredValue; // 0x80(0x10)
	struct FDelegate EvaluationFunction; // 0x90(0x10)
	char pad_A0[0x8]; // 0xa0(0x08)

	struct UAbilityTask_WaitEvaluation* CreateTask(struct UGameplayAbility* OwningAbility, bool bDesiredValue, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitEvaluation.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c28680
};

// Class Solarland.AbilityTask_WaitInputAction
// Size: 0xa8 (Inherited: 0x80)
struct UAbilityTask_WaitInputAction : USolarAbilityTask {
	struct FMulticastInlineDelegate OnInputAction; // 0x80(0x10)
	char pad_90[0x18]; // 0x90(0x18)

	struct UAbilityTask_WaitInputAction* CreateTask(struct UGameplayAbility* OwningAbility, struct FName ActionName, enum class EInputEvent InputEvent, bool bTriggerOnce); // Function Solarland.AbilityTask_WaitInputAction.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c28790
};

// Class Solarland.AbilityTask_WaitTagRequirementsMetStatusChange
// Size: 0xf0 (Inherited: 0x80)
struct UAbilityTask_WaitTagRequirementsMetStatusChange : USolarAbilityTask {
	struct FMulticastInlineDelegate OnMetStatusChange; // 0x80(0x10)
	struct FGameplayTagRequirements TagRequirements; // 0x90(0x50)
	char pad_E0[0x10]; // 0xe0(0x10)

	struct UAbilityTask_WaitTagRequirementsMetStatusChange* CreateTask(struct UGameplayAbility* OwningAbility, struct FGameplayTagRequirements& TagRequirements, bool bMetInitially); // Function Solarland.AbilityTask_WaitTagRequirementsMetStatusChange.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1c288d0
};

// Class Solarland.ActionNode
// Size: 0x70 (Inherited: 0x28)
struct UActionNode : UObject {
	struct FMulticastInlineDelegate OnBeganCallback; // 0x28(0x10)
	struct FMulticastInlineDelegate OnEndedCallback; // 0x38(0x10)
	struct FMulticastInlineDelegate OnResetCallback; // 0x48(0x10)
	struct FMulticastInlineDelegate OnDisposedCallback; // 0x58(0x10)
	char pad_68[0x8]; // 0x68(0x08)

	void Reset(); // Function Solarland.ActionNode.Reset // (Final|Native|Public) // @ game+0x1c2a700
	bool Finished(); // Function Solarland.ActionNode.Finished // (Final|Native|Public|Const) // @ game+0x1c28bc0
	void Finish(); // Function Solarland.ActionNode.Finish // (Native|Public) // @ game+0x1c28b10
	bool Execute(float DeltaTime); // Function Solarland.ActionNode.Execute // (Final|Native|Public) // @ game+0x1c28a80
	bool Disposed(); // Function Solarland.ActionNode.Disposed // (Final|Native|Public|Const) // @ game+0x1c28a60
	void Dispose(); // Function Solarland.ActionNode.Dispose // (Final|Native|Public) // @ game+0x1c28a40
};

// Class Solarland.ActorEffect
// Size: 0x50 (Inherited: 0x28)
struct UActorEffect : UObject {
	struct UActorEffectController* ControllerClass; // 0x28(0x08)
	struct UActorEffectController* Controller; // 0x30(0x08)
	char pad_38[0x18]; // 0x38(0x18)
};

// Class Solarland.ActorEffectController
// Size: 0x28 (Inherited: 0x28)
struct UActorEffectController : UObject {
};

// Class Solarland.ActorEffectSubsystem
// Size: 0x48 (Inherited: 0x30)
struct UActorEffectSubsystem : UWorldSubsystem {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct UActorEffect*> Effects; // 0x38(0x10)

	bool Stop(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Stop // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2aec0
	struct UActorEffect* Start(struct UActorEffect* EffectClass, struct AActor* AffectedActor); // Function Solarland.ActorEffectSubsystem.Start // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2ae00
	bool Finish(struct UActorEffect* EffectInstance); // Function Solarland.ActorEffectSubsystem.Finish // (Final|Native|Public|BlueprintCallable) // @ game+0x1c28b30
};

// Class Solarland.SolarUserWidget
// Size: 0x340 (Inherited: 0x260)
struct USolarUserWidget : UUserWidget {
	enum class EWidgetLayerLevel WidgetLayerLevel; // 0x260(0x01)
	enum class EWidgetScope WidgetScope; // 0x261(0x01)
	enum class EInputCapture CaptureInput; // 0x262(0x01)
	bool bHideCursorDuringCapture; // 0x263(0x01)
	int32_t MyRoot; // 0x264(0x04)
	struct FString widgetkey; // 0x268(0x10)
	bool bIsPersistent; // 0x278(0x01)
	bool bReceiveKeyMap; // 0x279(0x01)
	bool bReceiveShowMouse; // 0x27a(0x01)
	bool bShowTransBlackAnim; // 0x27b(0x01)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct UWidgetInputManager* InputManagerClass; // 0x280(0x08)
	struct UWidgetInputManager* InputManager; // 0x288(0x08)
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationsMap; // 0x290(0x50)
	struct TWeakObjectPtr<struct UWidgetAnimation> PlayingAnimation; // 0x2e0(0x08)
	char pad_2E8[0x18]; // 0x2e8(0x18)
	struct TArray<struct FPlayAnimationParams> PendingPlayAnimations; // 0x300(0x10)
	bool WidgetTickEnabled; // 0x310(0x01)
	char pad_311[0x7]; // 0x311(0x07)
	struct USolarInputActionContext* InputActionContext; // 0x318(0x08)
	char pad_320[0x10]; // 0x320(0x10)
	struct TArray<struct USolarUserWidget*> AllSolarUserWidgetChilds; // 0x330(0x10)

	void StopListeningForInputActionEx(struct FName ActionName, enum class EInputEvent EventType); // Function Solarland.SolarUserWidget.StopListeningForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x1ecb6f0
	void ShowSelfPanelUI(); // Function Solarland.SolarUserWidget.ShowSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb6d0
	void ShowMouseCursor(); // Function Solarland.SolarUserWidget.ShowMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x1ecb6b0
	void SetZOrder(int32_t ZOrder); // Function Solarland.SolarUserWidget.SetZOrder // (Final|Native|Public) // @ game+0x1ecb630
	void SetWidgetVisible(struct UWidget* Widget, bool bVisible, bool bHitTest); // Function Solarland.SolarUserWidget.SetWidgetVisible // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1ecb520
	void SetWidgetTickEnabled(bool bEnabled); // Function Solarland.SolarUserWidget.SetWidgetTickEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1ecb4a0
	void SetWidgetKey(struct FString InWidgetKey); // Function Solarland.SolarUserWidget.SetWidgetKey // (Final|Native|Public) // @ game+0x1ecb400
	void SetInputActionIsEnabled(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled); // Function Solarland.SolarUserWidget.SetInputActionIsEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x1ecb2f0
	void SetBlockInputForOneTick(); // Function Solarland.SolarUserWidget.SetBlockInputForOneTick // (Final|Native|Public) // @ game+0x1ecb2d0
	void ReceiveTick(struct FGeometry& MyGeometry, float InDeltaTime); // Function Solarland.SolarUserWidget.ReceiveTick // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveShow(); // Function Solarland.SolarUserWidget.ReceiveShow // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveHide(); // Function Solarland.SolarUserWidget.ReceiveHide // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	bool PlayAnimationByName(struct FName& AnimationName, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed); // Function Solarland.SolarUserWidget.PlayAnimationByName // (Final|Native|Public|HasOutParms) // @ game+0x1ecaf30
	void PlayAnimationByExclusively(struct UWidgetAnimation* InAnimation, float StartAtTime, int32_t NumLoopsToPlay, enum class EUMGSequencePlayMode PlayMode, float PlaybackSpeed, bool bRestoreState); // Function Solarland.SolarUserWidget.PlayAnimationByExclusively // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x1ecad70
	void OnTouchManagerInitialized(); // Function Solarland.SolarUserWidget.OnTouchManagerInitialized // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnSynchronizeProperties(); // Function Solarland.SolarUserWidget.OnSynchronizeProperties // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnSolarUIOpened(); // Function Solarland.SolarUserWidget.OnSolarUIOpened // (Native|Event|Protected|BlueprintEvent) // @ game+0x7efae0
	void OnSolarUIClosed(); // Function Solarland.SolarUserWidget.OnSolarUIClosed // (Native|Event|Protected|BlueprintEvent) // @ game+0x12593d0
	void OnShow(); // Function Solarland.SolarUserWidget.OnShow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1259310
	void OnHide(); // Function Solarland.SolarUserWidget.OnHide // (Native|Event|Protected|BlueprintEvent) // @ game+0x1259490
	void OnExclusivelyAnimationFinished(); // Function Solarland.SolarUserWidget.OnExclusivelyAnimationFinished // (Final|Native|Protected) // @ game+0x1ecacf0
	void OnDeinitialize(); // Function Solarland.SolarUserWidget.OnDeinitialize // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnBackKey(enum class EWidgetBackKeyType BackKeyType); // Function Solarland.SolarUserWidget.OnBackKey // (Native|Event|Protected|BlueprintEvent) // @ game+0x1eca8b0
	void ListenForInputActionEx(struct FName ActionName, enum class EInputEvent EventType, bool bInIsEnabled, struct FDelegate Callback); // Function Solarland.SolarUserWidget.ListenForInputActionEx // (Final|Native|Protected|BlueprintCallable) // @ game+0x1eca730
	bool IsWidgetTickEnabled(); // Function Solarland.SolarUserWidget.IsWidgetTickEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca710
	bool IsSolarUserWidgetAndBindLua(struct UWidget* InWidget); // Function Solarland.SolarUserWidget.IsSolarUserWidgetAndBindLua // (Final|Native|Static|Public) // @ game+0x1eca690
	bool IsPlatformDesktop(); // Function Solarland.SolarUserWidget.IsPlatformDesktop // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca660
	void HideMouseCursor(); // Function Solarland.SolarUserWidget.HideMouseCursor // (Final|Native|Protected|BlueprintCallable) // @ game+0x1eca4b0
	struct FString GetWidgetKeyByPanelName(enum class EUIPanelName PanelName); // Function Solarland.SolarUserWidget.GetWidgetKeyByPanelName // (Final|Native|Static|Public) // @ game+0x1eca3f0
	struct FString GetWidgetKey(); // Function Solarland.SolarUserWidget.GetWidgetKey // (Final|Native|Public|Const) // @ game+0x1eca370
	struct TArray<struct FVector2D> GetTouchedLocation(); // Function Solarland.SolarUserWidget.GetTouchedLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca2f0
	struct TArray<struct FVector2D> GetPointerLocation(); // Function Solarland.SolarUserWidget.GetPointerLocation // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca240
	struct ASolarPlayerState* GetOwningSolarPlayerState(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca210
	struct ASolarCharacter* GetOwningSolarPlayerCharacter(); // Function Solarland.SolarUserWidget.GetOwningSolarPlayerCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1eca1e0
	struct UWidgetAnimation* GetAnimationByName(struct FName& AnimationName); // Function Solarland.SolarUserWidget.GetAnimationByName // (Final|Native|Public|HasOutParms|Const) // @ game+0x1eca070
	struct UWidget* FindWidgetFromName(struct FName& Name); // Function Solarland.SolarUserWidget.FindWidgetFromName // (Final|Native|Public|HasOutParms|Const) // @ game+0x1ec9fd0
	void ExecuteSolarUIShow(); // Function Solarland.SolarUserWidget.ExecuteSolarUIShow // (Final|Native|Public) // @ game+0x1ec9fb0
	void ExecuteSolarUIOpened(); // Function Solarland.SolarUserWidget.ExecuteSolarUIOpened // (Final|Native|Public) // @ game+0x1ec9f90
	void ExecuteSolarUIHide(); // Function Solarland.SolarUserWidget.ExecuteSolarUIHide // (Final|Native|Public) // @ game+0x1ec9f70
	void ExecuteSolarUIClosed(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClosed // (Final|Native|Public) // @ game+0x1ec9f50
	void ExecuteSolarUIClean(); // Function Solarland.SolarUserWidget.ExecuteSolarUIClean // (Final|Native|Public) // @ game+0x1ec9f30
	void ExecuteBindCustomControl(); // Function Solarland.SolarUserWidget.ExecuteBindCustomControl // (Final|Native|Public) // @ game+0x1ec9f10
	void CloseSelfPanelUI(); // Function Solarland.SolarUserWidget.CloseSelfPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1ec9ef0
	struct TArray<struct USolarUserWidget*> CacheAllSolarUserWidgetChilds(); // Function Solarland.SolarUserWidget.CacheAllSolarUserWidgetChilds // (Final|Native|Public) // @ game+0x1ec9e70
};

// Class Solarland.ActorMarkBase
// Size: 0x398 (Inherited: 0x340)
struct UActorMarkBase : USolarUserWidget {
	char pad_340[0x18]; // 0x340(0x18)
	struct AActor* CurrentFollowActor; // 0x358(0x08)
	struct APlayerController* CurrentPlayerController; // 0x360(0x08)
	struct FVector2D MarkIconAlignment; // 0x368(0x08)
	struct FVector2D MarkPanelSize; // 0x370(0x08)
	char pad_378[0x18]; // 0x378(0x18)
	float MaxVisibleDis; // 0x390(0x04)
	char pad_394[0x4]; // 0x394(0x04)

	void SetUpdateState(bool InShouldUpdateLocation); // Function Solarland.ActorMarkBase.SetUpdateState // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2ad70
	void InitActorMarkBaseByFixedPos(struct FVector Pos, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBaseByFixedPos // (Final|Native|Public|HasDefaults) // @ game+0x1c28e50
	void InitActorMarkBase(struct AActor* InActor, struct APlayerController* Controller); // Function Solarland.ActorMarkBase.InitActorMarkBase // (Final|Native|Public) // @ game+0x1c28d90
	struct FVector GetFollowActorLocation(); // Function Solarland.ActorMarkBase.GetFollowActorLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28cb0
	float GetDistance(bool bIncludeZ); // Function Solarland.ActorMarkBase.GetDistance // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c28c10
	struct AActor* GetCurrentFollowActor(); // Function Solarland.ActorMarkBase.GetCurrentFollowActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28be0
};

// Class Solarland.ActorMaterialSubsystemSettings
// Size: 0x70 (Inherited: 0x38)
struct UActorMaterialSubsystemSettings : UDeveloperSettings {
	struct FGameplayTag DefaultMaterialChangePriorityTag; // 0x38(0x08)
	struct TArray<struct FGameplayTag> OrderedMaterialChangePriorityTags; // 0x40(0x10)
	struct TArray<struct FSoftObjectPath> GlobalNoChangeMaterials; // 0x50(0x10)
	char pad_60[0x10]; // 0x60(0x10)

	int32_t GetMaterialChangePriority(struct FGameplayTag& Tag); // Function Solarland.ActorMaterialSubsystemSettings.GetMaterialChangePriority // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28cf0
};

// Class Solarland.ActorMaterialSubsystem
// Size: 0x90 (Inherited: 0x30)
struct UActorMaterialSubsystem : UWorldSubsystem {
	struct TMap<struct AActor*, struct FActorMaterialInfo> ActorMaterialsMap; // 0x30(0x50)
	char pad_80[0x10]; // 0x80(0x10)

	bool SetStaticMesh(struct AActor* Actor, struct UStaticMeshComponent* MeshComp, struct UStaticMesh* NewMesh); // Function Solarland.ActorMaterialSubsystem.SetStaticMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2ac70
	bool SetSkeletalMesh(struct AActor* Actor, struct USkeletalMeshComponent* MeshComp, struct USkeletalMesh* NewMesh, bool bReinitPose, bool bForceSkipTickAnimation); // Function Solarland.ActorMaterialSubsystem.SetSkeletalMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2aad0
	bool SetOriginalMultiplePassMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, struct UMaterialInterface* Material, bool bNeedMultiplePass); // Function Solarland.ActorMaterialSubsystem.SetOriginalMultiplePassMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a980
	bool SetOriginalMaterials(struct AActor* Actor, struct UMeshComponent* MeshComp, struct TArray<struct UMaterialInterface*>& Materials); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c2a860
	bool SetOriginalMaterial(struct AActor* Actor, struct UMeshComponent* MeshComp, int32_t MaterialIndex, struct UMaterialInterface* Material); // Function Solarland.ActorMaterialSubsystem.SetOriginalMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a720
	void RemoveNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.RemoveNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c2a630
	bool RemoveMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.RemoveMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a570
	bool RemoveAllMaterialChanges(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RemoveAllMaterialChanges // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a4e0
	void RebuildMaterialChangesOnMeshAddedOrRemoved(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnMeshAddedOrRemoved // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a460
	void RebuildMaterialChangesOnAllOriginalMaterialsChanged(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.RebuildMaterialChangesOnAllOriginalMaterialsChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2a3e0
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameterByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* SourcePrimitiveComponent, int32_t SourceElementIndex, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameterByIndex // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c2a230
	struct UMaterialInstanceDynamic* OverrideDynamicMaterialInstanceParameter(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, struct FName ParameterName, enum class EMaterialParameterType2 ParameterType, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.OverrideDynamicMaterialInstanceParameter // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c2a0b0
	void OnActorEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.ActorMaterialSubsystem.OnActorEndPlay // (Final|Native|Private) // @ game+0x1c29ff0
	bool K2_SetVectorMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, struct FVector ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetVectorMaterialParameter // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1c29c70
	bool K2_SetScalarMaterialParameter(struct AActor* Actor, struct FMaterialChangeHandle Handle, struct FName ParameterName, float ParameterValue, struct FMaterialFilter Filter); // Function Solarland.ActorMaterialSubsystem.K2_SetScalarMaterialParameter // (Final|Native|Public|BlueprintCallable) // @ game+0x1c299a0
	void K2_RebuildMaterialChangesOnOriginalMaterialChanged(struct AActor* Actor, struct TArray<struct UMeshComponent*> ChangedMeshes); // Function Solarland.ActorMaterialSubsystem.K2_RebuildMaterialChangesOnOriginalMaterialChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1c29880
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParametersByIndex(struct UMaterialInstanceDynamic* TargetMaterial, struct UPrimitiveComponent* PrimitiveComponent, int32_t SourceElementIndex, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParametersByIndex // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c296a0
	struct UMaterialInstanceDynamic* K2_OverrideDynamicMaterialInstanceAllParameters(struct UMaterialInstanceDynamic* TargetMaterial, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, bool bOverridenOnly); // Function Solarland.ActorMaterialSubsystem.K2_OverrideDynamicMaterialInstanceAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c29500
	struct UMaterialInstanceDynamic* K2_CreateDynamicMaterialInstanceOverrideAllParameters(struct UPrimitiveComponent* TargetPrimitiveComponent, struct UMaterialInterface* SourceMaterial, int32_t ParameterTypeFlags, struct FMaterialParameterFilter& ParameterFilter, int32_t TargetElementIndex, bool bOverridenOnly, struct FName OptionalMaterialName); // Function Solarland.ActorMaterialSubsystem.K2_CreateDynamicMaterialInstanceOverrideAllParameters // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c292c0
	struct FMaterialChangeHandle K2_AddMaterialChangeByPath(struct AActor* Actor, struct FSoftObjectPath& MaterialPath, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChangeByPath // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1c290e0
	struct FMaterialChangeHandle K2_AddMaterialChange(struct AActor* Actor, struct UMaterialInterface* SourceMaterial, struct FAddMaterialChangeParams Params); // Function Solarland.ActorMaterialSubsystem.K2_AddMaterialChange // (Final|Native|Public|BlueprintCallable) // @ game+0x1c28f20
	bool ContainsMaterialChangeByPriority(struct AActor* Actor, int32_t Priority); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChangeByPriority // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c284b0
	bool ContainsMaterialChange(struct AActor* Actor, struct FMaterialChangeHandle Handle); // Function Solarland.ActorMaterialSubsystem.ContainsMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c283f0
	bool ContainsAnyMaterialChange(struct AActor* Actor); // Function Solarland.ActorMaterialSubsystem.ContainsAnyMaterialChange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28360
	void AddNoChangeMaterials(struct TArray<struct FSoftObjectPath>& Materials); // Function Solarland.ActorMaterialSubsystem.AddNoChangeMaterials // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c28290
};

// Class Solarland.ActorMaterialSubsystemAgentInterface
// Size: 0x28 (Inherited: 0x28)
struct UActorMaterialSubsystemAgentInterface : UInterface {
};

// Class Solarland.ActorParticleEffectSpawner
// Size: 0xb0 (Inherited: 0x28)
struct UActorParticleEffectSpawner : UObject {
	char pad_28[0x10]; // 0x28(0x10)
	struct FActorParticleEffectSpawnInfo Info; // 0x38(0x70)
	char pad_A8[0x8]; // 0xa8(0x08)
};

// Class Solarland.ActorParticleEffectSubsystem
// Size: 0x48 (Inherited: 0x30)
struct UActorParticleEffectSubsystem : UWorldSubsystem {
	char pad_30[0x8]; // 0x30(0x08)
	struct TArray<struct UActorParticleEffectSpawner*> Spawners; // 0x38(0x10)

	struct FActorParticleEffectSpawnHandle K2_RequestParticleEffectSpawn(struct AActor* Actor, struct FActorParticleEffectSpawnInfo SpawnInfo); // Function Solarland.ActorParticleEffectSubsystem.K2_RequestParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1c30750
	void CancelParticleEffectSpawn(struct FActorParticleEffectSpawnHandle Handle); // Function Solarland.ActorParticleEffectSubsystem.CancelParticleEffectSpawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f090
};

// Class Solarland.AdvProgressBase
// Size: 0x310 (Inherited: 0x260)
struct UAdvProgressBase : UUserWidget {
	struct UImage* Progress; // 0x260(0x08)
	struct UMaterialInstance* ProgressShader; // 0x268(0x08)
	float Speed; // 0x270(0x04)
	float CurrentHP; // 0x274(0x04)
	float MaxHP; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	struct TMap<int32_t, float> ActionMap; // 0x280(0x50)
	float AnimCurrentHP; // 0x2d0(0x04)
	float ProgressAdd; // 0x2d4(0x04)
	float ProgressMinus; // 0x2d8(0x04)
	char pad_2DC[0x34]; // 0x2dc(0x34)

	void UpdateMaxHPLength(float NewHPMax, float NewCurrentHP); // Function Solarland.AdvProgressBase.UpdateMaxHPLength // (Final|Native|Public|BlueprintCallable) // @ game+0x1c30f90
	void SetProgress(float _PreMinus, float _CurrentHP, float _PreAdd); // Function Solarland.AdvProgressBase.SetProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x1c30e80
	int32_t PreAction(float Number); // Function Solarland.AdvProgressBase.PreAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1c30df0
	void Init(float _DefaultHP, float _MaxHP); // Function Solarland.AdvProgressBase.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f410
	float GetMaxHP(); // Function Solarland.AdvProgressBase.GetMaxHP // (Final|Native|Public|Const) // @ game+0x1c2f340
	float GetCurrentHPPercent(); // Function Solarland.AdvProgressBase.GetCurrentHPPercent // (Final|Native|Public|Const) // @ game+0x1c2f320
	void DoActionSmoothly(float Number); // Function Solarland.AdvProgressBase.DoActionSmoothly // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f270
	void DoActionDirectly(float Number); // Function Solarland.AdvProgressBase.DoActionDirectly // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f1f0
	void DoAction(int32_t ID); // Function Solarland.AdvProgressBase.DoAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f170
	struct FLinearColor Debug(); // Function Solarland.AdvProgressBase.Debug // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1c2f130
	void CleanPreActions(); // Function Solarland.AdvProgressBase.CleanPreActions // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2f110
	void CancelAction(int32_t ID); // Function Solarland.AdvProgressBase.CancelAction // (Final|Native|Public|BlueprintCallable) // @ game+0x1c2ef80
};

// Class Solarland.AirDropAudioActor
// Size: 0x2c8 (Inherited: 0x228)
struct AAirDropAudioActor : AActor {
	struct FVector DropBeginLocation; // 0x228(0x0c)
	struct FVector DropEndLocation; // 0x234(0x0c)
	float CurrZ; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	bool bOnGround; // 0x248(0x01)
	char pad_249[0x7]; // 0x249(0x07)
	struct AActor* SpawnedWarningEffect; // 0x250(0x08)
	struct AActor* WarningEffect; // 0x258(0x08)
	int32_t ThisID; // 0x260(0x04)
	char pad_264[0x4]; // 0x264(0x04)
	bool bSummonedByCharacter; // 0x268(0x01)
	char pad_269[0x7]; // 0x269(0x07)
	struct FString SNameAirDropSpawnWarning; // 0x270(0x10)
	struct FString SNameAirDropStopSpawnWarning; // 0x280(0x10)
	struct FString SNameAirDropApprochWarning; // 0x290(0x10)
	struct FString SNameAirDropStopApprochWarning; // 0x2a0(0x10)
	struct UAkComponent* AkAudioComponent; // 0x2b0(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x2b8(0x08)
	char pad_2C0[0x1]; // 0x2c0(0x01)
	bool bHasLanded; // 0x2c1(0x01)
	char pad_2C2[0x6]; // 0x2c2(0x06)

	void OnAirDropTreasureBoxStateChanged(int32_t ItemID, enum class EAirDropMovementState MovementState, enum class EAirDropOpenState OpenState); // Function Solarland.AirDropAudioActor.OnAirDropTreasureBoxStateChanged // (Final|Native|Public) // @ game+0x1c30a20
	void OnAirDropApproch(int32_t InThisID); // Function Solarland.AirDropAudioActor.OnAirDropApproch // (Final|Native|Public) // @ game+0x1c309a0
	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.AirDropAudioActor.InitSolarAkGameObject // (Final|Native|Public) // @ game+0x1c30210
};

// Class Solarland.SolarDormantActor
// Size: 0x228 (Inherited: 0x228)
struct ASolarDormantActor : AActor {
};

// Class Solarland.SolarItemActor
// Size: 0x3d0 (Inherited: 0x228)
struct ASolarItemActor : ASolarDormantActor {
	char pad_228[0x40]; // 0x228(0x40)
	struct FSolarItemData ItemData; // 0x268(0xb0)
	float SpawnOffset; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)
	struct TArray<struct FSoftObjectPath> DiscardMatPath; // 0x320(0x10)
	struct FSoftObjectPath OutlineMatPath; // 0x330(0x18)
	struct FSoftObjectPath FXPath; // 0x348(0x18)
	struct FString FXBPPath; // 0x360(0x10)
	struct USphereComponent* SphereComponent; // 0x370(0x08)
	char pad_378[0x4]; // 0x378(0x04)
	struct TWeakObjectPtr<struct AActor> FXActor; // 0x37c(0x08)
	enum class EItemState ItemCurrentState; // 0x384(0x01)
	char pad_385[0xb]; // 0x385(0x0b)
	struct TArray<char> MarkedTeamIdList; // 0x390(0x10)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct UStaticMeshComponent* StaticMeshComp; // 0x3a8(0x08)
	struct TArray<struct UMaterialInstanceDynamic*> NormalMats; // 0x3b0(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> OutlineMats; // 0x3c0(0x10)

	void UnMarkThisItem(char TeamID); // Function Solarland.SolarItemActor.UnMarkThisItem // (Native|Public) // @ game+0x1d88f20
	void SwitchDiscardMaterials(); // Function Solarland.SolarItemActor.SwitchDiscardMaterials // (Final|Native|Protected) // @ game+0x1daf410
	void SetOutlineMeshVisible(bool Visible); // Function Solarland.SolarItemActor.SetOutlineMeshVisible // (Native|Public) // @ game+0x1daf380
	void SetItemData(struct FSolarItemData& _ItemData); // Function Solarland.SolarItemActor.SetItemData // (Native|Public|HasOutParms) // @ game+0x1d88d80
	void OnServerPawned(); // Function Solarland.SolarItemActor.OnServerPawned // (Native|Public) // @ game+0x1d88b60
	void OnRep_ItemDataChange(); // Function Solarland.SolarItemActor.OnRep_ItemDataChange // (Native|Public) // @ game+0x7e17a0
	void OnRep_ItemCurrentStateChanged(); // Function Solarland.SolarItemActor.OnRep_ItemCurrentStateChanged // (Native|Protected) // @ game+0x1257850
	void NotifyThisItemWasPickedUp(); // Function Solarland.SolarItemActor.NotifyThisItemWasPickedUp // (Final|Native|Public) // @ game+0x1daee20
	void MarkThisItem(char TeamID); // Function Solarland.SolarItemActor.MarkThisItem // (Native|Public) // @ game+0x1d88aa0
	struct UStaticMeshComponent* GetStaticMeshComp(); // Function Solarland.SolarItemActor.GetStaticMeshComp // (Final|Native|Public) // @ game+0x1daee00
	int32_t GetQuality(); // Function Solarland.SolarItemActor.GetQuality // (Native|Public) // @ game+0x1d88a60
};

// Class Solarland.SolarTreasureBoxActor
// Size: 0x598 (Inherited: 0x3d0)
struct ASolarTreasureBoxActor : ASolarItemActor {
	enum class ETreasureBoxState CurrentState; // 0x3d0(0x01)
	char pad_3D1[0x7]; // 0x3d1(0x07)
	struct FSolarItemDataArray ItemDataList; // 0x3d8(0x118)
	struct TArray<struct FSolarItemData> SortedGameItemDatas; // 0x4f0(0x10)
	char pad_500[0x20]; // 0x500(0x20)
	int32_t DataLeng; // 0x520(0x04)
	enum class ECostType CostType; // 0x524(0x01)
	char pad_525[0x3]; // 0x525(0x03)
	int32_t CostNum; // 0x528(0x04)
	char pad_52C[0x54]; // 0x52c(0x54)
	int32_t HighestItemQuality; // 0x580(0x04)
	char pad_584[0x4]; // 0x584(0x04)
	struct UAkComponent* AkAudioComponent; // 0x588(0x08)
	struct USolarAkGameObject* SolarAkGameObject; // 0x590(0x08)

	void UpdateTreasureBoxInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateTreasureBoxInternal // (Native|Public) // @ game+0xa3c790
	void UpdateOpenBoxUIByState(enum class ETreasureBoxState NewState); // Function Solarland.SolarTreasureBoxActor.UpdateOpenBoxUIByState // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void UpdateItemDataListInternal(); // Function Solarland.SolarTreasureBoxActor.UpdateItemDataListInternal // (Final|Native|Public) // @ game+0x1ec1380
	void ServerSetState(enum class ETreasureBoxState NewState, struct ASolarCharacter* RequestCharacter); // Function Solarland.SolarTreasureBoxActor.ServerSetState // (Final|Native|Public) // @ game+0x1ec0fc0
	void ServerNotifyPlayerOpen(struct ASolarCharacter* RequestCharacter, enum class EItemType InItemType); // Function Solarland.SolarTreasureBoxActor.ServerNotifyPlayerOpen // (Final|Native|Public) // @ game+0x1ec0e30
	void PlayOpenAnimation(); // Function Solarland.SolarTreasureBoxActor.PlayOpenAnimation // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnRep_ItemDataList(); // Function Solarland.SolarTreasureBoxActor.OnRep_ItemDataList // (Final|Native|Public) // @ game+0x1ec0c70
	void OnRep_CurrentState(); // Function Solarland.SolarTreasureBoxActor.OnRep_CurrentState // (Final|Native|Public) // @ game+0x1ec0c10
	void OnClientItemHighestQualityChanged(int32_t NewQuality, int32_t PrevQuality); // Function Solarland.SolarTreasureBoxActor.OnClientItemHighestQualityChanged // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x1ec0b50
	bool IsEmpty(); // Function Solarland.SolarTreasureBoxActor.IsEmpty // (Final|Native|Public) // @ game+0x1ec0670
	void InitSolarAkGameObject(struct UActorComponent* Component, bool bReset); // Function Solarland.SolarTreasureBoxActor.InitSolarAkGameObject // (Final|Native|Protected) // @ game+0x1ec04c0
	int32_t GetNumCost(); // Function Solarland.SolarTreasureBoxActor.GetNumCost // (Final|Native|Public|Const) // @ game+0x1ec00b0
	struct TArray<struct FSolarItemData> GetItemList(); // Function Solarland.SolarTreasureBoxActor.GetItemList // (Final|Native|Public) // @ game+0x1ebff50
	enum class ECostType GetCostType(); // Function Solarland.SolarTreasureBoxActor.GetCostType // (Final|Native|Public|Const) // @ game+0x1ebff30
	void ConstructTreasureBoxTest(struct TArray<int32_t>& itemIdList); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBoxTest // (Final|Native|Public|HasOutParms) // @ game+0xae7770
	void ConstructTreasureBox(int32_t dropId); // Function Solarland.SolarTreasureBoxActor.ConstructTreasureBox // (Final|Native|Public) // @ game+0x90ca00
	bool BOpened(); // Function Solarland.SolarTreasureBoxActor.BOpened // (Native|Public) // @ game+0x1ebfcc0
};

// Class Solarland.AirDropTreasureBox
// Size: 0x948 (Inherited: 0x598)
struct AAirDropTreasureBox : ASolarTreasureBoxActor {
	bool bIsOpening; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	float openProgress; // 0x59c(0x04)
	struct ASolarCharacter* OpeningCharacter; // 0x5a0(0x08)
	float OpenTime; // 0x5a8(0x04)
	float ProtectionTime; // 0x5ac(0x04)
	char pad_5B0[0xd]; // 0x5b0(0x0d)
	bool bBoxLanded; // 0x5bd(0x01)
	char pad_5BE[0x52]; // 0x5be(0x52)
	struct FString SummonPlayerID; // 0x610(0x10)
	float StartDropHeight; // 0x620(0x04)
	struct FRotator TargetRotation; // 0x624(0x0c)
	struct FVector TargetLocation; // 0x630(0x0c)
	char pad_63C[0x4]; // 0x63c(0x04)
	struct UParticleSystem* LandHitEffect; // 0x640(0x08)
	struct AActor* WarningEffect; // 0x648(0x08)
	struct TSoftObjectPtr<UParticleSystem> LandSmokeEffect; // 0x650(0x28)
	struct ASolarAbility* RangeAbility; // 0x678(0x08)
	float dropGravity; // 0x680(0x04)
	float maxDropSpeed; // 0x684(0x04)
	float originHeight; // 0x688(0x04)
	float DecelerateHeight; // 0x68c(0x04)
	float DecelerateTime; // 0x690(0x04)
	float AirDropSpawnDelay; // 0x694(0x04)
	float AudioActorHeightOffset; // 0x698(0x04)
	float AudioActorFallSpeed; // 0x69c(0x04)
	struct FSoftClassPath AirDropGuideMeshBPClassPath; // 0x6a0(0x18)
	float DropApprochDuration; // 0x6b8(0x04)
	bool bSummonBySkill; // 0x6bc(0x01)
	enum class EAirDropMovementState MovementState; // 0x6bd(0x01)
	enum class EAirDropOpenState OpenState; // 0x6be(0x01)
	char pad_6BF[0x51]; // 0x6bf(0x51)
	struct FString SNameAirDropOpen; // 0x710(0x10)
	struct FString SNameLandHit; // 0x720(0x10)
	struct FString SNameAirDropSpawn; // 0x730(0x10)
	struct FString SNameAirDropSpawnWarning; // 0x740(0x10)
	struct FString SNameAirDropStopSpawnWarning; // 0x750(0x10)
	struct FString SNameAirDropApprochWarning; // 0x760(0x10)
	struct FString SNameAirDropStopApprochWarning; // 0x770(0x10)
	struct FString SNameStartDrop; // 0x780(0x10)
	struct FString SNameStopDrop; // 0x790(0x10)
	struct FString SNameDecelerateAudio; // 0x7a0(0x10)
	struct FString SNamePlayLandedLoopAudio; // 0x7b0(0x10)
	struct FString SNameStopLandedLoopAudio; // 0x7c0(0x10)
	struct FString SNamePlayOnGroundBroadcastLoopAudio; // 0x7d0(0x10)
	struct FString SNameStopOnGroundBroadcastLoopAudio; // 0x7e0(0x10)
	struct FString SNamePlayStartHackAudio; // 0x7f0(0x10)
	struct FString SNameStopStartHackAudio; // 0x800(0x10)
	struct FString SNamePlayHackingLoopAudio; // 0x810(0x10)
	struct FString SNameStopHackingLoopAudio; // 0x820(0x10)
	struct FString SNameStopHackingLoopAudioAux; // 0x830(0x10)
	char pad_840[0x108]; // 0x840(0x108)

	void PlayLandingAnimation(); // Function Solarland.AirDropTreasureBox.PlayLandingAnimation // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	bool OpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.OpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x1c30d60
	void OnStateChanged(); // Function Solarland.AirDropTreasureBox.OnStateChanged // (Native|Public) // @ game+0x12586b0
	void OnRep_TargetLocation(); // Function Solarland.AirDropTreasureBox.OnRep_TargetLocation // (Final|Native|Public) // @ game+0x8ba190
	void OnRep_SummonPlayerID(); // Function Solarland.AirDropTreasureBox.OnRep_SummonPlayerID // (Final|Native|Public) // @ game+0x1c30d20
	void OnRep_StartDropHeight(); // Function Solarland.AirDropTreasureBox.OnRep_StartDropHeight // (Final|Native|Public) // @ game+0x1c30d00
	void OnRep_OpenState(enum class EAirDropOpenState OpenState); // Function Solarland.AirDropTreasureBox.OnRep_OpenState // (Final|Native|Public) // @ game+0x1c30c80
	void OnRep_OpenProgressChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenProgressChange // (Final|Native|Public) // @ game+0x1c30c60
	void OnRep_OpenCharacterChange(); // Function Solarland.AirDropTreasureBox.OnRep_OpenCharacterChange // (Final|Native|Public) // @ game+0x1c30c40
	void OnRep_MovementState(enum class EAirDropMovementState MovementState); // Function Solarland.AirDropTreasureBox.OnRep_MovementState // (Final|Native|Public) // @ game+0x1c30bc0
	void OnRep_IsOpening(); // Function Solarland.AirDropTreasureBox.OnRep_IsOpening // (Final|Native|Public) // @ game+0x1c30ba0
	void OnRep_bBoxLanded(); // Function Solarland.AirDropTreasureBox.OnRep_bBoxLanded // (Final|Native|Public) // @ game+0x1c30d40
	void OnOpenStateChanged(enum class EAirDropOpenState InPrevOpenState, enum class EAirDropOpenState InCurrOpenState); // Function Solarland.AirDropTreasureBox.OnOpenStateChanged // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnMovementStateChanged(enum class EAirDropMovementState InPrevMovementState, enum class EAirDropMovementState InCurrMovementState); // Function Solarland.AirDropTreasureBox.OnMovementStateChanged // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	bool IsSummonedByCharacter(); // Function Solarland.AirDropTreasureBox.IsSummonedByCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x1c30720
	bool IsOpenningCharacterOffline(); // Function Solarland.AirDropTreasureBox.IsOpenningCharacterOffline // (Final|Native|Protected) // @ game+0x1c306f0
	bool IsOpeningCharacterInRange(); // Function Solarland.AirDropTreasureBox.IsOpeningCharacterInRange // (Final|Native|Protected) // @ game+0x1c306c0
	bool CancelOpenAirDropTreasureBox(struct ASolarCharacter* _OpeningCharacter); // Function Solarland.AirDropTreasureBox.CancelOpenAirDropTreasureBox // (Final|Native|Public) // @ game+0x1c2f000
};

// Class Solarland.AirlineCruiseCompInterface
// Size: 0x28 (Inherited: 0x28)
struct UAirlineCruiseCompInterface : UInterface {

	struct UAirlineCruiseComponent* GetAirlineCruiseComponent(); // Function Solarland.AirlineCruiseCompInterface.GetAirlineCruiseComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c2f2f0
};

// Class Solarland.GameModeCompBase
// Size: 0xd0 (Inherited: 0xb0)
struct UGameModeCompBase : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	bool bPreStartPlay; // 0xb8(0x01)
	bool bTakeChargeStartPlay; // 0xb9(0x01)
	bool bPostStartPlay; // 0xba(0x01)
	char pad_BB[0x2]; // 0xbb(0x02)
	bool bPreHandleMatchHasStarted; // 0xbd(0x01)
	bool bTakeChargeHandleMatchHasStarted; // 0xbe(0x01)
	bool bPostHandleMatchHasStarted; // 0xbf(0x01)
	char pad_C0[0x2]; // 0xc0(0x02)
	bool bPreRestartPlayer; // 0xc2(0x01)
	bool bTakeChargeRestartPlayer; // 0xc3(0x01)
	bool bPostRestartPlayer; // 0xc4(0x01)
	char pad_C5[0x2]; // 0xc5(0x02)
	bool bPreEndPlay; // 0xc7(0x01)
	bool bTakeChargeEndPlay; // 0xc8(0x01)
	bool bPostEndPlay; // 0xc9(0x01)
	char pad_CA[0x6]; // 0xca(0x06)

	void PreStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c72780
	void PreRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c72690
	void PreHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c725e0
	void PreGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c72530
	void PreGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PreGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c72430
	void PreGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PreGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c72380
	void PreGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c72280
	void PreEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PreEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c72190
	void PostStartPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostStartPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c720e0
	void PostRestartPlayerBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostRestartPlayerBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c71ff0
	void PostHandleMatchHasStartedBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostHandleMatchHasStartedBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c71f40
	void PostGameModeStartPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71e90
	void PostGameModeRestartPlayer(struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.PostGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71d90
	void PostGameModeHandleMatchHasStarted(struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.PostGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71ce0
	void PostGameModeEndPlay(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71be0
	void PostEndPlayBind(struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.PostEndPlayBind // (Final|Native|Protected|HasOutParms) // @ game+0x1c71af0
	void OnGameModeStartPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeStartPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71920
	void OnGameModeRestartPlayer(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, struct AController* NewPlayer); // Function Solarland.GameModeCompBase.OnGameModeRestartPlayer // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c717e0
	void OnGameModeHandleMatchHasStarted(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection); // Function Solarland.GameModeCompBase.OnGameModeHandleMatchHasStarted // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c716d0
	void OnGameModeEndPlay(bool& bOutSuccess, struct TArray<struct UGameModeCompBase*>& ComponentCollection, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameModeCompBase.OnGameModeEndPlay // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c71580
	struct ASolarGameMode* GetGameModeOwner(); // Function Solarland.GameModeCompBase.GetGameModeOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71010
};

// Class Solarland.AirlineCruiseComponent
// Size: 0x198 (Inherited: 0xd0)
struct UAirlineCruiseComponent : UGameModeCompBase {
	int32_t UsedAirlineID; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)
	struct ASolarCapsuleRoot* CapsuleRootClass; // 0xd8(0x08)
	struct ASolarCapsuleRoot* CapsuleRoot; // 0xe0(0x08)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0xe8(0x50)
	struct ASolarCharacter* CruiseTemplate; // 0x138(0x08)
	char pad_140[0x8]; // 0x140(0x08)
	struct ASolarFlyTrail* FlyTrailClass; // 0x148(0x08)
	bool bEnableSkydiveTrail; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)
	struct ASolarFlyTrail* FlyTrailActor; // 0x158(0x08)
	bool bDebugFlyTrail; // 0x160(0x01)
	char pad_161[0x7]; // 0x161(0x07)
	struct TSoftClassPtr<UObject> DebugTrailEffectClass; // 0x168(0x28)
	bool bDebugFlyTrailPlayer; // 0x190(0x01)
	char pad_191[0x7]; // 0x191(0x07)

	void OnPlayerJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnPlayerJoin // (Final|Native|Protected) // @ game+0x1c30920
	void OnCruiseCompleted(struct AActor* DestroyedRoot); // Function Solarland.AirlineCruiseComponent.OnCruiseCompleted // (Final|Native|Protected) // @ game+0x1c30b20
	void OnAIJoin(struct ASCMPlayerState* PlayerState); // Function Solarland.AirlineCruiseComponent.OnAIJoin // (Final|Native|Protected) // @ game+0x1c30920
	int32_t GetUsedAirlineData(struct FAirlineData& outData); // Function Solarland.AirlineCruiseComponent.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c2f360
};

// Class Solarland.AmmoConfig
// Size: 0x660 (Inherited: 0x30)
struct UAmmoConfig : UDataAsset {
	enum class EHoldActionType HoldAction; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct TArray<struct FFireChargeData> FireChargeDatas; // 0x38(0x10)
	struct FString FireChargeStopSoundName; // 0x48(0x10)
	float ChargingToleranceEndTime; // 0x58(0x04)
	float ChargingWorkingEndTime; // 0x5c(0x04)
	float ChargingHoldingEndTime; // 0x60(0x04)
	float ChargingTrajectoryTime; // 0x64(0x04)
	bool bScaleHitEffectByChargingTime; // 0x68(0x01)
	bool bCostToChargeScale; // 0x69(0x01)
	char pad_6A[0x2]; // 0x6a(0x02)
	int32_t FireCostFullShot; // 0x6c(0x04)
	bool bForceFullShot; // 0x70(0x01)
	char pad_71[0x3]; // 0x71(0x03)
	float MaxChargingDamageScale; // 0x74(0x04)
	bool bIsTracer; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	struct FTracerBulletData TracerData; // 0x7c(0x0c)
	float DeltaAngle; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)
	struct FString Name; // 0x90(0x10)
	struct FString Des; // 0xa0(0x10)
	int32_t PropID; // 0xb0(0x04)
	float Lifetime; // 0xb4(0x04)
	enum class EFireMethodType FireMethodType; // 0xb8(0x01)
	enum class ETrajectoryType TrajectoryType; // 0xb9(0x01)
	char pad_BA[0x2]; // 0xba(0x02)
	float CustomValue; // 0xbc(0x04)
	struct ASolarBullet* BulletClass; // 0xc0(0x08)
	enum class EBounceType BulletBounce; // 0xc8(0x01)
	char pad_C9[0x3]; // 0xc9(0x03)
	int32_t BounceTimes; // 0xcc(0x04)
	enum class ETriggerType TriggerType; // 0xd0(0x01)
	char pad_D1[0x3]; // 0xd1(0x03)
	float MaxRange; // 0xd4(0x04)
	float EffRange; // 0xd8(0x04)
	float Radius; // 0xdc(0x04)
	float InitSpeed; // 0xe0(0x04)
	enum class ECostFireType FireCostType; // 0xe4(0x01)
	char pad_E5[0x3]; // 0xe5(0x03)
	int32_t FireCostPerAttack; // 0xe8(0x04)
	int32_t FireSpeedChangeTime; // 0xec(0x04)
	float FireSpeedChangeCOP; // 0xf0(0x04)
	float FastestFireInterval; // 0xf4(0x04)
	float SlowestFireInterval; // 0xf8(0x04)
	float BaseFireInterval; // 0xfc(0x04)
	float FireIntervalRevertPreTime; // 0x100(0x04)
	float FireIntervalReavertSpeed; // 0x104(0x04)
	float BoltActionTime; // 0x108(0x04)
	float StartBoltDuration; // 0x10c(0x04)
	float AutoFireBreakTime; // 0x110(0x04)
	float FirePrepareTime; // 0x114(0x04)
	float FireStateBreakTime; // 0x118(0x04)
	float FireStreakBreakTime; // 0x11c(0x04)
	int32_t FireIdx; // 0x120(0x04)
	bool bTimedExplode; // 0x124(0x01)
	char pad_125[0x3]; // 0x125(0x03)
	float BaseReloadTime; // 0x128(0x04)
	float PostFireOverload; // 0x12c(0x04)
	bool bPlayHitSound; // 0x130(0x01)
	bool bPlayExplodeSound; // 0x131(0x01)
	char pad_132[0x2]; // 0x132(0x02)
	float FlySoundReceiveRadius; // 0x134(0x04)
	float FlySoundIgnoreDistance; // 0x138(0x04)
	int32_t SingleSoundCount; // 0x13c(0x04)
	struct FString Play_Land_Common_Hit_1P; // 0x140(0x10)
	struct FString Play_Land_Common_Hit_3P; // 0x150(0x10)
	struct FString Play_Land_Common_Hit_3P_Enemy; // 0x160(0x10)
	struct FString Play_Land_Fly_Once_3P; // 0x170(0x10)
	struct FString Play_Land_Fly_Once_3P_Enemy; // 0x180(0x10)
	struct FString Play_Land_Fly_Loop_1P; // 0x190(0x10)
	struct FString Play_Land_Fly_Loop_3P; // 0x1a0(0x10)
	struct FString Play_Land_Fly_Loop_3P_Enemy; // 0x1b0(0x10)
	struct FString Stop_Land_Fly_Loop_1P; // 0x1c0(0x10)
	struct FString Stop_Land_Fly_Loop_3P; // 0x1d0(0x10)
	struct FString Stop_Land_Fly_Loop_3P_Enemy; // 0x1e0(0x10)
	struct FString Play_Fire_Empty_1p; // 0x1f0(0x10)
	struct FString Play_Fire_Empty_3p; // 0x200(0x10)
	struct FString Play_Fire_Empty_3p_Enemy; // 0x210(0x10)
	struct UCurveFloat* PostFireSpreadCurveStruct; // 0x220(0x08)
	float VhADSSpreadCOP; // 0x228(0x04)
	float ADSSpreadCOP; // 0x22c(0x04)
	float SpreadFirePreTime; // 0x230(0x04)
	float SpreadPostFireSpeed; // 0x234(0x04)
	float SpreadRestorePreTime; // 0x238(0x04)
	float SpreadRestoreSpeed; // 0x23c(0x04)
	struct TArray<float> SkillCDDiscountArray; // 0x240(0x10)
	struct FWeaponFireTPPAnimConfig TPPRecoilConfig; // 0x250(0x28)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigNoScope; // 0x278(0x70)
	struct FWeaponFireFPPAnimConfig FPPRecoilConfigWithScope; // 0x2e8(0x70)
	struct FAmmonVerticalRecoilStruct PitchRecoilStruct; // 0x358(0x30)
	struct FAmmonHorizontalRecoilStruct YawRecoilStruct; // 0x388(0x30)
	struct FAmmonRecoilRollStruct RollRecoilStruct; // 0x3b8(0x40)
	struct FAmmonRecoilScope ScopeRecoil; // 0x3f8(0xb8)
	float ADSRecoilCOP; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)
	struct TMap<struct FString, float> RecoilCOPMap; // 0x4b8(0x50)
	struct TArray<enum class EPhysicalSurface> IgnoreEPhysicalSurface; // 0x508(0x10)
	struct FSoftObjectPath SummonConfigPath; // 0x518(0x18)
	bool bAutoBurstFire; // 0x530(0x01)
	char pad_531[0x3]; // 0x531(0x03)
	float BurstFireInterval; // 0x534(0x04)
	float BurstFireInternalInterval; // 0x538(0x04)
	float FireAnimationPlayRate; // 0x53c(0x04)
	int32_t AmmoSoundType; // 0x540(0x04)
	float ProjectileMaxGravity; // 0x544(0x04)
	float ParticleStartDistance; // 0x548(0x04)
	float TrajectoryStartDistance; // 0x54c(0x04)
	bool bPenetrable; // 0x550(0x01)
	char pad_551[0x3]; // 0x551(0x03)
	float PenetrationRadius; // 0x554(0x04)
	struct UCurveFloat* PenetrationDamageMultiplierCurve; // 0x558(0x08)
	struct UCurveFloat* CylinderDamageMultiplierCurve; // 0x560(0x08)
	struct FSlateBrush TriggerIcon; // 0x568(0x98)
	struct UCurveFloat* BulletDamageCurve; // 0x600(0x08)
	struct UCurveFloat* BulletScaleCurve; // 0x608(0x08)
	struct UCurveFloat* BulletSpeedCurve; // 0x610(0x08)
	bool bThirdPesonViewXScaledByDistance; // 0x618(0x01)
	bool bForceApplyAbility; // 0x619(0x01)
	char pad_61A[0x6]; // 0x61a(0x06)
	struct TArray<struct ASolarAbility*> AmmoAbilityClasses; // 0x620(0x10)
	struct TArray<struct ASolarAbility*> AmmoAbilityClassesOnDestroyed; // 0x630(0x10)
	struct ASolarAbility* AmmoAbilityClassesOnSelf; // 0x640(0x08)
	int32_t SkillType; // 0x648(0x04)
	int32_t NameLocalTextIDNumber; // 0x64c(0x04)
	int32_t DescriptionLocalTextIDNumber; // 0x650(0x04)
	int32_t RangeLocalTextID; // 0x654(0x04)
	int32_t DifficultyLocalTextID; // 0x658(0x04)
	char pad_65C[0x4]; // 0x65c(0x04)

	void InitVerticalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitVerticalRecoilStruct // (Final|Native|Public|Const) // @ game+0x1c304c0
	void InitSpreadData(float adscop, float vhadscop, float firepre, float changespeed, float restorepre, float restorespeed); // Function Solarland.AmmoConfig.InitSpreadData // (Final|Native|Public|Const) // @ game+0x1c302e0
	void InitScopeRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitScopeRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x1c2ffd0
	void InitScopeAndCrossHairVibration(float ScopeVMaxDistanceOffSet, float ScopeVVibrationDuration, float ScopeHMaxDistanceOffSet, float ScopeHVibrationDuration, float ScopeVContinuousFallingDuration, float ScopeVContinuousFallingPointIndex, float VMaxDistanceOffSetScale, float VVibrationDurationScale, float VSingleOffSetScale, float VContinuousOffSetScale, float HMaxDistanceOffSetScale, float HVibrationDurationScale, float HSingleOffSetScale, float HContinuousOffSetScale, float HOffSetProbabilityScale); // Function Solarland.AmmoConfig.InitScopeAndCrossHairVibration // (Final|Native|Public|Const) // @ game+0x1c2fb70
	void InitRollRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax, float adscop); // Function Solarland.AmmoConfig.InitRollRecoilStruct // (Final|Native|Public|Const) // @ game+0x1c2f930
	void InitRecoilCOPMap(struct TArray<struct FString>& Keys, struct TArray<float>& Values); // Function Solarland.AmmoConfig.InitRecoilCOPMap // (Final|Native|Public|HasOutParms|Const) // @ game+0x1c2f7f0
	void InitPostFireSpreadCurveStruct(struct FString Path); // Function Solarland.AmmoConfig.InitPostFireSpreadCurveStruct // (Final|Native|Public|Const) // @ game+0x1c2f750
	void InitHorizontalRecoilStruct(float CostTime, int32_t AIndex, float AMin, float AMax, int32_t BIndex, float BMin, float BMax); // Function Solarland.AmmoConfig.InitHorizontalRecoilStruct // (Final|Native|Public|Const) // @ game+0x1c2f550
	void InitBaseData(int32_t Trigger); // Function Solarland.AmmoConfig.InitBaseData // (Final|Native|Public|Const) // @ game+0x1c2f4d0
};

// Class Solarland.AndroidInputManager
// Size: 0x38 (Inherited: 0x28)
struct UAndroidInputManager : UObject {
	struct FMulticastInlineDelegate OnAndroidBackPressed; // 0x28(0x10)
};

// Class Solarland.AnimNotify_CharacterFootEffect
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterFootEffect : UAnimNotify {
	struct TArray<struct FFootEffect> FootEffectList; // 0x38(0x10)

	void AddNewFootEffect(struct FFootEffect& NewEffect); // Function Solarland.AnimNotify_CharacterFootEffect.AddNewFootEffect // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x1c35710
};

// Class Solarland.SolarAnimNotify
// Size: 0x40 (Inherited: 0x38)
struct USolarAnimNotify : UAnimNotify {
	bool bDynamic; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotify_CharacterStartSound
// Size: 0x80 (Inherited: 0x40)
struct UAnimNotify_CharacterStartSound : USolarAnimNotify {
	struct TArray<struct FCharacterSound> SoundList; // 0x40(0x10)
	bool bUseSwitch; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
	struct TArray<struct FString> SwitchGroupNames; // 0x58(0x10)
	bool bUseRTPC; // 0x68(0x01)
	char pad_69[0x7]; // 0x69(0x07)
	struct TArray<struct FString> RPTCNames; // 0x70(0x10)

	int32_t RemoveAllSwitches(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllSwitches // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c36380
	int32_t RemoveAllRPTCs(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllRPTCs // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c36350
	int32_t RemoveAllCharacterSounds(); // Function Solarland.AnimNotify_CharacterStartSound.RemoveAllCharacterSounds // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c36320
	void AddNewSwitch(struct FString NewSwitch); // Function Solarland.AnimNotify_CharacterStartSound.AddNewSwitch // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c35870
	void AddNewRPTC(struct FString NewRTPC); // Function Solarland.AnimNotify_CharacterStartSound.AddNewRPTC // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c357d0
	void AddNewCharacterSound(struct FCharacterSound& NewSound); // Function Solarland.AnimNotify_CharacterStartSound.AddNewCharacterSound // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x1c35570
};

// Class Solarland.AnimNotify_CharacterStopSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_CharacterStopSound : UAnimNotify {
	struct TArray<struct FCharacterSound> StopList; // 0x38(0x10)

	int32_t RemoveAllCharacterSoundStops(); // Function Solarland.AnimNotify_CharacterStopSound.RemoveAllCharacterSoundStops // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1c362f0
	void AddNewCharacterSoundStop(struct FCharacterSound& NewStop); // Function Solarland.AnimNotify_CharacterStopSound.AddNewCharacterSoundStop // (Final|Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x1c35640
};

// Class Solarland.AnimNotify_ExecuteGameplayCueLocal
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_ExecuteGameplayCueLocal : UAnimNotify {
	struct FGameplayCueTag GameplayCueTag; // 0x38(0x08)
};

// Class Solarland.AnimNotify_FlyWaterEffect
// Size: 0x88 (Inherited: 0x38)
struct UAnimNotify_FlyWaterEffect : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FName SocketName; // 0x68(0x08)
	struct FVector LocationOffset; // 0x70(0x0c)
	struct FRotator RotationOffset; // 0x7c(0x0c)
};

// Class Solarland.AnimNotify_LegVehicleRiseDust
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_LegVehicleRiseDust : UAnimNotify {
	struct TArray<int32_t> NotifyFootIndex; // 0x38(0x10)
};

// Class Solarland.AnimNotify_PlayParticleAsync
// Size: 0xb0 (Inherited: 0x38)
struct UAnimNotify_PlayParticleAsync : UAnimNotify {
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	struct FVector LocationOffset; // 0x68(0x0c)
	struct FRotator RotationOffset; // 0x74(0x0c)
	struct FVector Scale; // 0x80(0x0c)
	char pad_8C[0x14]; // 0x8c(0x14)
	char Attached : 1; // 0xa0(0x01)
	char pad_A0_1 : 7; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FName SocketName; // 0xa4(0x08)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.AnimNotify_PlayPickupSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_PlayPickupSound : UAnimNotify {
	struct FString DefaultSoundEventName; // 0x38(0x10)

	struct FString GetDefaultSoundEventName(); // Function Solarland.AnimNotify_PlayPickupSound.GetDefaultSoundEventName // (Final|Native|Public|Const) // @ game+0x1c35e10
};

// Class Solarland.AnimNotify_ReloadClip
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_ReloadClip : UAnimNotify {
	struct FName HandBoneName; // 0x38(0x08)
	enum class EAnimReloadNotifyType StepType; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
};

// Class Solarland.AnimNotify_ShieldEndRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldEndRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldHideRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldHideRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldOperatorSet
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldOperatorSet : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldShowRechargeFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldShowRechargeFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldStartRecharge
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldStartRecharge : UAnimNotify {
};

// Class Solarland.AnimNotify_ShieldUpgradeFinishFX
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ShieldUpgradeFinishFX : UAnimNotify {
};

// Class Solarland.AnimNotify_ThrowThrown
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_ThrowThrown : UAnimNotify {
};

// Class Solarland.AnimNotify_VehicleCameraShake
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_VehicleCameraShake : UAnimNotify {
	struct UCameraShake* VehicleCameraShake; // 0x38(0x08)
};

// Class Solarland.AnimNotify_VehicleFlyRoll
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotify_VehicleFlyRoll : UAnimNotify {
	enum class EVehicleFlyRollType VehicleRollType; // 0x38(0x01)
	bool bEnter; // 0x39(0x01)
	char pad_3A[0x2]; // 0x3a(0x02)
	float RollMoveSpeed; // 0x3c(0x04)
};

// Class Solarland.AnimNotify_VehiclePlaySound
// Size: 0x60 (Inherited: 0x38)
struct UAnimNotify_VehiclePlaySound : UAnimNotify {
	bool bCheckEnemy; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FString SameTeamSound; // 0x40(0x10)
	struct FString EnemySound; // 0x50(0x10)
};

// Class Solarland.AnimNotify_VehiclePreviewSound
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehiclePreviewSound : UAnimNotify {
	struct FString Sound; // 0x38(0x10)
};

// Class Solarland.AnimNotify_VehicleVFX
// Size: 0x48 (Inherited: 0x38)
struct UAnimNotify_VehicleVFX : UAnimNotify {
	struct TArray<struct FVehicleVFX> VehicleVFXes; // 0x38(0x10)
};

// Class Solarland.AnimNotify_WeaponBolt
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotify_WeaponBolt : UAnimNotify {
};

// Class Solarland.AnimNotifyState_AddLooseGameplayTag
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_AddLooseGameplayTag : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
};

// Class Solarland.AnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AllowPhysicsRotationDuringAnimRootMotion : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_AutoCancelOnInputReleased
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_AutoCancelOnInputReleased : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_CharacterLoopedSound
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_CharacterLoopedSound : UAnimNotifyState {
	struct TArray<struct FCharacterSound> EventListToPlay; // 0x30(0x10)
	struct TArray<struct FCharacterSound> EventListToStop; // 0x40(0x10)
};

// Class Solarland.AnimNotifyState_InhibitAimOffset
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitAimOffset : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_InhibitLeftHandWeaponAttach
// Size: 0x40 (Inherited: 0x30)
struct UAnimNotifyState_InhibitLeftHandWeaponAttach : UAnimNotifyState {
	float InhibitSmoothTime; // 0x30(0x04)
	float RecoverSmoothTime; // 0x34(0x04)
	bool bCalcRecoverSmoothTimeByRemainingTime; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Solarland.AnimNotifyState_OpenTreasureBox
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_OpenTreasureBox : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_PlayGameplayCueLocal
// Size: 0x38 (Inherited: 0x30)
struct UAnimNotifyState_PlayGameplayCueLocal : UAnimNotifyState {
	struct FGameplayCueTag GameplayCueTag; // 0x30(0x08)
};

// Class Solarland.AnimNotifyState_RechargeShield
// Size: 0x58 (Inherited: 0x30)
struct UAnimNotifyState_RechargeShield : UAnimNotifyState {
	struct FGameplayTagContainer GameplayTags; // 0x30(0x20)
	bool bFXorMesh; // 0x50(0x01)
	char pad_51[0x7]; // 0x51(0x07)
};

// Class Solarland.AnimNotifyState_RepairVehicleWeakPoints
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_RepairVehicleWeakPoints : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_ShieldUpgradeFX
// Size: 0x30 (Inherited: 0x30)
struct UAnimNotifyState_ShieldUpgradeFX : UAnimNotifyState {
};

// Class Solarland.AnimNotifyState_SolarSpawnMeshAndAttach
// Size: 0x50 (Inherited: 0x30)
struct UAnimNotifyState_SolarSpawnMeshAndAttach : UAnimNotifyState {
	struct TArray<struct FAttachedMeshInfo> MeshesInfo; // 0x30(0x10)
	struct TArray<struct UStaticMeshComponent*> SpawnedMeshComps; // 0x40(0x10)
};

// Class Solarland.AnimNotifyState_SolarTimedParticleEffect
// Size: 0xb0 (Inherited: 0x30)
struct UAnimNotifyState_SolarTimedParticleEffect : UAnimNotifyState {
	bool bAsyncLoad; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
	struct UParticleSystem* PSTemplate; // 0x38(0x08)
	struct TSoftObjectPtr<UParticleSystem> PSTemplateSoft; // 0x40(0x28)
	bool Attached; // 0x68(0x01)
	char pad_69[0x3]; // 0x69(0x03)
	struct FName SocketName; // 0x6c(0x08)
	struct FVector LocationOffset; // 0x74(0x0c)
	struct FRotator RotationOffset; // 0x80(0x0c)
	struct FVector Scale; // 0x8c(0x0c)
	bool bDestroyAtEnd; // 0x98(0x01)
	bool bLockRelativeRotation; // 0x99(0x01)
	char pad_9A[0x16]; // 0x9a(0x16)
};

// Class Solarland.AttributeSubExecCalc
// Size: 0x68 (Inherited: 0x40)
struct UAttributeSubExecCalc : UGameplayEffectExecutionCalculation {
	struct UAttributeSubExecProxy* CDOProxyClass; // 0x40(0x08)
	struct UAttributeSubExecProxy* CDOProxy; // 0x48(0x08)
	char pad_50[0x18]; // 0x50(0x18)
};

// Class Solarland.AttributeSubExecProxy
// Size: 0x30 (Inherited: 0x28)
struct UAttributeSubExecProxy : UObject {
	struct TWeakObjectPtr<struct UAttributeSubExecCalc> CDOOwner; // 0x28(0x08)

	void ModifyAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, enum class EAttributeSubBehavior Behavior, int32_t AttributeSubID, struct FName AttrSubTag, float ModifyValue); // Function Solarland.AttributeSubExecProxy.ModifyAttributeSub // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c36160
	struct FGameplayModifierEvaluatedData MakeExecProxyEvaluated(struct FGameplayAttribute InAttribute, float InMagnitud); // Function Solarland.AttributeSubExecProxy.MakeExecProxyEvaluated // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1c35e90
	void ExecutePureAttributeSub(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs); // Function Solarland.AttributeSubExecProxy.ExecutePureAttributeSub // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void ExecuteAttributeCalculation(struct USolarAttributeSubComponent* AttrSubComp, struct TArray<struct FAttributeSubSetting>& InAttributeSubs, struct TArray<struct FGameplayAttribute>& InAttribute, struct TArray<struct FGameplayModifierEvaluatedData>& OutModResults); // Function Solarland.AttributeSubExecProxy.ExecuteAttributeCalculation // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	struct UAttributeSubExecProxy* CreateProxy(struct UAttributeSubExecCalc* InCDOOwner, struct UAttributeSubExecProxy* ProxyClass); // Function Solarland.AttributeSubExecProxy.CreateProxy // (Final|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x1c35d50
};

// Class Solarland.AttributeSubGameplayEffect
// Size: 0x868 (Inherited: 0x848)
struct UAttributeSubGameplayEffect : UGameplayEffect {
	struct TArray<struct FAttributeSubSetting> AttributeSubMods; // 0x848(0x10)
	struct TArray<struct FAttributeSubSetting> PureAttributeSubs; // 0x858(0x10)

	void UpdateAttributeBySub(struct FGameplayAttribute Attribute); // Function Solarland.AttributeSubGameplayEffect.UpdateAttributeBySub // (Final|Native|Public|BlueprintCallable) // @ game+0x1c363b0
	struct UAttributeSubGameplayEffect* CreateAttributeSubEffectInstance(struct UObject* Outer, struct UAttributeSubExecCalc* AttributeSubCalcClass, struct UAttributeSubGameplayEffect* Class); // Function Solarland.AttributeSubGameplayEffect.CreateAttributeSubEffectInstance // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c35c60
	void CancelPureAttributeSub(int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x1c35be0
	void CancelAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID); // Function Solarland.AttributeSubGameplayEffect.CancelAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x1c359e0
	void AddPureAttributeSub(int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddPureAttributeSub // (Final|Native|Public|BlueprintCallable) // @ game+0x1c35910
	void AddAttributeSubModify(struct FGameplayAttribute Attribute, int32_t AttributeSubID, float Value); // Function Solarland.AttributeSubGameplayEffect.AddAttributeSubModify // (Final|Native|Public|BlueprintCallable) // @ game+0x1c35350
};

// Class Solarland.AttributeSubInterface
// Size: 0x28 (Inherited: 0x28)
struct UAttributeSubInterface : UInterface {

	struct USolarAttributeSubComponent* GetAttributeSubComponent(); // Function Solarland.AttributeSubInterface.GetAttributeSubComponent // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c2f2f0
};

// Class Solarland.VertAnimMeshComponent
// Size: 0x630 (Inherited: 0x600)
struct UVertAnimMeshComponent : UStaticMeshComponent {
	char pad_600[0x30]; // 0x600(0x30)

	void PlayInfo(struct FVertexAnimInfo& InAnimInfo); // Function Solarland.VertAnimMeshComponent.PlayInfo // (Final|Native|Public|HasOutParms) // @ game+0x1f1e9e0
	void Play(int32_t InStartFrame, int32_t InEndFrame, float InLength, bool InLoop); // Function Solarland.VertAnimMeshComponent.Play // (Final|Native|Public) // @ game+0x1f1e890
};

// Class Solarland.BackpackVertAnimMeshComponent
// Size: 0x710 (Inherited: 0x630)
struct UBackpackVertAnimMeshComponent : UVertAnimMeshComponent {
	struct FVertexAnimInfo DefaultAnimInfo; // 0x628(0x10)
	struct TMap<enum class EBackPackAnimSubType, struct FVertexAnimInfo> BackPackAnimInfoMap; // 0x638(0x50)
	struct ASolarCharacter* SolarCharacter; // 0x688(0x08)
	struct ASolarBackpackActor* BackPackActor; // 0x690(0x08)
	char pad_6A0[0x70]; // 0x6a0(0x70)
};

// Class Solarland.SolarAttributeSet
// Size: 0x30 (Inherited: 0x30)
struct USolarAttributeSet : UAttributeSet {

	void K2_SetAttributeValue(struct FName AttributeName, float NewVal); // Function Solarland.SolarAttributeSet.K2_SetAttributeValue // (Final|Native|Protected|BlueprintCallable) // @ game+0x1cf2130
	void K2_OnReplicationAttribute(struct FGameplayAttributeData& OldValue, struct FGameplayAttributeData& ReplicatedAttribute, struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_OnReplicationAttribute // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1cf1ff0
	void K2_InitAttributeValue(struct FGameplayAttributeData& OriginAttribute, float NewVal); // Function Solarland.SolarAttributeSet.K2_InitAttributeValue // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1cf1f00
	float K2_GetAttributeValue(struct FGameplayAttributeData& OriginAttribute); // Function Solarland.SolarAttributeSet.K2_GetAttributeValue // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1ce2320
	struct FGameplayAttribute K2_GetAttribute(struct FName AttributeName); // Function Solarland.SolarAttributeSet.K2_GetAttribute // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1cf1db0
};

// Class Solarland.BasalAttributeSet
// Size: 0x50 (Inherited: 0x30)
struct UBasalAttributeSet : USolarAttributeSet {
	struct FGameplayAttributeData MaxHealth; // 0x30(0x10)
	struct FGameplayAttributeData CurrentHealth; // 0x40(0x10)

	void OnRep_MaxHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_MaxHealth // (Native|Protected|HasOutParms) // @ game+0x1c3ca70
	void OnRep_CurrentHealth(struct FGameplayAttributeData& Previous); // Function Solarland.BasalAttributeSet.OnRep_CurrentHealth // (Native|Protected|HasOutParms) // @ game+0x1c3c9c0
};

// Class Solarland.BattleChat
// Size: 0x338 (Inherited: 0x260)
struct UBattleChat : UUserWidget {
	struct UGaugeImage* ChatCDMask; // 0x260(0x08)
	struct UImage* ImgBG; // 0x268(0x08)
	struct UCheckBoxGroup* CBGroupOperation; // 0x270(0x08)
	struct UScrollBox* PanelChatOptions; // 0x278(0x08)
	struct USolarCheckBox* CBoxChatSwitch; // 0x280(0x08)
	struct UWidgetAnimation* AnimChatCooldown; // 0x288(0x08)
	struct UQuickChatUnit* ChatButtonClass; // 0x290(0x08)
	struct FSlateBrush SeparatorBrush; // 0x298(0x98)
	char pad_330[0x8]; // 0x330(0x08)

	void SetLogDisplay(bool bDisplay); // Function Solarland.BattleChat.SetLogDisplay // (Final|Native|Protected) // @ game+0x1c3d140
	void ReceiveQuickMessage(struct FString InName, struct FString InMessage1, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleChat.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x1c3ccb0
	void ReceiveQuickChatSending(); // Function Solarland.BattleChat.ReceiveQuickChatSending // (Final|Native|Protected) // @ game+0x1c3cc90
	void OnGroupOperationStateChanged(struct TArray<struct UCheckBox*>& ChildChangedArray, int32_t CheckedChildIndex); // Function Solarland.BattleChat.OnGroupOperationStateChanged // (Final|Native|Protected|HasOutParms) // @ game+0x1c3c790
};

// Class Solarland.SolarHUD
// Size: 0x318 (Inherited: 0x318)
struct ASolarHUD : AHUD {
};

// Class Solarland.BattleHUDBase
// Size: 0x380 (Inherited: 0x318)
struct ABattleHUDBase : ASolarHUD {
	struct UHUDDispatcherBase* Dispatcher; // 0x318(0x08)
	struct UHUDDispatcherBase* WidgetEventDispatcher; // 0x320(0x08)
	bool bUseBattleDeathView; // 0x328(0x01)
	char pad_329[0x57]; // 0x329(0x57)

	void ShowDiePage_Deprecated(); // Function Solarland.BattleHUDBase.ShowDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x1c3d1d0
	struct UUISubsystem* GetUISubSystem(); // Function Solarland.BattleHUDBase.GetUISubSystem // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c3c630
	void CloseDiePage_Deprecated(struct UUserWidget* InDiePageClass); // Function Solarland.BattleHUDBase.CloseDiePage_Deprecated // (Final|Native|Public|BlueprintCallable) // @ game+0x1c3c340
};

// Class Solarland.BattleHUDForTechDesign
// Size: 0x380 (Inherited: 0x380)
struct ABattleHUDForTechDesign : ABattleHUDBase {
};

// Class Solarland.UINoticeBase
// Size: 0x368 (Inherited: 0x340)
struct UUINoticeBase : USolarUserWidget {
	struct USolarRichTextBlock* TextWidget; // 0x340(0x08)
	struct UImage* TxtBg; // 0x348(0x08)
	struct UImage* Icon; // 0x350(0x08)
	struct UImage* IconBg; // 0x358(0x08)
	char pad_360[0x8]; // 0x360(0x08)

	void ShowEnterAnimation(); // Function Solarland.UINoticeBase.ShowEnterAnimation // (Native|Public|BlueprintCallable) // @ game+0xb56310
	void SetIconBrush(struct FString IconPath); // Function Solarland.UINoticeBase.SetIconBrush // (Final|Native|Public|BlueprintCallable) // @ game+0x1f1a410
	void SetColor(struct FNoticeColorData& InColorData); // Function Solarland.UINoticeBase.SetColor // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1f1a2c0
	void ResetIsPlayingVoice(enum class EAkCallbackType CallbackType, struct UAkCallbackInfo* CallbackInfo); // Function Solarland.UINoticeBase.ResetIsPlayingVoice // (Final|Native|Public) // @ game+0x1f1a130
	struct UWidgetAnimation* GetExitAnimation(); // Function Solarland.UINoticeBase.GetExitAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1f19b70
	struct UWidgetAnimation* GetEnterAnimation(); // Function Solarland.UINoticeBase.GetEnterAnimation // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1f19b40
	void DefaultClose(); // Function Solarland.UINoticeBase.DefaultClose // (Final|Native|Public|BlueprintCallable) // @ game+0x1f19b20
	void CloseNotice(); // Function Solarland.UINoticeBase.CloseNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1f19a80
};

// Class Solarland.BattleNoticeEquipReplace
// Size: 0x450 (Inherited: 0x368)
struct UBattleNoticeEquipReplace : UUINoticeBase {
	struct UImage* Img_Item1; // 0x368(0x08)
	struct UImage* Img_Item2; // 0x370(0x08)
	struct UImage* Img_Item1_BG; // 0x378(0x08)
	struct UImage* Img_Item2_BG; // 0x380(0x08)
	struct UTextBlock* Quality1; // 0x388(0x08)
	struct UTextBlock* Quality2; // 0x390(0x08)
	struct UWidgetAnimation* Enter_Animation_1; // 0x398(0x08)
	struct UWidgetAnimation* Enter_Animation_2; // 0x3a0(0x08)
	struct UWidgetAnimation* Enter_Animation_3; // 0x3a8(0x08)
	struct TMap<enum class EItemType, struct TSoftObjectPtr<UTexture2D>> DefaultEquipIcons; // 0x3b0(0x50)
	struct TMap<enum class EWeaponPartType, struct TSoftObjectPtr<UTexture2D>> DefaultWeaponPartIcons; // 0x400(0x50)

	void OnEquipReplaceAnimFinished(); // Function Solarland.BattleNoticeEquipReplace.OnEquipReplaceAnimFinished // (Final|Native|Public) // @ game+0x1c3c770
};

// Class Solarland.BattleNoticePickup
// Size: 0x398 (Inherited: 0x368)
struct UBattleNoticePickup : UUINoticeBase {
	struct USolarTextBlock* Txt_PickupNotice_ItemName; // 0x368(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Head; // 0x370(0x08)
	struct USolarTextBlock* Txt_PickupNotice_Tail; // 0x378(0x08)
	struct UImage* Img_Txt_bg; // 0x380(0x08)
	struct TArray<struct FLinearColor> QualityColor; // 0x388(0x10)
};

// Class Solarland.BattleOBHUD
// Size: 0x390 (Inherited: 0x380)
struct ABattleOBHUD : ABattleHUDBase {
	char pad_380[0x8]; // 0x380(0x08)
	struct USolarOBUIModule* SolarOBUIModule; // 0x388(0x08)

	void SetBattleOBHUDType(enum class EBattleOBHUDType& Type); // Function Solarland.BattleOBHUD.SetBattleOBHUDType // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c3d0b0
	void OpenShortCutKeyboard(); // Function Solarland.BattleOBHUD.OpenShortCutKeyboard // (Final|Native|Public|BlueprintCallable) // @ game+0x1c3cc70
	void OnUISettingHeadInfoChanged(bool bShow); // Function Solarland.BattleOBHUD.OnUISettingHeadInfoChanged // (Final|Native|Private) // @ game+0x1c3cbe0
	bool IsDirectorModeEnabled(); // Function Solarland.BattleOBHUD.IsDirectorModeEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c3c680
	struct UOBHUDDispatcher* GetOBHUDDispatcher(); // Function Solarland.BattleOBHUD.GetOBHUDDispatcher // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c3c600
	enum class EBattleOBHUDType GetBattleOBHUDType(); // Function Solarland.BattleOBHUD.GetBattleOBHUDType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c3c3c0
	void AddWidgetToOBRoot(struct UPanelSlot*& ResultSlot, struct UWidget* InChildWidget, struct FName& PanelName, bool bReplaceOld); // Function Solarland.BattleOBHUD.AddWidgetToOBRoot // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c3bf30
};

// Class Solarland.BattlePassConfigInfo
// Size: 0x38 (Inherited: 0x28)
struct UBattlePassConfigInfo : UObject {
	struct TArray<struct FBattlePassLevelInfo> BattlePassLevel; // 0x28(0x10)

	bool IsMaxLevelWithExp(int32_t BattlePassID, int32_t TotalExp); // Function Solarland.BattlePassConfigInfo.IsMaxLevelWithExp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c3c6b0
	void Initialize(); // Function Solarland.BattlePassConfigInfo.Initialize // (Final|Native|Public) // @ game+0x1c3c660
	int32_t GetLevelByTestExp(int32_t BattlePassID, int32_t InTestExp); // Function Solarland.BattlePassConfigInfo.GetLevelByTestExp // (Final|Native|Public) // @ game+0x1c3c540
	int32_t GetExpNeedForLv(int32_t BattlePassID, int32_t Level); // Function Solarland.BattlePassConfigInfo.GetExpNeedForLv // (Final|Native|Public) // @ game+0x1c3c480
	int32_t GetBattllePassMaxLevel(int32_t BattlePassID); // Function Solarland.BattlePassConfigInfo.GetBattllePassMaxLevel // (Final|Native|Public) // @ game+0x1c3c3f0
};

// Class Solarland.BattlePromptWidget
// Size: 0x4d8 (Inherited: 0x340)
struct UBattlePromptWidget : USolarUserWidget {
	char pad_340[0x8]; // 0x340(0x08)
	struct UCanvasPanel* EnterAnimPanel; // 0x348(0x08)
	struct UMeshRectangleWidget* MeshWidget_Arrow; // 0x350(0x08)
	struct UMeshRectangleWidget* MeshWidget_Detail; // 0x358(0x08)
	float CloseCheckAngle; // 0x360(0x04)
	char pad_364[0x4]; // 0x364(0x04)
	struct TMap<enum class EBattlePromptType, float> ElemRadiusMap; // 0x368(0x50)
	struct TMap<enum class EOffsetLevelType, struct FDisOffsetInfo> XYLevelMap; // 0x3b8(0x50)
	struct TMap<enum class EOffsetLevelType, struct FDisOffsetInfo> HeavyFireXYLevelMap; // 0x408(0x50)
	struct TSet<struct AActor*> EffectedNightmareActors; // 0x458(0x50)
	char pad_4A8[0x20]; // 0x4a8(0x20)
	struct TArray<struct FPromptElemInfo> Datas; // 0x4c8(0x10)

	void PlayForbidAnim(bool bQuickEnter); // Function Solarland.BattlePromptWidget.PlayForbidAnim // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnSpecTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarPlayerState* NewTarget); // Function Solarland.BattlePromptWidget.OnSpecTargetChanged // (Final|Native|Public) // @ game+0x1c3cb20
	void OnNightComesActorChanged(struct AActor* InActor); // Function Solarland.BattlePromptWidget.OnNightComesActorChanged // (Final|Native|Public) // @ game+0x1c3c880
};

// Class Solarland.BattleSubSundry
// Size: 0x390 (Inherited: 0x340)
struct UBattleSubSundry : USolarUserWidget {
	struct UScrollBox* PanelInformation; // 0x340(0x08)
	struct USolarRichTextBlock* TxtInformation03; // 0x348(0x08)
	struct USolarRichTextBlock* TxtInformation02; // 0x350(0x08)
	struct USolarRichTextBlock* TxtInformation01; // 0x358(0x08)
	struct UWidgetAnimation* AnimInformationDisappear; // 0x360(0x08)
	int32_t MaxMessageStock; // 0x368(0x04)
	float ChatCoolDown; // 0x36c(0x04)
	float InfoKeepDuration; // 0x370(0x04)
	char pad_374[0x1c]; // 0x374(0x1c)

	void ReceiveQuickMessage(struct FString InName, struct FString InMessage, bool bLocalPlayer, bool bSound, int32_t PosInTeam, struct FString InMessage2); // Function Solarland.BattleSubSundry.ReceiveQuickMessage // (Final|Native|Protected) // @ game+0x1c3ceb0
	void OnPlayerStateRep(enum class EPlayerStateRepType RepType, struct APlayerState* PlayerState); // Function Solarland.BattleSubSundry.OnPlayerStateRep // (Final|Native|Protected) // @ game+0x1c3c900
};

// Class Solarland.BattleUpgradeEffectCategoryData
// Size: 0x80 (Inherited: 0x30)
struct UBattleUpgradeEffectCategoryData : UDataAsset {
	struct TMap<enum class EBattleUpgradeEffectCategory, struct FBattleUpgradeEffectCategoryConfig> CategoryConfigMap; // 0x30(0x50)

	void BreakBattleUpgradeEffectCategoryColorSet(struct FBattleUpgradeEffectCategoryColorSet& ColorSet, struct FLinearColor& BannerCategoryTextColor, struct FLinearColor& BannerIconColor, struct FLinearColor& BannerBorderColor, struct FLinearColor& BannerBackgroundColor, struct FLinearColor& BadgeIconColor, struct FLinearColor& BadgeBackgroundColor); // Function Solarland.BattleUpgradeEffectCategoryData.BreakBattleUpgradeEffectCategoryColorSet // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1c3c0a0
};

// Class Solarland.BattleUpgradeEffectSettings
// Size: 0x90 (Inherited: 0x38)
struct UBattleUpgradeEffectSettings : UDeveloperSettings {
	struct TSoftObjectPtr<UDataTable> EffectTypeConfig; // 0x38(0x28)
	int32_t SelectEffectHintLocalTextID; // 0x60(0x04)
	char pad_64[0x4]; // 0x64(0x04)
	struct TSoftObjectPtr<UBattleUpgradeEffectCategoryData> EffectCategoryData; // 0x68(0x28)
};

// Class Solarland.BigWaterGun
// Size: 0x388 (Inherited: 0x228)
struct ABigWaterGun : AActor {
	float CylinderRadius; // 0x228(0x04)
	float CylinderLength; // 0x22c(0x04)
	float TraceIntaval; // 0x230(0x04)
	float DamageChaPerInteval; // 0x234(0x04)
	float DamageVehPerInteval; // 0x238(0x04)
	float DamageDecayFirst; // 0x23c(0x04)
	float DamageDecaySecond; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)
	struct FSoftObjectPath MeshPath; // 0x248(0x18)
	struct FName MeshSocket; // 0x260(0x08)
	struct FRotator WaterColumeEffectRotator; // 0x268(0x0c)
	char pad_274[0x4]; // 0x274(0x04)
	struct UParticleSystem* WaterColumnEffect; // 0x278(0x08)
	struct FName InstigatorEffectID; // 0x280(0x08)
	struct UCameraShake* CameraShakeClass; // 0x288(0x08)
	struct UUserWidget* InCrossHairClass; // 0x290(0x08)
	float NearlyEndTime; // 0x298(0x04)
	bool bShowDebug; // 0x29c(0x01)
	char pad_29D[0x3]; // 0x29d(0x03)
	float MuzzleTraceOffset; // 0x2a0(0x04)
	struct FName ShotAnimNotifyName; // 0x2a4(0x08)
	struct FName UnequipAnimNotifyName; // 0x2ac(0x08)
	struct FName UnequipAnimNotifyName_Gatling; // 0x2b4(0x08)
	char pad_2BC[0x4]; // 0x2bc(0x04)
	struct USkeletalMeshComponent* Mesh; // 0x2c0(0x08)
	bool bInFire; // 0x2c8(0x01)
	char pad_2C9[0x7]; // 0x2c9(0x07)
	struct UParticleSystemComponent* ClientWaterColumnEffectHandle; // 0x2d0(0x08)
	int32_t InstigatorEffectHandle; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
	struct UCameraShake* CameraShakeInstance; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)
	struct UCrossHairWidget* CrossHairWidget; // 0x2f0(0x08)
	struct FGameplayEffectSpecHandle SlowDownEffectHandle; // 0x2f8(0x10)
	char pad_308[0x70]; // 0x308(0x70)
	struct FName LeftHandIKGripSocketName; // 0x378(0x08)
	struct FGameplayTag BigWaterGunOrnamentTag; // 0x380(0x08)

	void ServerHit(struct FHitResult Impact, int32_t DamageDacayCount); // Function Solarland.BigWaterGun.ServerHit // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x1c40a60
	void PlayNearlyEndSound(); // Function Solarland.BigWaterGun.PlayNearlyEndSound // (Final|Native|Private) // @ game+0x1c40a40
	void OnRep_InFire(); // Function Solarland.BigWaterGun.OnRep_InFire // (Final|Native|Private) // @ game+0x1c40a20
	void OnMontageNotifyCallBack(struct FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointNotifyPayload); // Function Solarland.BigWaterGun.OnMontageNotifyCallBack // (Final|Native|Private|HasOutParms) // @ game+0x1c40940
};

// Class Solarland.BotAIDataAsset
// Size: 0x40 (Inherited: 0x30)
struct UBotAIDataAsset : UDataAsset {
	struct TArray<struct FBotAIBehavirTreeInMapData> BotAIConfigDataMap; // 0x30(0x10)
};

// Class Solarland.SpawnerInGuide
// Size: 0x278 (Inherited: 0x228)
struct ASpawnerInGuide : AActor {
	int32_t BotAISpawnerId; // 0x228(0x04)
	int32_t BotAICharacterId; // 0x22c(0x04)
	int32_t TeamID; // 0x230(0x04)
	char pad_234[0x4]; // 0x234(0x04)
	struct FString AIName; // 0x238(0x10)
	bool bSpawnDeathBox; // 0x248(0x01)
	bool bSpawnBeginPlay; // 0x249(0x01)
	char pad_24A[0x2]; // 0x24a(0x02)
	float DelaySec; // 0x24c(0x04)
	struct FVector SpawnLocationOffset; // 0x250(0x0c)
	char pad_25C[0x4]; // 0x25c(0x04)
	struct ASolarBotAIController* BotAIControllerClass; // 0x260(0x08)
	char pad_268[0x10]; // 0x268(0x10)

	struct ASolarBotAIController* SpawnBotAI(); // Function Solarland.SpawnerInGuide.SpawnBotAI // (Final|Native|Public|BlueprintCallable) // @ game+0x1f049d0
	void SetBotAIConfig(struct ASolarBotAIController* Ctrl); // Function Solarland.SpawnerInGuide.SetBotAIConfig // (Native|Public) // @ game+0x127a870
	struct ASolarBotAIController* GetSpawnedAIController(); // Function Solarland.SpawnerInGuide.GetSpawnedAIController // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1f04560
};

// Class Solarland.BotAISpawnerInGuide
// Size: 0x2b8 (Inherited: 0x278)
struct ABotAISpawnerInGuide : ASpawnerInGuide {
	struct UBehaviorTree* BehaviorTree; // 0x278(0x08)
	struct TArray<struct FDeathBoxItemData> DeathBoxItems; // 0x280(0x10)
	int32_t BotDefaultWeaponId; // 0x290(0x04)
	uint32_t BotShootDisperse; // 0x294(0x04)
	float HitRate; // 0x298(0x04)
	float ActiveDamageRate; // 0x29c(0x04)
	float NoDamageLeftHP; // 0x2a0(0x04)
	float BotAttackRange; // 0x2a4(0x04)
	struct FVector MoveTarget; // 0x2a8(0x0c)
	char pad_2B4[0x4]; // 0x2b4(0x04)
};

// Class Solarland.BTDecorator_BlackboardDelay
// Size: 0xc8 (Inherited: 0xc0)
struct UBTDecorator_BlackboardDelay : UBTDecorator_Blackboard {
	float DelaySeconds; // 0xc0(0x04)
	bool bOnlyDelayLowerPri; // 0xc4(0x01)
	char pad_C5[0x3]; // 0xc5(0x03)
};

// Class Solarland.BTDecorator_TickFlow
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_TickFlow : UBTDecorator_BlackboardBase {
	float TickInterval; // 0x90(0x04)
	char pad_94[0x4]; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotAttributeCompare
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_BotAttributeCompare : UBTDecorator_TickFlow {
	enum class EBotAttrType AttrType; // 0x98(0x01)
	enum class EBotAttrValueType ValueType; // 0x99(0x01)
	enum class EBotAttrOperator Operator; // 0x9a(0x01)
	char pad_9B[0x1]; // 0x9b(0x01)
	float CompareValue; // 0x9c(0x04)
	bool bCheckVehicle; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	float EqualThreshold; // 0xa4(0x04)
};

// Class Solarland.BTDecorator_BotCheck
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheck : UBTDecorator_TickFlow {
	enum class EBotCheckCondition Condition; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckAIServer
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckAIServer : UBTDecorator_TickFlow {
	enum class EBotCheckAIServer Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckGameplayTags
// Size: 0xb8 (Inherited: 0x98)
struct UBTDecorator_BotCheckGameplayTags : UBTDecorator_TickFlow {
	struct FGameplayTagContainer AbilityTags; // 0x98(0x20)
};

// Class Solarland.BTDecorator_BotCheckInEffectArea
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckInEffectArea : UBTDecorator_TickFlow {
	enum class EPerceivableEffectAreaType CheckInAreaType; // 0x98(0x01)
	bool bCheckAreaTendency; // 0x99(0x01)
	enum class EPerceivableEffectAreaTendency AreaTendency; // 0x9a(0x01)
	char pad_9B[0x5]; // 0x9b(0x05)
};

// Class Solarland.BTDecorator_BotCheckNgaiMLAction
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckNgaiMLAction : UBTDecorator_TickFlow {
	enum class EBotCheckNgaiMLAction Action; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckRoleAbility
// Size: 0x70 (Inherited: 0x68)
struct UBTDecorator_BotCheckRoleAbility : UBTDecorator {
	struct FGameplayTag AbilityTag; // 0x68(0x08)
};

// Class Solarland.BTDecorator_BotCheckShieldUpgradeItem
// Size: 0x68 (Inherited: 0x68)
struct UBTDecorator_BotCheckShieldUpgradeItem : UBTDecorator {
};

// Class Solarland.BTDecorator_BotCheckState
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckState : UBTDecorator_TickFlow {
	enum class EBotCheckState CheckState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckTeamMemberState
// Size: 0xa0 (Inherited: 0x98)
struct UBTDecorator_BotCheckTeamMemberState : UBTDecorator_TickFlow {
	enum class ESolarBotMemberState CheckState; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Solarland.BTDecorator_BotCheckWeaponType
// Size: 0x98 (Inherited: 0x90)
struct UBTDecorator_BotCheckWeaponType : UBTDecorator_BlackboardBase {
	enum class EWeaponType WeaponType; // 0x90(0x01)
	bool bCheckById; // 0x91(0x01)
	char pad_92[0x2]; // 0x92(0x02)
	int32_t weaponid; // 0x94(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyDetectArea
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyDetectArea : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	float TimeThresholdMin; // 0x9c(0x04)
	float TimeThresholdMinDeviation; // 0xa0(0x04)
	bool bSpecifyAreaType; // 0xa4(0x01)
	enum class EPerceivableEffectAreaType SpecifiedAreaType; // 0xa5(0x01)
	bool bSpecifyAreaTendency; // 0xa6(0x01)
	enum class EPerceivableEffectAreaTendency SpecifiedAreaTendency; // 0xa7(0x01)
	float MinInfluenceValue; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_BotWasRecentlyHit
// Size: 0xb0 (Inherited: 0x98)
struct UBTDecorator_BotWasRecentlyHit : UBTDecorator_TickFlow {
	float TimeThresholdMax; // 0x98(0x04)
	bool bIncludeHearingHit; // 0x9c(0x01)
	bool bTriggerDelay; // 0x9d(0x01)
	char pad_9E[0x2]; // 0x9e(0x02)
	float TriggerDelaySeconds; // 0xa0(0x04)
	float TriggerDelaySecondsDeviation; // 0xa4(0x04)
	float TriggerExpiredSeconds; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Solarland.BTDecorator_DistanceCompare
// Size: 0x128 (Inherited: 0x98)
struct UBTDecorator_DistanceCompare : UBTDecorator_TickFlow {
	enum class EDistanceComparison Operator; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FBlackboardKeySelector BlackboardKeyFrom; // 0xa0(0x28)
	struct FBlackboardKeySelector BlackboardKeyTo; // 0xc8(0x28)
	float DistanceToCompare; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct FBlackboardKeySelector BBK_DistanceToCompare; // 0xf8(0x28)
	bool bDistance2D; // 0x120(0x01)
	char pad_121[0x3]; // 0x121(0x03)
	float EqualThreshold; // 0x124(0x04)
};

// Class Solarland.BTDecorator_TimeLimitRand
// Size: 0x78 (Inherited: 0x70)
struct UBTDecorator_TimeLimitRand : UBTDecorator_TimeLimit {
	float RandDeviation; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Solarland.BTDecorator_VehicleCheck
// Size: 0xa8 (Inherited: 0x98)
struct UBTDecorator_VehicleCheck : UBTDecorator_TickFlow {
	struct TArray<int32_t> VehicleIds; // 0x98(0x10)
};

// Class Solarland.BuffEffectActorGroupVO
// Size: 0xd8 (Inherited: 0x28)
struct UBuffEffectActorGroupVO : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TMap<struct FName, struct FBuffEffectActorElemList> InstantActorListMap; // 0x30(0x50)
	char pad_80[0x8]; // 0x80(0x08)
	struct TMap<struct FName, struct UBuffEffectActorElem*> DurationActorMap; // 0x88(0x50)
};

// Class Solarland.BuffEffectVO
// Size: 0x40 (Inherited: 0x28)
struct UBuffEffectVO : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Solarland.BuffEffectActorVO
// Size: 0x58 (Inherited: 0x40)
struct UBuffEffectActorVO : UBuffEffectVO {
	char pad_40[0x18]; // 0x40(0x18)
};

// Class Solarland.BuffEffectActorElem
// Size: 0x40 (Inherited: 0x28)
struct UBuffEffectActorElem : UObject {
	char pad_28[0x18]; // 0x28(0x18)
};

// Class Solarland.BuffEffectLibrary
// Size: 0x28 (Inherited: 0x28)
struct UBuffEffectLibrary : UBlueprintFunctionLibrary {

	void StopScreenEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c40e30
	void StopActorEffect(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.StopActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c40d80
	int32_t StartScreenEffect(struct UObject* WorldContextObject, struct FString RowName); // Function Solarland.BuffEffectLibrary.StartScreenEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c40ca0
	int32_t StartActorEffect(struct UObject* WorldContextObject, struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectLibrary.StartActorEffect // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c40b80
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(struct UObject* WorldContextObject, int32_t InHandle); // Function Solarland.BuffEffectLibrary.GetActorEffectPSComponents // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c40840
};

// Class Solarland.BuffEffectScreenPanel
// Size: 0x450 (Inherited: 0x340)
struct UBuffEffectScreenPanel : USolarUserWidget {
	char pad_340[0x10]; // 0x340(0x10)
	struct UCanvasPanel* LayerDurationGroup; // 0x350(0x08)
	struct UCanvasPanel* LayerDurationTwoSidePart; // 0x358(0x08)
	struct UCanvasPanel* LayerDurationBottomHalfPart; // 0x360(0x08)
	struct UCanvasPanel* LayerDurationBorderPart; // 0x368(0x08)
	struct UCanvasPanel* LayerDurationTopHalfPart; // 0x370(0x08)
	struct UCanvasPanel* LayerDurationFullPart; // 0x378(0x08)
	struct UCanvasPanel* LayerInstantGroup; // 0x380(0x08)
	struct UCanvasPanel* LayerInstantTwoSidePart; // 0x388(0x08)
	struct UCanvasPanel* LayerInstantBottomHalfPart; // 0x390(0x08)
	struct UCanvasPanel* LayerInstantBorderPart; // 0x398(0x08)
	struct UCanvasPanel* LayerInstantTopHalfPart; // 0x3a0(0x08)
	struct UCanvasPanel* LayerInstantFullPart; // 0x3a8(0x08)
	char pad_3B0[0xa0]; // 0x3b0(0xa0)
};

// Class Solarland.BuffEffectScreenVO
// Size: 0x70 (Inherited: 0x40)
struct UBuffEffectScreenVO : UBuffEffectVO {
	char pad_40[0x30]; // 0x40(0x30)
};

// Class Solarland.BuffEffectSubsystem
// Size: 0x220 (Inherited: 0x30)
struct UBuffEffectSubsystem : UWorldSubsystem {
	char pad_30[0x8]; // 0x30(0x08)
	struct TMap<enum class EBuffEffectTagType, struct FBuffEffectScreenListVO> InstantBuffEffectScreenListMap; // 0x38(0x50)
	char pad_88[0x8]; // 0x88(0x08)
	struct TMap<enum class EBuffEffectTagType, struct UBuffEffectScreenVO*> DurationBuffEffectScreenMap; // 0x90(0x50)
	struct TMap<int32_t, struct UBuffEffectScreenVO*> BuffEffectScreenHandleMap; // 0xe0(0x50)
	struct TMap<uint32_t, struct UBuffEffectActorGroupVO*> BuffEffectActorGroupMap; // 0x130(0x50)
	struct TMap<uint32_t, struct UBuffEffectActorElem*> BuffEffectActorElemMap; // 0x180(0x50)
	struct TMap<int32_t, struct UBuffEffectActorVO*> BuffEffectActorHandleMap; // 0x1d0(0x50)

	void StopScreenEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1c459a0
	void StopActorEffect(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.StopActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1c45920
	int32_t StartScreenEffectSafe(struct FName& RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c45880
	int32_t StartScreenEffect(struct FString RowName); // Function Solarland.BuffEffectSubsystem.StartScreenEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1c457d0
	int32_t StartActorEffectSafe(struct FName& RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffectSafe // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c456f0
	int32_t StartActorEffect(struct FString RowName, struct USceneComponent* AttachToComponent); // Function Solarland.BuffEffectSubsystem.StartActorEffect // (Final|Native|Public|BlueprintCallable) // @ game+0x1c45600
	void OnPSCompFinish(struct UParticleSystemComponent* PSComponent); // Function Solarland.BuffEffectSubsystem.OnPSCompFinish // (Final|Native|Private) // @ game+0x1c45310
	struct TArray<struct UParticleSystemComponent*> GetActorEffectPSComponents(int32_t InHandle); // Function Solarland.BuffEffectSubsystem.GetActorEffectPSComponents // (Final|Native|Public|BlueprintCallable) // @ game+0x1c44f00
};

// Class Solarland.BulletAttackAbility
// Size: 0x400 (Inherited: 0x400)
struct UBulletAttackAbility : UGameplayAbility {
};

// Class Solarland.CameraModifier_CameraShakeWithCurve
// Size: 0xb8 (Inherited: 0x48)
struct UCameraModifier_CameraShakeWithCurve : UCameraModifier {
	struct TMap<struct UCameraShakeWithCurve*, struct FCameraShakeWithCurvePool> ShakePoolByClass; // 0x48(0x50)
	struct TArray<struct FCameraShakeWithCurveTemplatePool> ShakePoolByTemplate; // 0x98(0x10)
	struct TArray<struct FActiveCameraShakeWithCurve> ActiveShakes; // 0xa8(0x10)
};

// Class Solarland.CameraShakeWithCurve
// Size: 0xe0 (Inherited: 0x28)
struct UCameraShakeWithCurve : UObject {
	bool bSingleInstance; // 0x28(0x01)
	bool bDisableObjectPool; // 0x29(0x01)
	char pad_2A[0x6]; // 0x2a(0x06)
	struct UCameraModifier_CameraShakeWithCurve* Modifier; // 0x30(0x08)
	float ShakeTime; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FRuntimeFloatCurve ShakeCurve; // 0x40(0x88)
	struct TArray<struct UCameraShakeWithCurve_Element*> ShakeElements; // 0xc8(0x10)
	char pad_D8[0x8]; // 0xd8(0x08)
};

// Class Solarland.CameraShakeWithCurve_Element
// Size: 0x28 (Inherited: 0x28)
struct UCameraShakeWithCurve_Element : UObject {
};

// Class Solarland.CameraShakeWithCurve_Location
// Size: 0x60 (Inherited: 0x28)
struct UCameraShakeWithCurve_Location : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat XRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat ZRange; // 0x40(0x0c)
	bool bLocalSpace; // 0x4c(0x01)
	char pad_4D[0x13]; // 0x4d(0x13)
};

// Class Solarland.CameraShakeWithCurve_Rotation
// Size: 0x58 (Inherited: 0x28)
struct UCameraShakeWithCurve_Rotation : UCameraShakeWithCurve_Element {
	struct FSymmetricRangeFloat PitchRange; // 0x28(0x0c)
	struct FSymmetricRangeFloat YawRange; // 0x34(0x0c)
	struct FSymmetricRangeFloat RollRange; // 0x40(0x0c)
	char pad_4C[0xc]; // 0x4c(0x0c)
};

// Class Solarland.CameraShakeWithCurve_FOV
// Size: 0x38 (Inherited: 0x28)
struct UCameraShakeWithCurve_FOV : UCameraShakeWithCurve_Element {
	struct FRangeFloat FOVRange; // 0x28(0x08)
	char pad_30[0x8]; // 0x30(0x08)
};

// Class Solarland.CapsuleFormationData
// Size: 0x90 (Inherited: 0x30)
struct UCapsuleFormationData : UDataAsset {
	struct TMap<char, struct FEchelonFormation> TeamFormation; // 0x30(0x50)
	struct FCruiseFormation CruiseFormation; // 0x80(0x10)

	void OverrideTeamFormation(struct TMap<char, struct FEchelonFormation>& InNewFormation); // Function Solarland.CapsuleFormationData.OverrideTeamFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c45390
	void ClearTeamFormationData(); // Function Solarland.CapsuleFormationData.ClearTeamFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x1c44ee0
	void ClearCruiseFormationData(); // Function Solarland.CapsuleFormationData.ClearCruiseFormationData // (Final|Native|Public|BlueprintCallable) // @ game+0x1c44ea0
	void AddTeamFormationLocation(char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddTeamFormationLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1c44900
	void AddLocationToTeamFormation(struct TMap<char, struct FEchelonFormation>& InFormation, char InEchelon, struct FVector& InLocation); // Function Solarland.CapsuleFormationData.AddLocationToTeamFormation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1c44780
	void AddEchelonFormation(char InEchelon, struct FEchelonFormation& InFormation); // Function Solarland.CapsuleFormationData.AddEchelonFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c44610
	void AddCruiseFormation(struct FCruiseFormation& InFormation); // Function Solarland.CapsuleFormationData.AddCruiseFormation // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c44560
};

// Class Solarland.CardView
// Size: 0x228 (Inherited: 0x138)
struct UCardView : UWidget {
	struct UUserWidget* EntryWidgetClass; // 0x138(0x08)
	struct FUserWidgetPool EntryWidgetPool; // 0x140(0x80)
	float CenterScale; // 0x1c0(0x04)
	float CenterOffset; // 0x1c4(0x04)
	float PageSpacing; // 0x1c8(0x04)
	float AlignmentPercent; // 0x1cc(0x04)
	enum class EOrientation Orientation; // 0x1d0(0x01)
	char pad_1D1[0x7]; // 0x1d1(0x07)
	struct TArray<struct UObject*> ListItems; // 0x1d8(0x10)
	char pad_1E8[0x10]; // 0x1e8(0x10)
	struct FMulticastInlineDelegate BP_OnItemClicked; // 0x1f8(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedItemChanged; // 0x208(0x10)
	struct FMulticastInlineDelegate BP_OnSelectedIndexChanged; // 0x218(0x10)

	void SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.SetListItems // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1c44a30
	void RemoveItem(struct UObject* InItem); // Function Solarland.CardView.RemoveItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c45580
	struct TArray<struct UObject*> GetListItems(); // Function Solarland.CardView.GetListItems // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c45110
	struct TArray<struct UUserWidget*> GetDisplayedEntryWidgets(); // Function Solarland.CardView.GetDisplayedEntryWidgets // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c45080
	void ClearListItems(); // Function Solarland.CardView.ClearListItems // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c44ec0
	void BP_SetSelectedItem(struct UObject* Item); // Function Solarland.CardView.BP_SetSelectedItem // (Final|Native|Private|BlueprintCallable) // @ game+0x1c44ba0
	void BP_SetSelectedIndex(int32_t Index, bool bFromFirst); // Function Solarland.CardView.BP_SetSelectedIndex // (Final|Native|Private|BlueprintCallable) // @ game+0x1c44ae0
	void BP_SetListItems(struct TArray<struct UObject*>& InListItems); // Function Solarland.CardView.BP_SetListItems // (Final|Native|Private|HasOutParms|BlueprintCallable) // @ game+0x1c44a30
	struct UObject* BP_GetSelectedItem(); // Function Solarland.CardView.BP_GetSelectedItem // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c44a00
	int32_t BP_GetSelectedIndex(); // Function Solarland.CardView.BP_GetSelectedIndex // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c449d0
	void AddItem(struct UObject* InItem); // Function Solarland.CardView.AddItem // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c44700
};

// Class Solarland.CardViewDesignerPreviewItem
// Size: 0x28 (Inherited: 0x28)
struct UCardViewDesignerPreviewItem : UObject {
};

// Class Solarland.CGCustomeBattleRoyaleComponent
// Size: 0xd8 (Inherited: 0xd0)
struct UCGCustomeBattleRoyaleComponent : UGameModeCompBase {
	char pad_D0[0x8]; // 0xd0(0x08)

	void ChangeEnvironmentTime(struct ASolarTimeLineManager* SolarTimeLineManager, int32_t DaylightChange); // Function Solarland.CGCustomeBattleRoyaleComponent.ChangeEnvironmentTime // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.CGFormula
// Size: 0x258 (Inherited: 0x228)
struct ACGFormula : AInfo {
	struct FKnockoutParams KnockoutParams; // 0x228(0x28)
	bool bInitKnockParams; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)

	struct TArray<struct FString> MakeStringForLuaByAnyStruct(struct UObject* AnyStruct); // Function Solarland.CGFormula.MakeStringForLuaByAnyStruct // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c45200
	bool IsSettlementBagItem(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.IsSettlementBagItem // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void InitKnockoutPointParams(struct FKnockoutParams& InParams); // Function Solarland.CGFormula.InitKnockoutPointParams // (Final|Native|Public|HasOutParms) // @ game+0x1c45140
	int32_t GetZomborg(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetZomborg // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x224bbb0
	void GetWeeklyChallenge(struct FString InSolarPlayerID, struct TArray<struct FString>& OutChallengeName, struct TArray<int32_t>& OutChallengeValue); // Function Solarland.CGFormula.GetWeeklyChallenge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	int32_t GetWeaponExp(struct ASolarPlayerState* InPS, int32_t InWeaponID); // Function Solarland.CGFormula.GetWeaponExp // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void GetTeamScoreComparison(struct ASolarPlayerState* InPS, struct FString& OutTeamScore); // Function Solarland.CGFormula.GetTeamScoreComparison // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void GetStrategyGuideConditions(struct ASolarPlayerState* InPS, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetStrategyGuideConditions // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void GetShowPageIndexs(struct ASolarPlayerState* InPS, struct FSettlePageParam& InParam, struct TArray<int32_t>& OutResult); // Function Solarland.CGFormula.GetShowPageIndexs // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	struct TArray<struct FSettlementReward> GetSettlementRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetSettlementRewards // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	struct TArray<struct FString> GetPersonalResultPlayerExData(struct FString SolarPlayerId, struct FString& InPBName); // Function Solarland.CGFormula.GetPersonalResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	float GetKDA(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetKDA // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	struct TArray<struct FString> GetGroupResultPlayerExData(struct FString SolarPlayerId, struct FString& InPBName); // Function Solarland.CGFormula.GetGroupResultPlayerExData // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	struct TArray<struct FSettlementParam_ExtraRewardInfo> GetExtraRewards(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetExtraRewards // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void GetCharacterExp(struct ASolarPlayerState* InPS, int32_t& OutGetExp, struct TArray<int32_t>& OutReason); // Function Solarland.CGFormula.GetCharacterExp // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	int32_t GetAccountExp(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.GetAccountExp // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x224bbb0
	int32_t CalculateTeamRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateTeamRank // (Native|Event|Public|BlueprintEvent) // @ game+0x1c44e00
	int32_t CalculatePlayerRank(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculatePlayerRank // (Native|Event|Public|BlueprintEvent) // @ game+0x1c44d60
	float CalculateMVPScore(struct ASolarPlayerState* InPS); // Function Solarland.CGFormula.CalculateMVPScore // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	int32_t CalculateKnockoutPoints(int32_t InTeamRank, int32_t InKillNum, float InTotalDamage, float InTotalDamageTaken); // Function Solarland.CGFormula.CalculateKnockoutPoints // (Final|Native|Public) // @ game+0x1c44c20
};

// Class Solarland.SolarGameModeAIComponent
// Size: 0x120 (Inherited: 0xd0)
struct USolarGameModeAIComponent : UGameModeCompBase {
	struct ASolarBotAIController* BotAIControllerClass; // 0xd0(0x08)
	struct ASolarAIControllerBase* OfflinePlayerAIControllerClass; // 0xd8(0x08)
	struct ASolarGameMode* GameModeOwner; // 0xe0(0x08)
	bool bEnableIrisAIStrategy; // 0xe8(0x01)
	bool bEnableMLSetting; // 0xe9(0x01)
	bool bPreserveBotOnMatchStart; // 0xea(0x01)
	bool bEnableWarmClock; // 0xeb(0x01)
	char pad_EC[0x4]; // 0xec(0x04)
	struct USolarBotAITeamManager* BotTeamManagerClass; // 0xf0(0x08)
	int32_t MaxNumPreservedBots; // 0xf8(0x04)
	float MaxRatioPreservedBots; // 0xfc(0x04)
	char pad_100[0x10]; // 0x100(0x10)
	struct USolarBotAITeamManager* BotTeamManager; // 0x110(0x08)
	bool bCanBotTeamRebirth; // 0x118(0x01)
	bool bCanPlayerTeamRebirth; // 0x119(0x01)
	bool bCanBotTeamBuyRescue; // 0x11a(0x01)
	bool bCanPlayerTeamBuyRescue; // 0x11b(0x01)
	char pad_11C[0x4]; // 0x11c(0x04)

	bool PreserveBot(struct ASolarBotAIController* InBotController, struct FVector& InPreservedLocation); // Function Solarland.SolarGameModeAIComponent.PreserveBot // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d5b930
	bool PopPreservedBot(struct ASolarBotAIController*& OutController, struct FVector& OutTeleportLocation, struct ASolarBotAIController* InSpecificController); // Function Solarland.SolarGameModeAIComponent.PopPreservedBot // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1d5b800
	void OnPlayerRequestWarmBot(struct ASolarPlayerController* Player); // Function Solarland.SolarGameModeAIComponent.OnPlayerRequestWarmBot // (Native|Event|Public|BlueprintEvent) // @ game+0x1d5b4f0
	void OnAcquiredIrisAIFeedStrategy(struct TArray<struct FFeedBotStrategyInfo>& StrategyInfos); // Function Solarland.SolarGameModeAIComponent.OnAcquiredIrisAIFeedStrategy // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void GetDeathBoxExtraStuff(struct ASolarPlayerState* BotState, struct ASolarPlayerState* PlayerState, struct TMap<int32_t, int32_t>& Stuff); // Function Solarland.SolarGameModeAIComponent.GetDeathBoxExtraStuff // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1d5a830
};

// Class Solarland.CGMAIComponent
// Size: 0x120 (Inherited: 0x120)
struct UCGMAIComponent : USolarGameModeAIComponent {
};

// Class Solarland.CGMCrossLevelDataMgr
// Size: 0x78 (Inherited: 0x28)
struct UCGMCrossLevelDataMgr : UObject {
	struct TMap<struct FString, struct UObject*> CrossLevelData; // 0x28(0x50)

	void RegistryCrossLevelData(struct FString InSoltName, struct UObject* InDataObj); // Function Solarland.CGMCrossLevelDataMgr.RegistryCrossLevelData // (Final|Native|Public|BlueprintCallable) // @ game+0x1c454a0
	struct UObject* GetCrossLevelData(struct FString InSoltName); // Function Solarland.CGMCrossLevelDataMgr.GetCrossLevelData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c44fd0
};

// Class Solarland.CustomGameModeComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCustomGameModeComponent : UGameModeCompBase {
};

// Class Solarland.CGMDataComponent
// Size: 0xe8 (Inherited: 0xd0)
struct UCGMDataComponent : UCustomGameModeComponent {
	struct AGameDataManager* DataManager; // 0xd0(0x08)
	struct UDataTable* DataTable; // 0xd8(0x08)
	float ConfigRepDeltaTime; // 0xe0(0x04)
	float ConfigRepMaxNum; // 0xe4(0x04)
};

// Class Solarland.CGMDeathComponent
// Size: 0xd0 (Inherited: 0xd0)
struct UCGMDeathComponent : UCustomGameModeComponent {

	void ReceivePlayerResurrect(struct ASolarCharacter* ResurrectCharacter, struct ASCMPlayerState* ResurrectPlayer); // Function Solarland.CGMDeathComponent.ReceivePlayerResurrect // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerKill(struct ASCMPlayerState* Killer, struct ASCMPlayerState* Killed, struct TArray<struct ASCMPlayerState*>& Assists, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerKill // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerDeathVerge(struct ASCMPlayerState* InAttacker, struct ASCMPlayerState* InDeathVergePlayer, struct FSolarPointDamageEvent& InDamageEvent, struct AActor* InDamageCauser); // Function Solarland.CGMDeathComponent.ReceivePlayerDeathVerge // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.GameplayConfigBase
// Size: 0x38 (Inherited: 0x30)
struct UGameplayConfigBase : UDataAsset {
	struct UGameModeGlobalSetting* GameModeSettingTemplate; // 0x30(0x08)
};

// Class Solarland.CGMGameplayConfig
// Size: 0x1e0 (Inherited: 0x38)
struct UCGMGameplayConfig : UGameplayConfigBase {
	struct ACGFormula* Formula; // 0x38(0x08)
	struct USettlementPageConfig* SettlePageConfig; // 0x40(0x08)
	struct TMap<struct FString, struct FSCMMapConfig> MapConfig; // 0x48(0x50)
	struct FDataManagerConfig DataManagerConfig; // 0x98(0x10)
	struct FJobManagerConfig JobConfig; // 0xa8(0x08)
	bool EnableUltimateSkill; // 0xb0(0x01)
	enum class ERoleSkillOperation UltimateSkillStateOperationOnInit; // 0xb1(0x01)
	bool EnableTacticalSkill; // 0xb2(0x01)
	enum class ERoleSkillOperation TacticalSkillStateOperationOnInit; // 0xb3(0x01)
	int32_t AirDropSkillMode; // 0xb4(0x04)
	bool EnableWeaponUpgrade; // 0xb8(0x01)
	char pad_B9[0x3]; // 0xb9(0x03)
	int32_t InitInGamePlayerLevel; // 0xbc(0x04)
	bool EnablePlayerUpgrade; // 0xc0(0x01)
	char pad_C1[0x7]; // 0xc1(0x07)
	struct FInGameLevelingConfig InGameLevelingConfig; // 0xc8(0x08)
	struct TArray<enum class ESolarTablesEnum_BattleUpgradeEffectType> CharacterDamageUpgradeTypes; // 0xd0(0x10)
	struct FExpItemConfig ExpItemConfig; // 0xe0(0x10)
	bool bIfShouldSpawnDeathBox; // 0xf0(0x01)
	bool bIfSupportDeathverge; // 0xf1(0x01)
	char pad_F2[0x6]; // 0xf2(0x06)
	struct TMap<int32_t, int32_t> DeathBoxEnergyLimitConfig; // 0xf8(0x50)
	bool EnableSect; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
	struct FCustomRoomData CustomRoomData; // 0x150(0x70)
	bool bIsCustomRoomMode; // 0x1c0(0x01)
	bool bEnableTracking; // 0x1c1(0x01)
	char pad_1C2[0x2]; // 0x1c2(0x02)
	float InitTrackingDelay; // 0x1c4(0x04)
	float TrackingTimeInterval; // 0x1c8(0x04)
	float DefaultTrackMaxRevealDistance; // 0x1cc(0x04)
	float TrackReplaceDistance; // 0x1d0(0x04)
	float MinRevealDistance; // 0x1d4(0x04)
	float TrackTimeout; // 0x1d8(0x04)
	int32_t MaxTrackNum; // 0x1dc(0x04)

	bool IsEnableSect(); // Function Solarland.CGMGameplayConfig.IsEnableSect // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c49020
	bool IsCustomRoomMode(); // Function Solarland.CGMGameplayConfig.IsCustomRoomMode // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0xb8d020
	int32_t GetRequiredExpForLevel(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetRequiredExpForLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c48dc0
	int32_t GetMaxShieldMatCountToDeathbox(int32_t InLevel); // Function Solarland.CGMGameplayConfig.GetMaxShieldMatCountToDeathbox // (Final|Native|Public|Const) // @ game+0x1c48d30
	int32_t GetMaxInGameLevel(); // Function Solarland.CGMGameplayConfig.GetMaxInGameLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c48d00
	int32_t GetExpItemCountByLevel(int32_t InLevel, int32_t InLevelGap); // Function Solarland.CGMGameplayConfig.GetExpItemCountByLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c48b20
	struct FCustomRoomData GetCustomRoomData(); // Function Solarland.CGMGameplayConfig.GetCustomRoomData // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1c489a0
};

// Class Solarland.CGMLogicComponent
// Size: 0x138 (Inherited: 0xd0)
struct UCGMLogicComponent : UCustomGameModeComponent {
	float TimeOutSeconds; // 0xd0(0x04)
	char pad_D4[0x64]; // 0xd4(0x64)

	void ReceiveSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceiveSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveServerLevelLoaded(struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceiveServerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	bool ReceivePlayerTeamPreJoinRequest(struct TArray<struct ASCMPlayerState*>& PreJoinPlayers, int32_t TeamID); // Function Solarland.CGMLogicComponent.ReceivePlayerTeamPreJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1c49190
	bool ReceivePlayerReJoinRequest(struct FString PlayerId, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoinRequest // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1c49080
	void ReceivePlayerReJoin(struct ASCMPlayerState* NewPlayer); // Function Solarland.CGMLogicComponent.ReceivePlayerReJoin // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerPreLogin(struct FString PlayerId, struct ASCMPlayerState* OfflinePlayer, struct FString& ErrorMsg); // Function Solarland.CGMLogicComponent.ReceivePlayerPreLogin // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerNonSpectatorJoinData(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.ReceivePlayerNonSpectatorJoinData // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerLevelLoaded(struct ASCMPlayerController* Player, struct FString LevelName); // Function Solarland.CGMLogicComponent.ReceivePlayerLevelLoaded // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerJoinData(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinData // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerJoinBattle(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoinBattle // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerJoin(struct ASCMPlayerState* NewPlayer, bool IsAI); // Function Solarland.CGMLogicComponent.ReceivePlayerJoin // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerCancelJoin(struct FString PlayerId); // Function Solarland.CGMLogicComponent.ReceivePlayerCancelJoin // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceivePlayerBattleEnd(struct ASCMPlayerState* Player, enum class ESCMPlayerOutType OutType); // Function Solarland.CGMLogicComponent.ReceivePlayerBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveOBPlayersChanged(); // Function Solarland.CGMLogicComponent.ReceiveOBPlayersChanged // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveGameModeInit(); // Function Solarland.CGMLogicComponent.ReceiveGameModeInit // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveBattleTick(float BattleTime, float DeltaTime); // Function Solarland.CGMLogicComponent.ReceiveBattleTick // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveBattleEnd(); // Function Solarland.CGMLogicComponent.ReceiveBattleEnd // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveBattleBegin(); // Function Solarland.CGMLogicComponent.ReceiveBattleBegin // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnStartBattle(); // Function Solarland.CGMLogicComponent.OnStartBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x1c49060
	void OnPlayerSettled(struct ASCMPlayerState* Player); // Function Solarland.CGMLogicComponent.OnPlayerSettled // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnPlayerOfflineTimeOut(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerOfflineTimeOut // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnPlayerGiveUp(struct ASCMPlayerState* OfflineTimeoutPlayer); // Function Solarland.CGMLogicComponent.OnPlayerGiveUp // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnPlayerDisconnect(struct ASCMPlayerState* OfflinePlayer); // Function Solarland.CGMLogicComponent.OnPlayerDisconnect // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnMatchEnd(int32_t RPCID); // Function Solarland.CGMLogicComponent.OnMatchEnd // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnDSClose(); // Function Solarland.CGMLogicComponent.OnDSClose // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnBotAIDataReady(int32_t AICount); // Function Solarland.CGMLogicComponent.OnBotAIDataReady // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	bool IsAllowReconnectGame(struct ASCMPlayerState* InPC); // Function Solarland.CGMLogicComponent.IsAllowReconnectGame // (Native|Event|Public|BlueprintEvent) // @ game+0x1c48f80
};

// Class Solarland.SolarGameplayConfigComponent
// Size: 0xd8 (Inherited: 0xb0)
struct USolarGameplayConfigComponent : UActorComponent {
	bool EnableTestGameplayConfig; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct UGameplayConfigBase* CGMConfig; // 0xb8(0x08)
	struct UGameplayConfigBase* TestCGMConfig; // 0xc0(0x08)
	struct UGameplayConfigBase* InstGameplayConfig; // 0xc8(0x08)
	struct UGameplayConfigBase* InstTestGameplayConfig; // 0xd0(0x08)

	struct UGameplayConfigBase* GetConfigs(); // Function Solarland.SolarGameplayConfigComponent.GetConfigs // (Native|Public|BlueprintCallable) // @ game+0x1d73f30
};

// Class Solarland.CGMManagerConfigComponent
// Size: 0xd8 (Inherited: 0xd8)
struct UCGMManagerConfigComponent : USolarGameplayConfigComponent {
};

// Class Solarland.CGMMapInfo
// Size: 0x180 (Inherited: 0xd0)
struct UCGMMapInfo : UGameModeCompBase {
	struct TArray<struct FVector> AreaPosArray; // 0xd0(0x10)
	int32_t MapID; // 0xe0(0x04)
	int32_t UsedAirlineID; // 0xe4(0x04)
	struct FAirlineData UsedAirlineData; // 0xe8(0x28)
	char pad_110[0x10]; // 0x110(0x10)
	struct TMap<int32_t, struct FAirlineData> AirlineDataList; // 0x120(0x50)
	int32_t MaskWidth; // 0x170(0x04)
	float MaskScale; // 0x174(0x04)
	int32_t MapWidth; // 0x178(0x04)
	int32_t MapHeight; // 0x17c(0x04)

	void LoadAirlineData(); // Function Solarland.CGMMapInfo.LoadAirlineData // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c49040
	void InitInfo(int32_t InMapID); // Function Solarland.CGMMapInfo.InitInfo // (Final|Native|Public|BlueprintCallable) // @ game+0x1c48f00
	int32_t GetUsedAirlineData(struct FAirlineData& outData); // Function Solarland.CGMMapInfo.GetUsedAirlineData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c48e50
	int32_t GetMapIDByName(struct ASCustomGameState* InGameState, struct FString Name); // Function Solarland.CGMMapInfo.GetMapIDByName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c48be0
};

// Class Solarland.CGMSettlementComponent
// Size: 0xd8 (Inherited: 0xb0)
struct UCGMSettlementComponent : UActorComponent {
	char pad_B0[0x8]; // 0xb0(0x08)
	struct USettlementPageConfig* PageConfig; // 0xb8(0x08)
	struct TArray<int32_t> PageIndexs; // 0xc0(0x10)
	bool IsCustomRoom; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)

	bool SkipToTarget(); // Function Solarland.CGMSettlementComponent.SkipToTarget // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x224bbb0
	bool ShowNextStage(); // Function Solarland.CGMSettlementComponent.ShowNextStage // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.ChaAT_AddSynchronizedForce
// Size: 0xc0 (Inherited: 0x80)
struct UChaAT_AddSynchronizedForce : UAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	char pad_90[0x30]; // 0x90(0x30)

	struct UChaAT_AddSynchronizedForce* AddForce(struct UGameplayAbility* OwningAbility, struct FVector InStartLocation, struct FVector InForce, float Duration, struct UCurveFloat* OptionalInterpolationCurve, struct UCurveVector* OptionalVectorInterpolationCurve, float InServerStartTime); // Function Solarland.ChaAT_AddSynchronizedForce.AddForce // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1c48790
};

// Class Solarland.ChaAT_AltitudeQuery
// Size: 0x130 (Inherited: 0x80)
struct UChaAT_AltitudeQuery : UAbilityTask {
	struct FMulticastInlineDelegate OnResponsed; // 0x80(0x10)
	char pad_90[0xa0]; // 0x90(0xa0)

	struct UChaAT_AltitudeQuery* StartSphereAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, float Radius, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartSphereAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x1c49530
	struct UChaAT_AltitudeQuery* StartLineAltitudeQuery(struct UGameplayAbility* OwningAbility, float InAltitude, struct TArray<enum class EObjectTypeQuery>& ObjectTypes, bool bTraceComplex, struct TArray<struct AActor*>& ActorsToIgnore, bool bIgnoreSelf, bool bUsingAsyncQuery, bool bInTriggerOnce); // Function Solarland.ChaAT_AltitudeQuery.StartLineAltitudeQuery // (Final|Native|Static|Protected|HasOutParms|BlueprintCallable) // @ game+0x1c49290
};

// Class Solarland.ChaAT_LimitCameraOnStickingOutOfVehicle
// Size: 0x98 (Inherited: 0x80)
struct UChaAT_LimitCameraOnStickingOutOfVehicle : USolarAbilityTask {
	char pad_80[0x18]; // 0x80(0x18)

	struct UChaAT_LimitCameraOnStickingOutOfVehicle* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_LimitCameraOnStickingOutOfVehicle.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c530
};

// Class Solarland.ChaAT_ListenChaTakeDamage
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_ListenChaTakeDamage : UAbilityTask {
	struct FMulticastInlineDelegate OnTakeDamageDelegate; // 0x80(0x10)

	void OnCharacterTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaAT_ListenChaTakeDamage.OnCharacterTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x1c4d010
	struct UChaAT_ListenChaTakeDamage* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_ListenChaTakeDamage.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c5b0
};

// Class Solarland.ChaAT_ListenScopeOpeningAction
// Size: 0x98 (Inherited: 0x80)
struct UChaAT_ListenScopeOpeningAction : USolarAbilityTask {
	struct UGameplayAbility* OwnerAbility; // 0x80(0x08)
	struct ASolarCharacter* TaskCharacter; // 0x88(0x08)
	char pad_90[0x8]; // 0x90(0x08)

	struct UChaAT_ListenScopeOpeningAction* CreateTask(struct UGameplayAbility* OwningAbility, struct ASolarCharacter* InCharacter, float MaxWaitTime); // Function Solarland.ChaAT_ListenScopeOpeningAction.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c630
};

// Class Solarland.ChaAT_PlayMontageAndWaitForNotify
// Size: 0x118 (Inherited: 0x108)
struct UChaAT_PlayMontageAndWaitForNotify : UAbilityTask_PlayMontageAndWait {
	struct FMulticastInlineDelegate OnMontageNotify; // 0x108(0x10)

	void OnMontageNotifyCallBack(struct FName NotifyName, struct FBranchingPointNotifyPayload& BranchingPointPayload); // Function Solarland.ChaAT_PlayMontageAndWaitForNotify.OnMontageNotifyCallBack // (Final|Native|Private|HasOutParms) // @ game+0x1c4d390
	struct UChaAT_PlayMontageAndWaitForNotify* CreateTask(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct UAnimMontage* InMontageToPlay, float InRate, struct FName InStartSection, bool bInStopWhenAbilityEnds, float InAnimRootMotionTranslationScale); // Function Solarland.ChaAT_PlayMontageAndWaitForNotify.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c730
};

// Class Solarland.ChaAT_PlayMontageForMeshAndWaitForEvent
// Size: 0x150 (Inherited: 0x80)
struct UChaAT_PlayMontageForMeshAndWaitForEvent : UAbilityTask {
	struct FMulticastInlineDelegate OnCompleted; // 0x80(0x10)
	struct FMulticastInlineDelegate OnBlendOut; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct FMulticastInlineDelegate EventReceived; // 0xc0(0x10)
	struct USkeletalMeshComponent* Mesh; // 0xd0(0x08)
	struct UAnimMontage* MontageToPlay; // 0xd8(0x08)
	struct FGameplayTagContainer EventTags; // 0xe0(0x20)
	float Rate; // 0x100(0x04)
	struct FName StartSection; // 0x104(0x08)
	float AnimRootMotionTranslationScale; // 0x10c(0x04)
	bool bStopWhenAbilityEnds; // 0x110(0x01)
	bool bReplicateMontage; // 0x111(0x01)
	char pad_112[0x2]; // 0x112(0x02)
	float OverrideBlendOutTimeForCancelAbility; // 0x114(0x04)
	float OverrideBlendOutTimeForStopWhenEndAbility; // 0x118(0x04)
	bool bInterruptedCalledBeforeBlendingOut; // 0x11c(0x01)
	char pad_11D[0x33]; // 0x11d(0x33)

	struct UChaAT_PlayMontageForMeshAndWaitForEvent* PlayMontageForMeshAndWaitForEvent(struct UGameplayAbility* OwningAbility, struct FName TaskInstanceName, struct USkeletalMeshComponent* Mesh, struct UAnimMontage* MontageToPlay, float Rate, struct FName StartSection, bool bStopWhenAbilityEnds, float AnimRootMotionTranslationScale, bool bReplicateMontage, float OverrideBlendOutTimeForCancelAbility, float OverrideBlendOutTimeForStopWhenEndAbility); // Function Solarland.ChaAT_PlayMontageForMeshAndWaitForEvent.PlayMontageForMeshAndWaitForEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4d7b0
};

// Class Solarland.ChaAT_UpdateSkydiveTrail
// Size: 0x88 (Inherited: 0x80)
struct UChaAT_UpdateSkydiveTrail : USolarAbilityTask {
	char pad_80[0x8]; // 0x80(0x08)

	struct UChaAT_UpdateSkydiveTrail* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_UpdateSkydiveTrail.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c920
};

// Class Solarland.ChaAT_WaitCharacterDeathEnd
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_WaitCharacterDeathEnd : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterDeathEnd; // 0x80(0x10)

	struct UChaAT_WaitCharacterDeathEnd* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_WaitCharacterDeathEnd.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4c9a0
};

// Class Solarland.ChaAT_WaitCharacterLaunchEnd
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitCharacterLaunchEnd : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterLaunchEnd; // 0x80(0x10)
	char pad_90[0xc]; // 0x90(0x0c)
	float MoveModeCheckDelayTime; // 0x9c(0x04)

	struct UChaAT_WaitCharacterLaunchEnd* CreateTask(struct UGameplayAbility* OwningAbility, float InWaitLaunchingTime); // Function Solarland.ChaAT_WaitCharacterLaunchEnd.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4ca20
};

// Class Solarland.ChaAT_WaitCharacterPostDeath
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitCharacterPostDeath : USolarAbilityTask {
	struct FMulticastInlineDelegate OnDestroyCharacterCorpse; // 0x80(0x10)
	char pad_90[0x10]; // 0x90(0x10)

	struct UChaAT_WaitCharacterPostDeath* CreateTask(struct UGameplayAbility* OwningAbility, float InDestroyCorpseTime); // Function Solarland.ChaAT_WaitCharacterPostDeath.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4caf0
};

// Class Solarland.ChaAT_WaitCharacterSprintCancel
// Size: 0x90 (Inherited: 0x80)
struct UChaAT_WaitCharacterSprintCancel : USolarAbilityTask {
	struct FMulticastInlineDelegate OnCharacterSprintCancel; // 0x80(0x10)

	struct UChaAT_WaitCharacterSprintCancel* CreateTask(struct UGameplayAbility* OwningAbility); // Function Solarland.ChaAT_WaitCharacterSprintCancel.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4cbc0
};

// Class Solarland.ChaAT_WaitControlRotationYawOutOfRange
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitControlRotationYawOutOfRange : UAbilityTask {
	char pad_80[0x20]; // 0x80(0x20)

	struct UChaAT_WaitControlRotationYawOutOfRange* CreateTask(struct UGameplayAbility* OwningAbility, float YawMin, float YawMax); // Function Solarland.ChaAT_WaitControlRotationYawOutOfRange.CreateTask // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4cc40
};

// Class Solarland.ChaAT_WaitDelay
// Size: 0x98 (Inherited: 0x80)
struct UChaAT_WaitDelay : UAbilityTask {
	struct FMulticastInlineDelegate OnFinish; // 0x80(0x10)
	char pad_90[0x8]; // 0x90(0x08)

	struct UChaAT_WaitDelay* WaitDelay(struct UGameplayAbility* OwningAbility, float Time); // Function Solarland.ChaAT_WaitDelay.WaitDelay // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4db30
};

// Class Solarland.ChaAT_WaitOverlapEx
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitOverlapEx : UAbilityTask {
	struct FMulticastInlineDelegate OnOverLap; // 0x80(0x10)
	char pad_90[0x10]; // 0x90(0x10)

	struct UChaAT_WaitOverlapEx* WaitForOverlap(struct UGameplayAbility* OwningAbility, struct TArray<struct AActor*> InIgnoreClasses); // Function Solarland.ChaAT_WaitOverlapEx.WaitForOverlap // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1c4dc00
	void OnHitCallback(struct UPrimitiveComponent* HitComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, struct FVector NormalImpulse, struct FHitResult& Hit); // Function Solarland.ChaAT_WaitOverlapEx.OnHitCallback // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1c4d1c0
};

// Class Solarland.ChaAT_WaitVehicleWeakPointRepairingEnd
// Size: 0xa0 (Inherited: 0x80)
struct UChaAT_WaitVehicleWeakPointRepairingEnd : USolarAbilityTask {
	char pad_80[0x8]; // 0x80(0x08)
	struct FMulticastInlineDelegate OnVehicleWeakPointRepairingEnd; // 0x88(0x10)
	char pad_98[0x8]; // 0x98(0x08)

	struct UChaAT_WaitVehicleWeakPointRepairingEnd* CreateTask(struct UGameplayAbility* OwningAbility, struct FVehicleWeakPointSpec& RepairingVehicleWeakPoint); // Function Solarland.ChaAT_WaitVehicleWeakPointRepairingEnd.CreateTask // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1c4cd30
};

// Class Solarland.SolarGameplayAbility
// Size: 0x418 (Inherited: 0x400)
struct USolarGameplayAbility : UGameplayAbility {
	bool bTryActivateWhenGranted; // 0x400(0x01)
	enum class ESolarGAInputID InputID; // 0x401(0x01)
	bool bAllowReconnection; // 0x402(0x01)
	bool bActiveOnPress; // 0x403(0x01)
	char pad_404[0x4]; // 0x404(0x04)
	struct TArray<struct FAbilityMeshMontage> CurrentAbilityMeshMontages; // 0x408(0x10)

	void RemoveGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.RemoveGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1d75850
	void ReceivingGiven(struct FGameplayAbilityActorInfo& ActorInfo, struct FGameplayAbilitySpec& Spec); // Function Solarland.SolarGameplayAbility.ReceivingGiven // (Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x224bbb0
	bool OnLevelUp(int32_t OldLevel, struct FGameplayAbilitySpec& Spec); // Function Solarland.SolarGameplayAbility.OnLevelUp // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x1d75580
	void MontageStopForMesh(struct USkeletalMeshComponent* InMesh, float OverrideBlendOutTime); // Function Solarland.SolarGameplayAbility.MontageStopForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x1d754b0
	void MontageStopForAllMeshes(float OverrideBlendOutTime); // Function Solarland.SolarGameplayAbility.MontageStopForAllMeshes // (Final|Native|Protected|BlueprintCallable) // @ game+0x1d75430
	void MontageSetNextSectionNameForMesh(struct USkeletalMeshComponent* InMesh, struct FName FromSectionName, struct FName ToSectionName); // Function Solarland.SolarGameplayAbility.MontageSetNextSectionNameForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x1d75330
	void MontageJumpToSectionForMesh(struct USkeletalMeshComponent* InMesh, struct FName SectionName); // Function Solarland.SolarGameplayAbility.MontageJumpToSectionForMesh // (Final|Native|Protected|BlueprintCallable) // @ game+0x1d75270
	int32_t GetDefaultGrantedLevel(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.SolarGameplayAbility.GetDefaultGrantedLevel // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1d73ff0
	struct UAnimMontage* GetCurrentMontageForMesh(struct USkeletalMeshComponent* InMesh); // Function Solarland.SolarGameplayAbility.GetCurrentMontageForMesh // (Final|Native|Public|BlueprintCallable) // @ game+0x1d73f60
	void ExecuteGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.ExecuteGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1d73c60
	void AddGameplayCueLocal(struct FGameplayTag GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters); // Function Solarland.SolarGameplayAbility.AddGameplayCueLocal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1d73630
};

// Class Solarland.SolarCharacterGameplayAbility
// Size: 0x460 (Inherited: 0x418)
struct USolarCharacterGameplayAbility : USolarGameplayAbility {
	struct FGameplayTagContainer ActivationOwnedReplicatedTags; // 0x418(0x20)
	struct TArray<struct FSolarGameplayEffectConfig> ActivationOwnedReplicatedGameplayEffects; // 0x438(0x10)
	char pad_448[0x18]; // 0x448(0x18)

	struct ASolarCharacter* GetOwningCharacterFromActorInfo(); // Function Solarland.SolarCharacterGameplayAbility.GetOwningCharacterFromActorInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d2ac90
	struct ASolarCharacter* GetAvatarSolarCharacterFromActorInfo(); // Function Solarland.SolarCharacterGameplayAbility.GetAvatarSolarCharacterFromActorInfo // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1d2ac20
};

// Class Solarland.ChaGA_Aim
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Aim : USolarCharacterGameplayAbility {
	struct UGameplayEffect* AimGameplayEffectClass; // 0x460(0x08)
};

// Class Solarland.ChaGA_ThrowSkill
// Size: 0x4c0 (Inherited: 0x460)
struct UChaGA_ThrowSkill : USolarCharacterGameplayAbility {
	enum class ESkillAnimType SkillAnimType; // 0x460(0x01)
	enum class ESkillAnimRightHandType SkillAnimRightHandType; // 0x461(0x01)
	bool bShouldWaitMontageNotifyToThrow; // 0x462(0x01)
	char pad_463[0x1]; // 0x463(0x01)
	struct FName MontageNotifyToWait; // 0x464(0x08)
	bool bCanHoldWeapon; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct FName ActiveMontageNotifyToReady; // 0x470(0x08)
	bool bShouldWaitActiveMontageNotifyToPrepare; // 0x478(0x01)
	char pad_479[0x3]; // 0x479(0x03)
	struct FName ActiveMontageNotifyToPrepare; // 0x47c(0x08)
	bool bShouldWaitActiveMontageNotifyToThrow; // 0x484(0x01)
	char pad_485[0x3]; // 0x485(0x03)
	struct FName ActiveMontageNotifyToThrow; // 0x488(0x08)
	struct FName MontageSectionToJumpOnInputReleased; // 0x490(0x08)
	struct UAbilityTask_NetworkSyncPoint* WaitThrowTask; // 0x498(0x08)
	struct UAnimMontage* ActiveMontage; // 0x4a0(0x08)
	struct UAnimMontage* FireMontage; // 0x4a8(0x08)
	struct UAnimMontage* CancelMontage; // 0x4b0(0x08)
	char pad_4B8[0x8]; // 0x4b8(0x08)

	void WaitToThrow(); // Function Solarland.ChaGA_ThrowSkill.WaitToThrow // (Final|Native|Protected) // @ game+0x1c57390
	void StartToThrow(); // Function Solarland.ChaGA_ThrowSkill.StartToThrow // (Native|Event|Protected|BlueprintEvent) // @ game+0x1258330
	void PrepareToThrow(); // Function Solarland.ChaGA_ThrowSkill.PrepareToThrow // (Native|Event|Protected|BlueprintEvent) // @ game+0x12584b0
	void OnRceiveWaitToThrow(); // Function Solarland.ChaGA_ThrowSkill.OnRceiveWaitToThrow // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_ThrowSkill.OnMontageNotify // (Native|Protected) // @ game+0x1c568c0
	void OnMontageCompleted(); // Function Solarland.ChaGA_ThrowSkill.OnMontageCompleted // (Native|Protected) // @ game+0x1257b70
	void OnFireMontageStartBlendingOut(); // Function Solarland.ChaGA_ThrowSkill.OnFireMontageStartBlendingOut // (Native|Protected) // @ game+0x1257710
	void OnActiveMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_ThrowSkill.OnActiveMontageNotify // (Native|Protected) // @ game+0x1c56240
	void OnActiveMontageCompleted(); // Function Solarland.ChaGA_ThrowSkill.OnActiveMontageCompleted // (Native|Protected) // @ game+0x1257770
};

// Class Solarland.SolarSkillGA_Projectile
// Size: 0x580 (Inherited: 0x4c0)
struct USolarSkillGA_Projectile : UChaGA_ThrowSkill {
	struct FSolarSkillProjectileData ProjectileData; // 0x4c0(0x70)
	struct AGameplayAbilityTargetActor* GATargetActorClass; // 0x530(0x08)
	struct TArray<struct AActor*> SpawnActorClasses; // 0x538(0x10)
	struct UGameplayEffect* GEToSelfClass; // 0x548(0x08)
	struct UGameplayEffect* GEToTargetClass; // 0x550(0x08)
	struct UAbilityTask_WaitTargetData* WaitTargetDataTask; // 0x558(0x08)
	struct TArray<struct AActor*> SpawnActors; // 0x560(0x10)
	struct TWeakObjectPtr<struct AGameplayAbilityTargetActor> TargetActorCache; // 0x570(0x08)
	char pad_578[0x8]; // 0x578(0x08)

	void OnWaitTargetDataTaskValid(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.SolarSkillGA_Projectile.OnWaitTargetDataTaskValid // (Native|Protected|HasOutParms) // @ game+0x1e140e0
	void OnWaitTargetDataTaskCancelled(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.SolarSkillGA_Projectile.OnWaitTargetDataTaskCancelled // (Native|Protected|HasOutParms) // @ game+0x1e13fc0
};

// Class Solarland.SolarSkillGA_Summon
// Size: 0x5b0 (Inherited: 0x580)
struct USolarSkillGA_Summon : USolarSkillGA_Projectile {
	struct USolarSummonDetectionConfig* SummonConfig; // 0x580(0x08)
	int32_t SummonFailedNoticeID; // 0x588(0x04)
	bool bUseKeyUpLocationSummon; // 0x58c(0x01)
	char pad_58D[0x3]; // 0x58d(0x03)
	struct TWeakObjectPtr<struct ASolarSkillGATA_Summon> SummonTargetActor; // 0x590(0x08)
	struct UAnimMontage* ActiveMontageForGunAim; // 0x598(0x08)
	struct UAnimMontage* FireMontageForGunAim; // 0x5a0(0x08)
	struct UAnimMontage* CancelMontageForGunAim; // 0x5a8(0x08)
};

// Class Solarland.ChaGA_AirDrop
// Size: 0x630 (Inherited: 0x5b0)
struct UChaGA_AirDrop : USolarSkillGA_Summon {
	struct ASolarTreasureBoxSpawner* TreasureBoxSpawnerClass; // 0x5b0(0x08)
	int32_t OutcomeID; // 0x5b8(0x04)
	char pad_5BC[0x4]; // 0x5bc(0x04)
	struct TArray<struct FAirDropSkillDatas> AirDropSkillSetting; // 0x5c0(0x10)
	int32_t ChestID; // 0x5d0(0x04)
	int32_t BoxType; // 0x5d4(0x04)
	float CastTime; // 0x5d8(0x04)
	float ReadyTime; // 0x5dc(0x04)
	struct FGameplayTag PrepareGameplayCue; // 0x5e0(0x08)
	struct FGameplayTag OpenAirDropMontageTag; // 0x5e8(0x08)
	char pad_5F0[0x10]; // 0x5f0(0x10)
	struct FTransform SpawnTransform; // 0x600(0x30)

	void OnWaitCompleted(); // Function Solarland.ChaGA_AirDrop.OnWaitCompleted // (Final|Native|Private) // @ game+0x1c4d790
};

// Class Solarland.ResidentPassiveSkill
// Size: 0x438 (Inherited: 0x418)
struct UResidentPassiveSkill : USolarGameplayAbility {
	struct TArray<struct UGameplayEffect*> ResidentEffectClasses; // 0x418(0x10)
	char pad_428[0x10]; // 0x428(0x10)
};

// Class Solarland.ChaGA_AntiexposureSuit
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_AntiexposureSuit : UResidentPassiveSkill {
	struct FGameplayTag ExecuteCueTag; // 0x438(0x08)

	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_AntiexposureSuit.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x1c4d4f0
};

// Class Solarland.ChaGA_AttributeInit
// Size: 0x428 (Inherited: 0x418)
struct UChaGA_AttributeInit : USolarGameplayAbility {
	struct TArray<struct UGameplayEffect*> InitializationEffectClasses; // 0x418(0x10)
};

// Class Solarland.CharacterTalent
// Size: 0x420 (Inherited: 0x418)
struct UCharacterTalent : USolarGameplayAbility {
	struct UGameplayEffect* GrantedEffectClass; // 0x418(0x08)

	float GetTalentCooldownDuration(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.CharacterTalent.GetTalentCooldownDuration // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c602d0
	float GetTalentActivationDuration(struct AActor* InOwner, struct AActor* InAvatar); // Function Solarland.CharacterTalent.GetTalentActivationDuration // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c60200
};

// Class Solarland.PermanentTalent
// Size: 0x440 (Inherited: 0x420)
struct UPermanentTalent : UCharacterTalent {
	struct TArray<struct UGameplayEffect*> PermanentEffectClasses; // 0x420(0x10)
	char pad_430[0x10]; // 0x430(0x10)
};

// Class Solarland.PermanentTalentOnVehicle
// Size: 0x458 (Inherited: 0x440)
struct UPermanentTalentOnVehicle : UPermanentTalent {
	struct TArray<int32_t> ActivatedVehicleTypes; // 0x440(0x10)
	struct FGameplayTag GetOffVehicleEventTag; // 0x450(0x08)

	void ReceiveGetOffVehicle(struct FGameplayEventData InPayload); // Function Solarland.PermanentTalentOnVehicle.ReceiveGetOffVehicle // (Final|Native|Protected) // @ game+0x1ca9500
};

// Class Solarland.ChaGA_AutoHealingOnVehicle
// Size: 0x468 (Inherited: 0x458)
struct UChaGA_AutoHealingOnVehicle : UPermanentTalentOnVehicle {
	struct UGameplayEffect* FullHealthSignEffect; // 0x458(0x08)
	char pad_460[0x8]; // 0x460(0x08)

	void ReceiveCurrentHealthChange(); // Function Solarland.ChaGA_AutoHealingOnVehicle.ReceiveCurrentHealthChange // (Final|Native|Protected) // @ game+0x1c4dae0
};

// Class Solarland.ChaGA_BigRechargeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_BigRechargeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag RechargeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_BigWaterGun
// Size: 0x4a8 (Inherited: 0x460)
struct UChaGA_BigWaterGun : USolarCharacterGameplayAbility {
	struct ABigWaterGun* BigWaterGunClass; // 0x460(0x08)
	struct ABigWaterGun* CacheBigWaterGun; // 0x468(0x08)
	enum class ESkillAnimType SkillAnimType; // 0x470(0x01)
	char pad_471[0x7]; // 0x471(0x07)
	struct UAnimMontage* PreAnimMontage; // 0x478(0x08)
	struct UAnimMontage* ExcuteAnimMontage; // 0x480(0x08)
	struct UAnimMontage* PostAnimMontage; // 0x488(0x08)
	float Lifetime; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UGameplayEffect* SlowDownGameplayEffect; // 0x498(0x08)
	char pad_4A0[0x8]; // 0x4a0(0x08)

	void OnPrePhase(); // Function Solarland.ChaGA_BigWaterGun.OnPrePhase // (Final|Native|Private) // @ game+0x1c4d4b0
	void OnPreMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnPreMontageCompleted // (Final|Native|Private) // @ game+0x1c4d1a0
	void OnPostPhase(); // Function Solarland.ChaGA_BigWaterGun.OnPostPhase // (Final|Native|Private) // @ game+0x1c4d490
	void OnPostMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnPostMontageCompleted // (Final|Native|Private) // @ game+0x1c4d470
	void OnExecutePhase(); // Function Solarland.ChaGA_BigWaterGun.OnExecutePhase // (Final|Native|Private) // @ game+0x1c4d1a0
	void OnExecuteMontageCompleted(); // Function Solarland.ChaGA_BigWaterGun.OnExecuteMontageCompleted // (Final|Native|Private) // @ game+0x1c4d180
};

// Class Solarland.ChaGA_Bolt
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Bolt : USolarCharacterGameplayAbility {
	struct FGameplayTag BoltMontageTag; // 0x460(0x08)
};

// Class Solarland.ChaGA_ChangeCurrentCDRemain
// Size: 0x460 (Inherited: 0x418)
struct UChaGA_ChangeCurrentCDRemain : USolarGameplayAbility {
	struct FGameplayTagContainer AbilityQueryTags; // 0x418(0x20)
	enum class EGameplayModOp RemainTimeModifierOption; // 0x438(0x01)
	char pad_439[0x7]; // 0x439(0x07)
	struct FScalableFloat RemainTimeModifierValue; // 0x440(0x20)
};

// Class Solarland.ChaGA_ChangeTotalCD_WithDuration
// Size: 0x450 (Inherited: 0x418)
struct UChaGA_ChangeTotalCD_WithDuration : USolarGameplayAbility {
	struct FGameplayTagContainer AbilityQueryTags; // 0x418(0x20)
	struct UGameplayEffect* CDModifierEffect; // 0x438(0x08)
	bool bUsedForNextActivation; // 0x440(0x01)
	enum class EActiveEffectDurationChangeProxy ActiveEffectDurationChangeProxy; // 0x441(0x01)
	char pad_442[0xe]; // 0x442(0x0e)

	void OnModifierFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_ChangeTotalCD_WithDuration.OnModifierFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c4cf30
	void ModifierAppliedFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_ChangeTotalCD_WithDuration.ModifierAppliedFailed // (Final|Native|Protected|HasOutParms) // @ game+0x1c4cf30
};

// Class Solarland.ChaGA_ChangeTotalCD_WithTimes
// Size: 0x458 (Inherited: 0x450)
struct UChaGA_ChangeTotalCD_WithTimes : UChaGA_ChangeTotalCD_WithDuration {
	int32_t CDTimes; // 0x450(0x04)
	char pad_454[0x4]; // 0x454(0x04)

	void OnCooldownCompleted(); // Function Solarland.ChaGA_ChangeTotalCD_WithTimes.OnCooldownCompleted // (Final|Native|Protected) // @ game+0x1c4d160
};

// Class Solarland.ChaGA_CombatRegeneration
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_CombatRegeneration : USolarCharacterGameplayAbility {
	float ForecastInterval; // 0x460(0x04)
	float RegenerateInterval; // 0x464(0x04)
	struct FGameplayTag RegenerateCueTag; // 0x468(0x08)
	char pad_470[0x28]; // 0x470(0x28)

	void PreRegenerate(); // Function Solarland.ChaGA_CombatRegeneration.PreRegenerate // (Final|Native|Protected) // @ game+0x1c4dac0
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HealtDamage); // Function Solarland.ChaGA_CombatRegeneration.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x1c4d640
	void OnRegenerate(); // Function Solarland.ChaGA_CombatRegeneration.OnRegenerate // (Final|Native|Protected) // @ game+0x1c4d4d0
};

// Class Solarland.ChaGA_Crouch
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Crouch : USolarCharacterGameplayAbility {

	bool ShouldCancelCrouch(); // Function Solarland.ChaGA_Crouch.ShouldCancelCrouch // (Final|Native|Private) // @ game+0x1c4db00
};

// Class Solarland.ChaGA_Cruise
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_Cruise : USolarCharacterGameplayAbility {
	struct UGameplayEffect* ParachuteZoneEnteredEffect; // 0x460(0x08)
	struct FName ParachuteActionName; // 0x468(0x08)
	struct UAbilityTask_WaitInputAction* WaitParachuteInputTask; // 0x470(0x08)
	struct UAbilityTask_NetworkSyncPoint* WaitToParachuteTask; // 0x478(0x08)
	char pad_480[0x8]; // 0x480(0x08)

	void WaitToParachute(); // Function Solarland.ChaGA_Cruise.WaitToParachute // (Final|Native|Private) // @ game+0x1c52e20
	void OnRequestedToParachute(); // Function Solarland.ChaGA_Cruise.OnRequestedToParachute // (Final|Native|Private) // @ game+0x1c52490
	void OnIntoParachuteZone(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnIntoParachuteZone // (Final|Native|Private) // @ game+0x1c520a0
	void OnForceToParachute(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnForceToParachute // (Final|Native|Private) // @ game+0x1c51ec0
	void OnFinishCruise(struct FGameplayEventData Payload); // Function Solarland.ChaGA_Cruise.OnFinishCruise // (Final|Native|Private) // @ game+0x1c51cc0
};

// Class Solarland.ChaGA_Death
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Death : USolarCharacterGameplayAbility {
	float DestroyCorpseTime; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct UGameplayEffect* RemoveDebuffEffectClass; // 0x468(0x08)

	void DestroyCharacterCorpse(struct ASolarCharacter* Character); // Function Solarland.ChaGA_Death.DestroyCharacterCorpse // (Final|Native|Protected) // @ game+0x1c51540
	void DeathEnd(struct ASolarCharacter* Character); // Function Solarland.ChaGA_Death.DeathEnd // (Final|Native|Protected) // @ game+0x1c514c0
};

// Class Solarland.ChaGA_DeathVerge
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_DeathVerge : USolarCharacterGameplayAbility {
	struct TArray<struct UGameplayEffect*> DeathVergeHPEffects; // 0x460(0x10)
	char pad_470[0x10]; // 0x470(0x10)
	struct FGameplayTag DeathVergeMaxHPDataTag; // 0x480(0x08)
	float TimeToWait; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)

	void OnWaitDelayFinished(); // Function Solarland.ChaGA_DeathVerge.OnWaitDelayFinished // (Final|Native|Protected) // @ game+0x1c52810
};

// Class Solarland.ChaGA_Equip
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_Equip : USolarCharacterGameplayAbility {
	struct FGameplayTag EquipMontageTag; // 0x460(0x08)
};

// Class Solarland.SideResidentPassiveSkill
// Size: 0x438 (Inherited: 0x418)
struct USideResidentPassiveSkill : USolarGameplayAbility {
	struct UGameplayEffect* SignEffectClass; // 0x418(0x08)
	char pad_420[0x18]; // 0x420(0x18)

	bool OnSidePassiveSkillEnded(struct FSideAttributeSet& InSideAttributeSet, struct ASCMPlayerState* CurrentPlayer, bool bWasCancelled); // Function Solarland.SideResidentPassiveSkill.OnSidePassiveSkillEnded // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1cd69b0
	bool OnSidePassiveSkillActivated(struct FSideAttributeSet& InSideAttributeSet, struct ASCMPlayerState* CurrentPlayer); // Function Solarland.SideResidentPassiveSkill.OnSidePassiveSkillActivated // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1cd6820
	void OnSideLeaving(struct FGameplayEventData Payload); // Function Solarland.SideResidentPassiveSkill.OnSideLeaving // (Final|Native|Protected) // @ game+0x1cd6640
	void OnSideJoining(struct FGameplayEventData Payload); // Function Solarland.SideResidentPassiveSkill.OnSideJoining // (Final|Native|Protected) // @ game+0x1cd6460
	void OnCharacterBeforeChange(); // Function Solarland.SideResidentPassiveSkill.OnCharacterBeforeChange // (Final|Native|Protected) // @ game+0x1cd6440
};

// Class Solarland.ChaGA_FastTreatment
// Size: 0x448 (Inherited: 0x438)
struct UChaGA_FastTreatment : USideResidentPassiveSkill {
	float ModifierTreatmentValue; // 0x438(0x04)
	float ModifierShieldValue; // 0x43c(0x04)
	float ModifierBigShieldValue; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)
};

// Class Solarland.ChaGA_Fire
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Fire : USolarCharacterGameplayAbility {
	struct ASolarCharacter* ActCharacter; // 0x460(0x08)
	char pad_468[0x5]; // 0x468(0x05)
	bool bPrintDebugString; // 0x46d(0x01)
	char pad_46E[0x2]; // 0x46e(0x02)

	void OnFireTaskEnd(); // Function Solarland.ChaGA_Fire.OnFireTaskEnd // (Final|Native|Public) // @ game+0x1c51ea0
	void OnCtrlTaskEnd(); // Function Solarland.ChaGA_Fire.OnCtrlTaskEnd // (Final|Native|Public) // @ game+0x1c51ca0
	void DoFireTask(); // Function Solarland.ChaGA_Fire.DoFireTask // (Final|Native|Public) // @ game+0x1c515c0
};

// Class Solarland.ChaGA_GetOffVehicle
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_GetOffVehicle : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_GetOnVehicle
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_GetOnVehicle : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_HitRecover
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_HitRecover : USolarCharacterGameplayAbility {
	float Duration; // 0x460(0x04)
	float KnockbackDuration; // 0x464(0x04)
	struct TMap<enum class EHitRecoverType, float> HitbackDistance; // 0x468(0x50)

	void OnBlock(struct FGameplayAbilityTargetDataHandle& InTargetData); // Function Solarland.ChaGA_HitRecover.OnBlock // (Final|Native|Public|HasOutParms) // @ game+0x1c51a60
};

// Class Solarland.ChaGA_HitShield
// Size: 0x4c8 (Inherited: 0x438)
struct UChaGA_HitShield : UResidentPassiveSkill {
	struct ASolarEnergyShield* HitShieldClass; // 0x438(0x08)
	float DistanceToCharacter; // 0x440(0x04)
	float CoolDown; // 0x444(0x04)
	float MaxAngleinZ; // 0x448(0x04)
	char pad_44C[0x4]; // 0x44c(0x04)
	struct FGameplayTagContainer BlockShieldSpawnTags; // 0x450(0x20)
	struct TSet<enum class ESCMDamageType> TriggerDamageTypes; // 0x470(0x50)
	char pad_4C0[0x8]; // 0x4c0(0x08)

	void SpawnHitShield(struct FVector Direction); // Function Solarland.ChaGA_HitShield.SpawnHitShield // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x224bbb0
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_HitShield.OnTakeDamage // (Final|Native|Protected|HasOutParms) // @ game+0x1c52630
};

// Class Solarland.ChaGA_Hoarder
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_Hoarder : USideResidentPassiveSkill {
	float ModifierValue; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class Solarland.ChaGA_HomeVault
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_HomeVault : USolarCharacterGameplayAbility {
	struct FGameplayTag ClimbWaterMontageTag; // 0x460(0x08)
	struct FGameplayTag VaultCrossMontageTag; // 0x468(0x08)
	char pad_470[0x20]; // 0x470(0x20)

	void OnMontageCompleted(); // Function Solarland.ChaGA_HomeVault.OnMontageCompleted // (Final|Native|Protected) // @ game+0x1c516c0
};

// Class Solarland.ChaGA_InitializationFromGameMode
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_InitializationFromGameMode : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VJetCDOverrideEffect; // 0x460(0x08)
	struct UGameplayEffect* HJetCDOverrideEffect; // 0x468(0x08)
	struct FGameplayTag SettingOverrideTag; // 0x470(0x08)
};

// Class Solarland.ChaGA_JetFlyAction
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_JetFlyAction : USolarCharacterGameplayAbility {
	bool bVerticalFly; // 0x460(0x01)
	char pad_461[0x7]; // 0x461(0x07)
	struct UGameplayEffect* BoostEffect; // 0x468(0x08)
};

// Class Solarland.ChaGA_JetFlyCharge
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_JetFlyCharge : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VerticalChargeEffect; // 0x460(0x08)
	struct UGameplayEffect* TempVerticalChargeEffect; // 0x468(0x08)
	struct UGameplayEffect* OnceVChargeCompletedEffect; // 0x470(0x08)
	struct UGameplayEffect* HorizontalChargeEffect; // 0x478(0x08)
	struct UGameplayEffect* TempHorizontalChargeEffect; // 0x480(0x08)
	struct UGameplayEffect* OnceHChargeCompletedEffect; // 0x488(0x08)
	struct FGameplayTag TempChargeDurationTag; // 0x490(0x08)
	struct UAbilityTask_WaitGameplayEffectRemoved* OnOnceVJetChargeFinished; // 0x498(0x08)
	struct UAbilityTask_WaitGameplayEffectRemoved* OnOnceHJetChargeFinished; // 0x4a0(0x08)
	char pad_4A8[0x10]; // 0x4a8(0x10)

	void StartVerticalJetChargeFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.StartVerticalJetChargeFailed // (Final|Native|Protected|HasOutParms) // @ game+0x1c52d40
	void StartHorizontalJetChargeFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.StartHorizontalJetChargeFailed // (Final|Native|Protected|HasOutParms) // @ game+0x1c52c40
	void ReceiveVerticalJetTimesChanged(); // Function Solarland.ChaGA_JetFlyCharge.ReceiveVerticalJetTimesChanged // (Final|Native|Protected) // @ game+0x1c52bf0
	void ReceiveVerticalChargeCDChanged(float OldCD); // Function Solarland.ChaGA_JetFlyCharge.ReceiveVerticalChargeCDChanged // (Final|Native|Protected) // @ game+0x1c52b70
	void ReceiveHorizontalJetTimesChanged(); // Function Solarland.ChaGA_JetFlyCharge.ReceiveHorizontalJetTimesChanged // (Final|Native|Protected) // @ game+0x1c52b50
	void ReceiveHorizontalChargeCDChanged(float OldCD); // Function Solarland.ChaGA_JetFlyCharge.ReceiveHorizontalChargeCDChanged // (Final|Native|Protected) // @ game+0x1c52ad0
	void OnceVerticalJetChargeFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.OnceVerticalJetChargeFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c529f0
	void OnceHorizontalJetChargeFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_JetFlyCharge.OnceHorizontalJetChargeFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c52910
};

// Class Solarland.ChaGA_Jump
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Jump : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_LaunchAction
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_LaunchAction : USolarCharacterGameplayAbility {
	float WaitingLaunchingTime; // 0x460(0x04)
	struct FGameplayTag LaunchCueTag; // 0x464(0x08)
	char pad_46C[0x4]; // 0x46c(0x04)

	void EndLaunch(); // Function Solarland.ChaGA_LaunchAction.EndLaunch // (Final|Native|Protected) // @ game+0x1c516c0
};

// Class Solarland.ChaGA_LostConnection
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_LostConnection : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_LowHPShieldRecAcc
// Size: 0x458 (Inherited: 0x420)
struct UChaGA_LowHPShieldRecAcc : UCharacterTalent {
	struct UGameplayEffect* AccelerationEffectClass; // 0x420(0x08)
	struct FScalableFloat LowHPThreshold; // 0x428(0x20)
	char pad_448[0x10]; // 0x448(0x10)

	void CheckHPThreshold(); // Function Solarland.ChaGA_LowHPShieldRecAcc.CheckHPThreshold // (Final|Native|Protected) // @ game+0x1c51480
};

// Class Solarland.ChaGA_LowHPSpeedup
// Size: 0x458 (Inherited: 0x420)
struct UChaGA_LowHPSpeedup : UCharacterTalent {
	struct UGameplayEffect* SpeedupEffectClass; // 0x420(0x08)
	struct FScalableFloat LowHPThreshold; // 0x428(0x20)
	char pad_448[0x10]; // 0x448(0x10)

	void OnSpeedUpFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.OnSpeedUpFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c524d0
	void OnCoolingDownFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.OnCoolingDownFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c51bc0
	void EffectAppliedFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.ChaGA_LowHPSpeedup.EffectAppliedFailed // (Final|Native|Protected|HasOutParms) // @ game+0x1c515e0
	void CheckHPThreshold(); // Function Solarland.ChaGA_LowHPSpeedup.CheckHPThreshold // (Final|Native|Protected) // @ game+0x1c514a0
};

// Class Solarland.ChaGA_MassInvisibility
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_MassInvisibility : USolarCharacterGameplayAbility {
	struct UAnimMontage* SkillMontage; // 0x460(0x08)
	struct UAnimMontage* SkillMontageWithWeapon; // 0x468(0x08)
	struct FName StartSkillMontageNotify; // 0x470(0x08)
	struct FGameplayTag MassInvisibilityRangeCueTag; // 0x478(0x08)
	struct UGameplayEffect* MassInvisibilityEffectClass; // 0x480(0x08)
	float MassInvisibilityRangeRadius; // 0x488(0x04)
	float MassInvisibilityRangeHalfHeight; // 0x48c(0x04)
	char pad_490[0x8]; // 0x490(0x08)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_MassInvisibility.OnMontageNotify // (Final|Native|Protected) // @ game+0x1c52300
};

// Class Solarland.ChaGA_Melee
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_Melee : USolarCharacterGameplayAbility {
	struct TArray<struct FGameplayTag> CrouchMeleeMontageTags; // 0x460(0x10)
	struct TArray<struct FGameplayTag> StandMeleeMontageTags; // 0x470(0x10)
	float MotionWarpingAngleTolerance; // 0x480(0x04)
	char pad_484[0xc]; // 0x484(0x0c)

	void OnStopMelee(struct UGameplayAbility* InActivatedAbility); // Function Solarland.ChaGA_Melee.OnStopMelee // (Final|Native|Public) // @ game+0x1c525b0
	void GetYawToleranceMinMax(struct FRotator& CurrentControlRotation, struct FRotator& TargetRotation, float& YawMin, float& YawMax); // Function Solarland.ChaGA_Melee.GetYawToleranceMinMax // (Native|Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x1c516e0
};

// Class Solarland.ChaGA_MultiRecoverShield
// Size: 0x480 (Inherited: 0x460)
struct UChaGA_MultiRecoverShield : USolarCharacterGameplayAbility {
	struct UGameplayEffect* ActivationEffect; // 0x460(0x08)
	struct UGameplayEffect* CustomCoolDownEffect; // 0x468(0x08)
	char pad_470[0x10]; // 0x470(0x10)

	void OnCoolDownEffectStart(); // Function Solarland.ChaGA_MultiRecoverShield.OnCoolDownEffectStart // (Final|Native|Protected) // @ game+0x1c51ba0
	void OnCoolDownEffectFinish(); // Function Solarland.ChaGA_MultiRecoverShield.OnCoolDownEffectFinish // (Final|Native|Protected) // @ game+0x1c51b80
	void OnActivationEffect(struct FGameplayEventData Payload); // Function Solarland.ChaGA_MultiRecoverShield.OnActivationEffect // (Final|Native|Protected) // @ game+0x1c51880
};

// Class Solarland.ChaGA_NightComes
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_NightComes : USolarCharacterGameplayAbility {
	struct UGameplayEffect* NightComesBuffGameplayEffect; // 0x460(0x08)
	struct ASolarNightComesActor* NightComesActorClass; // 0x468(0x08)
	struct UAnimMontage* SkillMontage; // 0x470(0x08)
	struct UAnimMontage* SkillMontageWithWeapon; // 0x478(0x08)
	struct FName StartSkillMontageNotify; // 0x480(0x08)
	struct FName MeshSocket; // 0x488(0x08)
	char pad_490[0x8]; // 0x490(0x08)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_NightComes.OnMontageNotify // (Final|Native|Protected) // @ game+0x1c52380
};

// Class Solarland.ChaGA_OpenNewTreasureBox
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_OpenNewTreasureBox : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_OpenScope
// Size: 0x4b8 (Inherited: 0x460)
struct UChaGA_OpenScope : USolarCharacterGameplayAbility {
	struct FGameplayTagRequirements OngoingTagRequirements; // 0x460(0x50)
	float MaxEnteringScopeOpeningTime; // 0x4b0(0x04)
	char pad_4B4[0x4]; // 0x4b4(0x04)

	void OnOngoingTagRequirementsMetStatusChange(bool bMet); // Function Solarland.ChaGA_OpenScope.OnOngoingTagRequirementsMetStatusChange // (Final|Native|Private) // @ game+0x1c52400
};

// Class Solarland.ChaGA_OpenTreasureBox
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_OpenTreasureBox : USolarCharacterGameplayAbility {
	struct FGameplayTag OpenTreasureBoxMontageTag; // 0x460(0x08)
};

// Class Solarland.ChaGA_ParkourMaster
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_ParkourMaster : USolarCharacterGameplayAbility {
	struct UGameplayEffect* VertEffect; // 0x460(0x08)
	struct UGameplayEffect* HoriEffect; // 0x468(0x08)
	char pad_470[0x20]; // 0x470(0x20)

	void OnJetFlyActivated(struct UGameplayAbility* InActivatedAbility); // Function Solarland.ChaGA_ParkourMaster.OnJetFlyActivated // (Final|Native|Protected) // @ game+0x1c52280
};

// Class Solarland.ChaGA_PickUp
// Size: 0x490 (Inherited: 0x460)
struct UChaGA_PickUp : USolarCharacterGameplayAbility {
	struct FGameplayTag PickUpHighEmptyMontageTag; // 0x460(0x08)
	struct FGameplayTag PickUpLowEmptyMontageTag; // 0x468(0x08)
	struct FGameplayTag PickUpHighGunAimMontageTag; // 0x470(0x08)
	struct FGameplayTag PickUpLowGunAimMontageTag; // 0x478(0x08)
	char pad_480[0x10]; // 0x480(0x10)

	void OnWeaponSlotReplace(int32_t InWeaponSlotID, struct ASolarPlayerWeapon* InWeapon); // Function Solarland.ChaGA_PickUp.OnWeaponSlotReplace // (Final|Native|Private) // @ game+0x1c52850
	void OnMontageCompleted(); // Function Solarland.ChaGA_PickUp.OnMontageCompleted // (Final|Native|Private) // @ game+0x1c516c0
};

// Class Solarland.ChaGA_RadarScanning
// Size: 0x4a8 (Inherited: 0x460)
struct UChaGA_RadarScanning : USolarCharacterGameplayAbility {
	float SpawnRadarDelayTime; // 0x460(0x04)
	float Lifetime; // 0x464(0x04)
	float LifeTimeNoResult; // 0x468(0x04)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct ASolarRadarBase* RadarClass; // 0x470(0x08)
	int32_t SpawnRadarEventID; // 0x478(0x04)
	float EffectRadius; // 0x47c(0x04)
	struct FGameplayTag CueTag; // 0x480(0x08)
	struct ASolarRadarBase* SpawnedRadar; // 0x488(0x08)
	char pad_490[0x18]; // 0x490(0x18)

	void StartSpawnRadar(); // Function Solarland.ChaGA_RadarScanning.StartSpawnRadar // (Final|Native|Private) // @ game+0x1c52d20
};

// Class Solarland.ChaGA_RapidBoost
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_RapidBoost : USolarCharacterGameplayAbility {
	struct UGameplayEffect* JetFlyCooldownEffectClass; // 0x460(0x08)
};

// Class Solarland.ChaGA_Rebirth
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Rebirth : USolarCharacterGameplayAbility {
	struct UGameplayEffect* RebirthHPEffect; // 0x460(0x08)
	struct UGameplayEffect* ResetJetFlyTimesEffect; // 0x468(0x08)
};

// Class Solarland.ChaGA_RechargeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_RechargeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag RechargeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_Reload
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_Reload : USolarCharacterGameplayAbility {
	struct FGameplayTag ReloadMontageTag; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnWeaponReloadComplete(); // Function Solarland.ChaGA_Reload.OnWeaponReloadComplete // (Final|Native|Public) // @ game+0x1c52830
};

// Class Solarland.ChaGA_RepairVehicle
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_RepairVehicle : USolarCharacterGameplayAbility {
	struct FGameplayTag RepairVehicleWeakPointsMontageTag; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnVehicleWeakPointRepairingEnd(bool bCompleted); // Function Solarland.ChaGA_RepairVehicle.OnVehicleWeakPointRepairingEnd // (Final|Native|Private) // @ game+0x1c52780
};

// Class Solarland.ChaGA_Rescue
// Size: 0x480 (Inherited: 0x460)
struct UChaGA_Rescue : USolarCharacterGameplayAbility {
	float SucceedBeforeSoundTime; // 0x460(0x04)
	struct FGameplayTag TeamRescueMontageTag; // 0x464(0x08)
	char pad_46C[0x4]; // 0x46c(0x04)
	struct UChaAT_WaitDelay* DelayTask; // 0x470(0x08)
	struct FGameplayTag SucceedCueTag; // 0x478(0x08)

	bool ShouldCancelRescue(); // Function Solarland.ChaGA_Rescue.ShouldCancelRescue // (Final|Native|Protected) // @ game+0x1c52c10
	void OnRescueCompleted(); // Function Solarland.ChaGA_Rescue.OnRescueCompleted // (Final|Native|Protected) // @ game+0x1c524b0
	void OnMontageCompleted(); // Function Solarland.ChaGA_Rescue.OnMontageCompleted // (Final|Native|Protected) // @ game+0x1c516c0
	void BeforeRescueCompleted(); // Function Solarland.ChaGA_Rescue.BeforeRescueCompleted // (Final|Native|Protected) // @ game+0x1c51460
};

// Class Solarland.ChaGA_ReviveTeammates
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_ReviveTeammates : USolarCharacterGameplayAbility {
	struct FGameplayTag ReviveTeammatesMontageTag; // 0x460(0x08)

	void OnReviveCompleted(); // Function Solarland.ChaGA_ReviveTeammates.OnReviveCompleted // (Final|Native|Protected) // @ game+0x1c56cf0
	void OnAbilityExec(); // Function Solarland.ChaGA_ReviveTeammates.OnAbilityExec // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.ChaGA_ShopVIP
// Size: 0x440 (Inherited: 0x438)
struct UChaGA_ShopVIP : USideResidentPassiveSkill {
	float ModifierValue; // 0x438(0x04)
	char pad_43C[0x4]; // 0x43c(0x04)
};

// Class Solarland.ChaGA_SkydiveFly
// Size: 0x468 (Inherited: 0x460)
struct UChaGA_SkydiveFly : USolarCharacterGameplayAbility {
	struct FGameplayTag SkydiveSoundCue; // 0x460(0x08)

	void OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Solarland.ChaGA_SkydiveFly.OnMovementModeChanged // (Final|Native|Private) // @ game+0x1c56950
};

// Class Solarland.ChaGA_SkydiveLand
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_SkydiveLand : USolarCharacterGameplayAbility {

	void OnMovementModeChanged(enum class EMovementMode NewMovementMode); // Function Solarland.ChaGA_SkydiveLand.OnMovementModeChanged // (Final|Native|Private) // @ game+0x1c569d0
};

// Class Solarland.ChaGA_Sprint
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_Sprint : USolarCharacterGameplayAbility {
	struct UGameplayEffect* SprintEffectClass; // 0x460(0x08)
	struct UGameplayEffect* CancelSprintEffectClass; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void OnSprintCancelled(); // Function Solarland.ChaGA_Sprint.OnSprintCancelled // (Final|Native|Private) // @ game+0x1c56eb0
};

// Class Solarland.ChaGA_StickOutOfVehicle
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_StickOutOfVehicle : USolarCharacterGameplayAbility {
	float OutShotTimerForPC; // 0x460(0x04)
	char pad_464[0x4]; // 0x464(0x04)
	struct FGameplayTagContainer BreakOutShotTags; // 0x468(0x20)

	void OnCancelByAdditionalCheck(); // Function Solarland.ChaGA_StickOutOfVehicle.OnCancelByAdditionalCheck // (Final|Native|Private) // @ game+0x79f030
	bool CheckAdditionalCancel(); // Function Solarland.ChaGA_StickOutOfVehicle.CheckAdditionalCancel // (Final|Native|Private) // @ game+0x1c55ff0
};

// Class Solarland.ChaGA_SuperRadarScan
// Size: 0x518 (Inherited: 0x460)
struct UChaGA_SuperRadarScan : USolarCharacterGameplayAbility {
	struct ASolarCharacter* CacheCharacter; // 0x460(0x08)
	bool bSpawnRadarSuccess; // 0x468(0x01)
	bool bSpawnedRadar; // 0x469(0x01)
	bool bBackswingPlayed; // 0x46a(0x01)
	char pad_46B[0x1]; // 0x46b(0x01)
	struct FVector HitLocation; // 0x46c(0x0c)
	struct FGameplayTag RadarOrnamentTag; // 0x478(0x08)
	float Lifetime; // 0x480(0x04)
	float PrecastTime; // 0x484(0x04)
	float BackswingTime; // 0x488(0x04)
	char pad_48C[0x4]; // 0x48c(0x04)
	struct UGameplayAbility* RadarScanningAbilityClass; // 0x490(0x08)
	struct UAnimMontage* ScanAnimMontage; // 0x498(0x08)
	struct FGameplayTag CueTag; // 0x4a0(0x08)
	float MoveRadius; // 0x4a8(0x04)
	float OverlookCameraHeight; // 0x4ac(0x04)
	float OverlookCameraPitch; // 0x4b0(0x04)
	float CameraMoveScale; // 0x4b4(0x04)
	struct UParticleSystem* PreviewEffect; // 0x4b8(0x08)
	float CancelCD; // 0x4c0(0x04)
	char pad_4C4[0x3c]; // 0x4c4(0x3c)
	struct ACameraActor* CacheOverlookCamera; // 0x500(0x08)
	struct AActor* CacheViewTarget; // 0x508(0x08)
	struct UParticleSystemComponent* CacheEmitter; // 0x510(0x08)

	void TryCreateRadarForAI(); // Function Solarland.ChaGA_SuperRadarScan.TryCreateRadarForAI // (Final|Native|Private) // @ game+0x1c57370
	void TryCreateRadar(bool bSpawn, struct FVector& InLoc); // Function Solarland.ChaGA_SuperRadarScan.TryCreateRadar // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x1c57290
	void StartBackswing(); // Function Solarland.ChaGA_SuperRadarScan.StartBackswing // (Final|Native|Protected) // @ game+0x1c57230
	void PlaySound(struct FString InSoundName); // Function Solarland.ChaGA_SuperRadarScan.PlaySound // (Final|Native|Public|BlueprintCallable) // @ game+0x1c57190
	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HPDamage); // Function Solarland.ChaGA_SuperRadarScan.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x1c56ed0
	void OnSpawnRadarSuccessfulHandle(struct FGameplayTag Tag, int32_t NewCount); // Function Solarland.ChaGA_SuperRadarScan.OnSpawnRadarSuccessfulHandle // (Final|Native|Public) // @ game+0x1c56df0
	void OnReceivdTryCreateRadar(bool bSpawn); // Function Solarland.ChaGA_SuperRadarScan.OnReceivdTryCreateRadar // (Final|Native|Public) // @ game+0x1c56a70
	void OnPrecastReady(); // Function Solarland.ChaGA_SuperRadarScan.OnPrecastReady // (Final|Native|Protected) // @ game+0x1c56a50
	void OnPostMontageCompleted(); // Function Solarland.ChaGA_SuperRadarScan.OnPostMontageCompleted // (Final|Native|Private) // @ game+0x1c4d470
	void OnCameraRight(float Value); // Function Solarland.ChaGA_SuperRadarScan.OnCameraRight // (Final|Native|Public) // @ game+0x1c56350
	void OnCameraForward(float Value); // Function Solarland.ChaGA_SuperRadarScan.OnCameraForward // (Final|Native|Public) // @ game+0x1c562d0
	void OnBackswingReady(); // Function Solarland.ChaGA_SuperRadarScan.OnBackswingReady // (Final|Native|Protected) // @ game+0x1c4d470
	void K2_OnPrecastReady(); // Function Solarland.ChaGA_SuperRadarScan.K2_OnPrecastReady // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void K2_OnBackswingStart(bool bSuccess); // Function Solarland.ChaGA_SuperRadarScan.K2_OnBackswingStart // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void K2_OnAbilityEnd(struct ASolarCharacter* Character, bool bSuccess); // Function Solarland.ChaGA_SuperRadarScan.K2_OnAbilityEnd // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void K2_OnAbilityActive(struct ASolarCharacter* Character); // Function Solarland.ChaGA_SuperRadarScan.K2_OnAbilityActive // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.ChaGA_Swap
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Swap : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_Swim
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_Swim : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_SwitchVehicleSeat
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_SwitchVehicleSeat : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_TeamBoost
// Size: 0x4a0 (Inherited: 0x460)
struct UChaGA_TeamBoost : USolarCharacterGameplayAbility {
	struct UAnimMontage* SkillMontage; // 0x460(0x08)
	struct FName StartSkillMontageNotify; // 0x468(0x08)
	struct UGameplayEffect* PurifyEffectClass; // 0x470(0x08)
	struct UGameplayEffect* SelfBoostEffectClass; // 0x478(0x08)
	struct UGameplayEffect* TeammateBoostEffectClass; // 0x480(0x08)
	struct ATeamBoostProjectile* TeamBoostProjectileClass; // 0x488(0x08)
	float SkillRangeRadius; // 0x490(0x04)
	float SkillRangeHalfHeight; // 0x494(0x04)
	char pad_498[0x8]; // 0x498(0x08)

	void OnMontageNotify(struct FName NotifyName); // Function Solarland.ChaGA_TeamBoost.OnMontageNotify // (Final|Native|Protected) // @ game+0x1c56840
};

// Class Solarland.ChaGA_TrackingMaster
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_TrackingMaster : USolarCharacterGameplayAbility {
	struct UGameplayEffect* TrackingMasterEffect; // 0x460(0x08)
	char pad_468[0x10]; // 0x468(0x10)

	void OnCharacterBeforeChange(); // Function Solarland.ChaGA_TrackingMaster.OnCharacterBeforeChange // (Final|Native|Protected) // @ game+0x1c563f0
};

// Class Solarland.ChaGA_Treat
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_Treat : USolarCharacterGameplayAbility {
	struct FGameplayTag TreatMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)
};

// Class Solarland.ChaGA_UAVRescue
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_UAVRescue : USolarCharacterGameplayAbility {
	struct ASolarUAVRescue* RescueUAVClass; // 0x460(0x08)
	float Lifetime; // 0x468(0x04)
	bool bEffectTeammates; // 0x46c(0x01)
	char pad_46D[0x3]; // 0x46d(0x03)
	struct UAnimMontage* SummoEmptyMontage; // 0x470(0x08)
	struct UAnimMontage* SummonAnimMontage; // 0x478(0x08)
	float SummonTime; // 0x480(0x04)
	float PermanentSpawnDelay; // 0x484(0x04)
	char pad_488[0x10]; // 0x488(0x10)

	void SummonUAV(); // Function Solarland.ChaGA_UAVRescue.SummonUAV // (Final|Native|Private) // @ game+0x1c57250
};

// Class Solarland.ChaGA_UAVShield
// Size: 0x4a0 (Inherited: 0x460)
struct UChaGA_UAVShield : USolarCharacterGameplayAbility {
	struct ASolarUAVShield* ShieldUAVClass; // 0x460(0x08)
	char pad_468[0x10]; // 0x468(0x10)
	float Lifetime; // 0x478(0x04)
	bool bEffectTeammates; // 0x47c(0x01)
	char pad_47D[0x3]; // 0x47d(0x03)
	struct UAnimMontage* SummonAnimMontage; // 0x480(0x08)
	struct UAnimMontage* SummonAnimMontage_Aim; // 0x488(0x08)
	float SummonTime; // 0x490(0x04)
	char pad_494[0xc]; // 0x494(0x0c)

	void SummonUAV(); // Function Solarland.ChaGA_UAVShield.SummonUAV // (Final|Native|Private) // @ game+0x1c57270
};

// Class Solarland.ChaGA_UpgradeShield
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_UpgradeShield : USolarCharacterGameplayAbility {
	struct FGameplayTag UpgradeShieldMontageTag; // 0x460(0x08)
	struct FGameplayTagContainer ActivationRequiredTagsAny; // 0x468(0x20)

	void OnMontageCompleted(); // Function Solarland.ChaGA_UpgradeShield.OnMontageCompleted // (Final|Native|Private) // @ game+0x1c56820
};

// Class Solarland.ChaGA_VaultBase
// Size: 0x498 (Inherited: 0x460)
struct UChaGA_VaultBase : USolarCharacterGameplayAbility {
	struct AActor* ContactActor; // 0x460(0x08)
	char pad_468[0x30]; // 0x468(0x30)

	void OnServerConfirm(); // Function Solarland.ChaGA_VaultBase.OnServerConfirm // (Final|Native|Protected) // @ game+0x1c56dd0
	void OnMontageCompleted(); // Function Solarland.ChaGA_VaultBase.OnMontageCompleted // (Final|Native|Protected) // @ game+0x1c516c0
	void OnMontageBlendOut(); // Function Solarland.ChaGA_VaultBase.OnMontageBlendOut // (Final|Native|Protected) // @ game+0x1c56800
};

// Class Solarland.ChaGA_Vault
// Size: 0x568 (Inherited: 0x498)
struct UChaGA_Vault : UChaGA_VaultBase {
	struct FGameplayTag StepMontageTag; // 0x498(0x08)
	struct FGameplayTag Step_CrossMontageTag; // 0x4a0(0x08)
	struct FGameplayTag Step_SprintMontageTag; // 0x4a8(0x08)
	struct FGameplayTag Step_Sprint_CrossMontageTag; // 0x4b0(0x08)
	struct FGameplayTag VaultMontageTag; // 0x4b8(0x08)
	struct FGameplayTag Vault_CrossMontageTag; // 0x4c0(0x08)
	struct FGameplayTag Vault_SprintMontageTag; // 0x4c8(0x08)
	struct FGameplayTag Vault_Sprint_CrossMontageTag; // 0x4d0(0x08)
	struct FGameplayTag ClimbMontageTag; // 0x4d8(0x08)
	struct FGameplayTag Climb_CrossMontageTag; // 0x4e0(0x08)
	struct FGameplayTag Climb_SprintMontageTag; // 0x4e8(0x08)
	struct FGameplayTag Climb_Sprint_CrossMontageTag; // 0x4f0(0x08)
	struct FGameplayTag Climb_WaterMontageTag; // 0x4f8(0x08)
	struct FGameplayTag HighClimbMontageTag; // 0x500(0x08)
	struct FGameplayTag HighClimb_CrossMontageTag; // 0x508(0x08)
	struct FGameplayTag HighClimb_SprintMontageTag; // 0x510(0x08)
	struct FGameplayTag HighClimb_Sprint_CrossMontageTag; // 0x518(0x08)
	struct FString PlayerCancelVaultEventName; // 0x520(0x10)
	struct FString TeammateCancelVaultEventName; // 0x530(0x10)
	struct FString EnemyCancelVaultEventName; // 0x540(0x10)
	char pad_550[0x18]; // 0x550(0x18)

	void OnRootMotionModifierDeactivate(struct ACharacter* Character, struct URootMotionModifier* Modifier); // Function Solarland.ChaGA_Vault.OnRootMotionModifierDeactivate // (Final|Native|Protected) // @ game+0x1c56d10
	void OnHandleNotify(struct USolarAnimInstance* AnimInstance, struct USolarAnimNotify* Notify, int32_t& OutDenial); // Function Solarland.ChaGA_Vault.OnHandleNotify // (Final|Native|Protected|HasOutParms) // @ game+0x1c56620
};

// Class Solarland.ChaGA_VehicleFire
// Size: 0x470 (Inherited: 0x460)
struct UChaGA_VehicleFire : USolarCharacterGameplayAbility {
	struct ASolarCharacter* ActCharacter; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)

	void OnFireTaskEnd(); // Function Solarland.ChaGA_VehicleFire.OnFireTaskEnd // (Final|Native|Public) // @ game+0x1c56600
	void OnCtrlTaskEnd(); // Function Solarland.ChaGA_VehicleFire.OnCtrlTaskEnd // (Final|Native|Public) // @ game+0x1c56410
	void DoFireTask(); // Function Solarland.ChaGA_VehicleFire.DoFireTask // (Final|Native|Public) // @ game+0x1c56020
};

// Class Solarland.ChaGA_VehicleForceJetFlyAction
// Size: 0x460 (Inherited: 0x460)
struct UChaGA_VehicleForceJetFlyAction : USolarCharacterGameplayAbility {
};

// Class Solarland.ChaGA_VehicleReload
// Size: 0x478 (Inherited: 0x460)
struct UChaGA_VehicleReload : USolarCharacterGameplayAbility {
	char pad_460[0x8]; // 0x460(0x08)
	struct ASolarVehicleWeapon* CachedReloadWeapon; // 0x468(0x08)
	struct UGameplayEffect* VehicleWeaponReloadEffect; // 0x470(0x08)

	void OnWeaponReloadComplete(); // Function Solarland.ChaGA_VehicleReload.OnWeaponReloadComplete // (Final|Native|Public) // @ game+0x1c57170
};

// Class Solarland.ChaGA_WallRun
// Size: 0x4e8 (Inherited: 0x498)
struct UChaGA_WallRun : UChaGA_VaultBase {
	float InertiaSpeed; // 0x498(0x04)
	float WallRunCameraAngleTolerance; // 0x49c(0x04)
	float WallRunJumpHeight; // 0x4a0(0x04)
	float WallRunJumpDist; // 0x4a4(0x04)
	float WallRunFailedHeight; // 0x4a8(0x04)
	float WallRunFailedDist; // 0x4ac(0x04)
	struct FName CancelActionName; // 0x4b0(0x08)
	struct FName JumpActionName; // 0x4b8(0x08)
	struct FString WarpTargetPrefix; // 0x4c0(0x10)
	struct FGameplayTag WallRunMontageTag; // 0x4d0(0x08)
	struct FGameplayTag WallRunFailedMontageTag; // 0x4d8(0x08)
	char pad_4E0[0x8]; // 0x4e0(0x08)

	void OnTakeDamage(struct ASolarCharacter* Character, struct FSolarPointDamageEvent& DamageEvent, float HealtDamage); // Function Solarland.ChaGA_WallRun.OnTakeDamage // (Final|Native|Private|HasOutParms) // @ game+0x1c57020
	void OnRequestedToJump(); // Function Solarland.ChaGA_WallRun.OnRequestedToJump // (Final|Native|Private) // @ game+0x1c56cd0
	void OnCancel(); // Function Solarland.ChaGA_WallRun.OnCancel // (Final|Native|Private) // @ game+0x1c563d0
};

// Class Solarland.ChaGA_WallRunJump
// Size: 0x488 (Inherited: 0x460)
struct UChaGA_WallRunJump : USolarCharacterGameplayAbility {
	float InertiaSpeed; // 0x460(0x04)
	float CameraRotLagSpeed; // 0x464(0x04)
	struct FGameplayTag WallRunJumpMontageTag; // 0x468(0x08)
	char pad_470[0x18]; // 0x470(0x18)

	void OnMontageCompleted(); // Function Solarland.ChaGA_WallRunJump.OnMontageCompleted // (Final|Native|Private) // @ game+0x1c516c0
	void OnMontageBlendOut(); // Function Solarland.ChaGA_WallRunJump.OnMontageBlendOut // (Final|Native|Private) // @ game+0x1c516c0
};

// Class Solarland.ChaGC_AirDrop
// Size: 0x298 (Inherited: 0x298)
struct AChaGC_AirDrop : AGameplayCueNotify_Actor {
};

// Class Solarland.ChaGC_CharacterActorCueBase
// Size: 0x2a8 (Inherited: 0x298)
struct AChaGC_CharacterActorCueBase : AGameplayCueNotify_Actor {
	struct TArray<struct FCueContent> CueContents; // 0x298(0x10)

	bool WhileActiveInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.WhileActiveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c573b0
	bool OnRemoveInternal(struct ASolarCharacter* NullableCharacter, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnRemoveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c56b00
	void OnLocalPlayerSpectateMeStatusChanged(struct ASolarCharacter* Character, bool bIsSpectating); // Function Solarland.ChaGC_CharacterActorCueBase.OnLocalPlayerSpectateMeStatusChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x1c56730
	bool OnExecuteInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnExecuteInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c56430
	bool OnActiveInternal(struct ASolarCharacter* Character, struct FGameplayCueParameters& Parameters); // Function Solarland.ChaGC_CharacterActorCueBase.OnActiveInternal // (Native|Event|Protected|HasOutParms|BlueprintEvent) // @ game+0x1c56070
	bool ListenLocalPlayerSpectateMeStatus(); // Function Solarland.ChaGC_CharacterActorCueBase.ListenLocalPlayerSpectateMeStatus // (Native|Event|Protected|BlueprintEvent|Const) // @ game+0x1c56040
};

// Class Solarland.ChaGC_JetFlyBoost
// Size: 0x298 (Inherited: 0x298)
struct AChaGC_JetFlyBoost : AGameplayCueNotify_Actor {
};

// Class Solarland.ChaGC_SuperSkillActorCueBase
// Size: 0x2b0 (Inherited: 0x2a8)
struct AChaGC_SuperSkillActorCueBase : AChaGC_CharacterActorCueBase {
	struct FGameplayTag SuperSkillGameplayEffectTag; // 0x2a8(0x08)
};

// Class Solarland.ChaGC_MassInvisibility
// Size: 0x338 (Inherited: 0x2b0)
struct AChaGC_MassInvisibility : AChaGC_SuperSkillActorCueBase {
	struct UActorEffect* InvisibilityEffectClass; // 0x2b0(0x08)
	float InvisibilityValueToTeammate; // 0x2b8(0x04)
	float InvisibilityValueOnSprinting; // 0x2bc(0x04)
	float MaterialSmoothSpeedOnSprinting; // 0x2c0(0x04)
	int32_t SprintingStatusNotificationID; // 0x2c4(0x04)
	int32_t SprintingStatusTipShowInterval; // 0x2c8(0x04)
	float WarningOtherRange; // 0x2cc(0x04)
	float WarningOtherRangeOutThreshold; // 0x2d0(0x04)
	float TimeBeforeEndToStartEndWarning; // 0x2d4(0x04)
	struct FName EndWarningMaterialParameterName; // 0x2d8(0x08)
	struct FName EndWarningSoundGroupName; // 0x2e0(0x08)
	float EndWarningSoundTriggerPoint; // 0x2e8(0x04)
	float EndWarningRate; // 0x2ec(0x04)
	struct UCameraShake* CameraModifierClass; // 0x2f0(0x08)
	char pad_2F8[0x40]; // 0x2f8(0x40)
};

// Class Solarland.ChaGC_MassInvisibilityPrepare
// Size: 0x2c0 (Inherited: 0x2a8)
struct AChaGC_MassInvisibilityPrepare : AChaGC_CharacterActorCueBase {
	struct UActorEffect* InvisibilityPrepareEffectClass; // 0x2a8(0x08)
	float PrepareDuration; // 0x2b0(0x04)
	char pad_2B4[0xc]; // 0x2b4(0x0c)
};

// Class Solarland.ChaGC_ParkourAcceleration
// Size: 0x310 (Inherited: 0x298)
struct AChaGC_ParkourAcceleration : AGameplayCueNotify_Actor {
	struct FName FlushEffectID; // 0x298(0x08)
	struct FName TrailEffectID; // 0x2a0(0x08)
	struct TMap<struct FName, struct FVector2D> TrailEmitterParameters; // 0x2a8(0x50)
	struct FGameplayTag DurationTag; // 0x2f8(0x08)
	char pad_300[0x10]; // 0x300(0x10)
};

// Class Solarland.ChaGC_SkydiveSound
// Size: 0x2b8 (Inherited: 0x298)
struct AChaGC_SkydiveSound : AGameplayCueNotify_Actor {
	struct FName StartSkydiveLoopSoundGroup_Speed; // 0x298(0x08)
	struct FName StartSkydiveLoopSoundGroup_Height; // 0x2a0(0x08)
	struct FName StopSkydiveLoopSoundGroup_Speed; // 0x2a8(0x08)
	struct FName StopSkydiveLoopSoundGroup_Height; // 0x2b0(0x08)
};

// Class Solarland.ChaGC_WallRun
// Size: 0x50 (Inherited: 0x50)
struct UChaGC_WallRun : UGameplayCueNotify_Static {
};

// Class Solarland.CharacterBasalAttributeSet
// Size: 0x330 (Inherited: 0x50)
struct UCharacterBasalAttributeSet : UBasalAttributeSet {
	struct FGameplayAttributeData Speed; // 0x50(0x10)
	struct FGameplayAttributeData BaseSpeed; // 0x60(0x10)
	struct FGameplayAttributeData PassiveSkillSpeedMultiple; // 0x70(0x10)
	struct FGameplayAttributeData ShootingSpeedMultiple; // 0x80(0x10)
	struct FGameplayAttributeData CustomJumpHeightMultiple; // 0x90(0x10)
	struct FGameplayAttributeData AllSpeedParamA; // 0xa0(0x10)
	struct FGameplayAttributeData AllSpeedParamB; // 0xb0(0x10)
	struct FGameplayAttributeData AllSpeedParamC; // 0xc0(0x10)
	struct FGameplayAttributeData AllSpeedParamD; // 0xd0(0x10)
	struct FGameplayAttributeData GroundSpeedParamA; // 0xe0(0x10)
	struct FGameplayAttributeData GroundSpeedParamB; // 0xf0(0x10)
	struct FGameplayAttributeData GroundSpeedParamC; // 0x100(0x10)
	struct FGameplayAttributeData GroundSpeedParamD; // 0x110(0x10)
	struct FGameplayAttributeData SwimSpeedParamA; // 0x120(0x10)
	struct FGameplayAttributeData SwimSpeedParamB; // 0x130(0x10)
	struct FGameplayAttributeData SwimSpeedParamC; // 0x140(0x10)
	struct FGameplayAttributeData SwimSpeedParamD; // 0x150(0x10)
	struct FGameplayAttributeData MaxShield; // 0x160(0x10)
	struct FGameplayAttributeData CurrentShield; // 0x170(0x10)
	struct FGameplayAttributeData ShieldMultiRecoverCoeff; // 0x180(0x10)
	struct FGameplayAttributeData ShieldReductionDamageMultiple; // 0x190(0x10)
	struct FGameplayAttributeData RadialDamageReductionMultiple; // 0x1a0(0x10)
	struct FGameplayAttributeData WeaponDamageParamA; // 0x1b0(0x10)
	struct FGameplayAttributeData WeaponDamageParamB; // 0x1c0(0x10)
	struct FGameplayAttributeData WeaponDamageParamC; // 0x1d0(0x10)
	struct FGameplayAttributeData WeaponDamageParamD; // 0x1e0(0x10)
	struct FGameplayAttributeData UnarmedWeaponDamageParamB; // 0x1f0(0x10)
	struct FGameplayAttributeData VehicleWeaponDamageParamB; // 0x200(0x10)
	struct FGameplayAttributeData VehicleHitDamageParamB; // 0x210(0x10)
	struct FGameplayAttributeData VehicleAbilityDamageParamB; // 0x220(0x10)
	struct FGameplayAttributeData CharacterSkillDamageParamB; // 0x230(0x10)
	struct FGameplayAttributeData VerticalJetTimesCD; // 0x240(0x10)
	struct FGameplayAttributeData VerticalJetInnerCD; // 0x250(0x10)
	struct FGameplayAttributeData VerticalJetTimes; // 0x260(0x10)
	struct FGameplayAttributeData VerticalJetRestTimes; // 0x270(0x10)
	struct FGameplayAttributeData HorizontalJetTimesCD; // 0x280(0x10)
	struct FGameplayAttributeData HorizontalJetInnerCD; // 0x290(0x10)
	struct FGameplayAttributeData HorizontalJetTimes; // 0x2a0(0x10)
	struct FGameplayAttributeData HorizontalJetRestTimes; // 0x2b0(0x10)
	struct FGameplayAttributeData RescueRecoveredMultiple; // 0x2c0(0x10)
	struct FGameplayAttributeData TreatmentDurationReductionMultiple; // 0x2d0(0x10)
	struct FGameplayAttributeData ShieldRecoveredMultiple; // 0x2e0(0x10)
	struct FGameplayAttributeData ChargingMultiple; // 0x2f0(0x10)
	struct FGameplayAttributeData AutoHealingRateOnMotorbike; // 0x300(0x10)
	struct FGameplayAttributeData RescueDurationReductionMultiple; // 0x310(0x10)
	struct FGameplayAttributeData ReviveDurationReductionBonus; // 0x320(0x10)

	void OnRep_VerticalJetTimesCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetTimesCD // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b7b0
	void OnRep_VerticalJetTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetTimes // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b710
	void OnRep_VerticalJetRestTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetRestTimes // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b670
	void OnRep_VerticalJetInnerCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_VerticalJetInnerCD // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b5d0
	void OnRep_TreatmentDurationReductionMultiple(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_TreatmentDurationReductionMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b530
	void OnRep_Speed(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_Speed // (Native|Protected|HasOutParms) // @ game+0x1c5b480
	void OnRep_ShieldMultiRecoverCoeff(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_ShieldMultiRecoverCoeff // (Native|Protected|HasOutParms) // @ game+0x1c5b3d0
	void OnRep_RescueDurationReductionMultiple(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_RescueDurationReductionMultiple // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b330
	void OnRep_MaxShield(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_MaxShield // (Native|Protected|HasOutParms) // @ game+0x1c5b280
	void OnRep_HorizontalJetTimesCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetTimesCD // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b1e0
	void OnRep_HorizontalJetTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetTimes // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b140
	void OnRep_HorizontalJetRestTimes(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetRestTimes // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b0a0
	void OnRep_HorizontalJetInnerCD(struct FGameplayAttributeData& Previous); // Function Solarland.CharacterBasalAttributeSet.OnRep_HorizontalJetInnerCD // (Final|Native|Protected|HasOutParms) // @ game+0x1c5b000
	void OnRep_CurrentShield(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterBasalAttributeSet.OnRep_CurrentShield // (Native|Protected|HasOutParms) // @ game+0x1c5af50
};

// Class Solarland.CharacterBodyScaleConfigDataAsset
// Size: 0x1a8 (Inherited: 0x30)
struct UCharacterBodyScaleConfigDataAsset : UDataAsset {
	struct TMap<enum class ECharacterBodyScaleType, struct FCharacterBodyScaleConfig> ConfigMap; // 0x30(0x50)
	struct FCharacterAssistAimTargetConfig DefaultAssistAimTargetConfig; // 0x80(0xd8)
	struct TMap<enum class ECharacterBodyScaleType, struct FCharacterAssistAimTargetConfig> AssistAimTargetConfigMap; // 0x158(0x50)
};

// Class Solarland.CharacterConfigAsset
// Size: 0x30 (Inherited: 0x30)
struct UCharacterConfigAsset : UDataAsset {
};

// Class Solarland.CharacterCruiseComponent
// Size: 0xf8 (Inherited: 0xb0)
struct UCharacterCruiseComponent : UActorComponent {
	struct ASolarCapsuleActor* BoardedCapsulePrivate; // 0xb0(0x08)
	char pad_B8[0xc]; // 0xb8(0x0c)
	struct FName CruiseStartSoundGroupName; // 0xc4(0x08)
	char pad_CC[0x2c]; // 0xcc(0x2c)

	struct ASolarCharacter* GetCharacterOwner(); // Function Solarland.CharacterCruiseComponent.GetCharacterOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c5af30
};

// Class Solarland.CharacterGameplayTagsConfig
// Size: 0x598 (Inherited: 0x30)
struct UCharacterGameplayTagsConfig : UDataAsset {
	struct FGameplayTag CruiseAbilityTag; // 0x30(0x08)
	struct FGameplayTag SkydiveFlyAbilityTag; // 0x38(0x08)
	struct FGameplayTag SkydiveLandAbilityTag; // 0x40(0x08)
	struct FGameplayTag CrouchAbilityTag; // 0x48(0x08)
	struct FGameplayTag JumpAbilityTag; // 0x50(0x08)
	struct FGameplayTag SprintAbilityTag; // 0x58(0x08)
	struct FGameplayTag SwimAbilityTag; // 0x60(0x08)
	struct FGameplayTag VaultAbilityTag; // 0x68(0x08)
	struct FGameplayTag JetFlyAbilityTag; // 0x70(0x08)
	struct FGameplayTag JetFlyVertAbilityTag; // 0x78(0x08)
	struct FGameplayTag JetFlyHoriAbilityTag; // 0x80(0x08)
	struct FGameplayTag LaunchAbilityTag; // 0x88(0x08)
	struct FGameplayTag EquipAbilityTag; // 0x90(0x08)
	struct FGameplayTag MeleeAbilityTag; // 0x98(0x08)
	struct FGameplayTag FireAbilityTag; // 0xa0(0x08)
	struct FGameplayTag ReloadAbilityTag; // 0xa8(0x08)
	struct FGameplayTag VehicleFireAbilityTag; // 0xb0(0x08)
	struct FGameplayTag VehicleReloadAbilityTag; // 0xb8(0x08)
	struct FGameplayTag BoltAbilityTag; // 0xc0(0x08)
	struct FGameplayTag OpenScopeAbilityTag; // 0xc8(0x08)
	struct FGameplayTag WeaponAbilityTag; // 0xd0(0x08)
	struct FGameplayTag GetOnVehicleAbilityTag; // 0xd8(0x08)
	struct FGameplayTag GetOffVehicleAbilityTag; // 0xe0(0x08)
	struct FGameplayTag SwitchVehicleSeatAbilityTag; // 0xe8(0x08)
	struct FGameplayTag StickOutOffVehicleAbilityTag; // 0xf0(0x08)
	struct FGameplayTag TreatAbilityTag; // 0xf8(0x08)
	struct FGameplayTag RechargeShieldAbilityTag; // 0x100(0x08)
	struct FGameplayTag BigRechargeShieldAbilityTag; // 0x108(0x08)
	struct FGameplayTag UpgradeShieldAbilityTag; // 0x110(0x08)
	struct FGameplayTag OpenTreasureBoxAbilityTag; // 0x118(0x08)
	struct FGameplayTag OpenNewTreasureBoxAbilityTag; // 0x120(0x08)
	struct FGameplayTag RepairVehicleAbilityTag; // 0x128(0x08)
	struct FGameplayTag RescueAbilityTag; // 0x130(0x08)
	struct FGameplayTag PickUpAbilityTag; // 0x138(0x08)
	struct FGameplayTag AutoPickUpAbilityTag; // 0x140(0x08)
	struct FGameplayTag ResurrectTeammateAbilityTag; // 0x148(0x08)
	struct FGameplayTag DeathVergeAbilityTag; // 0x150(0x08)
	struct FGameplayTag DeathAbilityTag; // 0x158(0x08)
	struct FGameplayTag RebirthAbilityTag; // 0x160(0x08)
	struct FGameplayTag ParkourMasterEffectTag; // 0x168(0x08)
	struct FGameplayTag HawkEyeEffectTag; // 0x170(0x08)
	struct FGameplayTag MassInvisibilityEffectTag; // 0x178(0x08)
	struct FGameplayTag RapidBoostEffectTag; // 0x180(0x08)
	struct FGameplayTag MainContinousTag; // 0x188(0x08)
	struct FGameplayTag SubContinousTag; // 0x190(0x08)
	struct FGameplayTag DurationPauseTag; // 0x198(0x08)
	struct FGameplayTag SuperSkillEffectTag; // 0x1a0(0x08)
	struct FGameplayTag TacticleSkillEffectTag; // 0x1a8(0x08)
	struct FGameplayTag SkydiveSoundTag; // 0x1b0(0x08)
	struct FGameplayTag CruisingStatusTag; // 0x1b8(0x08)
	struct FGameplayTag WalkingStatusTag; // 0x1c0(0x08)
	struct FGameplayTag FallingStatusTag; // 0x1c8(0x08)
	struct FGameplayTag FlyingStatusTag; // 0x1d0(0x08)
	struct FGameplayTag SwimmingStatusTag; // 0x1d8(0x08)
	struct FGameplayTag SkydivingStatusTag; // 0x1e0(0x08)
	struct FGameplayTag VaultingStatusTag; // 0x1e8(0x08)
	struct FGameplayTag VaultingAcceptCancelTag; // 0x1f0(0x08)
	struct FGameplayTag VaultingAcceptWeaponInputTag; // 0x1f8(0x08)
	struct FGameplayTag WallRunStatusTag; // 0x200(0x08)
	struct FGameplayTag WallRunAcceptCancelTag; // 0x208(0x08)
	struct FGameplayTag WallRunAcceptJumpTag; // 0x210(0x08)
	struct FGameplayTag WallRunAttemptVaultTag; // 0x218(0x08)
	struct FGameplayTag LaunchStatusTag; // 0x220(0x08)
	struct FGameplayTag RunningStatusTag; // 0x228(0x08)
	struct FGameplayTag SprintingStatusTag; // 0x230(0x08)
	struct FGameplayTag FollowViewRotationStatusTag; // 0x238(0x08)
	struct FGameplayTag PassiveMoveStatusTag; // 0x240(0x08)
	struct FGameplayTag MeleeAttackingStatusTag; // 0x248(0x08)
	struct FGameplayTag FullBodyMeleeStatusTag; // 0x250(0x08)
	struct FGameplayTag FiringStatusTag; // 0x258(0x08)
	struct FGameplayTag VehicleFiringStatusTag; // 0x260(0x08)
	struct FGameplayTag HiddenFireStatusTag; // 0x268(0x08)
	struct FGameplayTag BoltingStatusTag; // 0x270(0x08)
	struct FGameplayTag ReloadingStatusTag; // 0x278(0x08)
	struct FGameplayTag ScopeOpeningStatusTag; // 0x280(0x08)
	struct FGameplayTag EnteringScopeOpeningStatusTag; // 0x288(0x08)
	struct FGameplayTag FunctionalityStatusTag; // 0x290(0x08)
	struct FGameplayTag OpeningTreasureBoxStatusTag; // 0x298(0x08)
	struct FGameplayTag RechargingShieldStatusTag; // 0x2a0(0x08)
	struct FGameplayTag RescuingStatusTag; // 0x2a8(0x08)
	struct FGameplayTag TreatingStatusTag; // 0x2b0(0x08)
	struct FGameplayTag ReviveTeammateStatusTag; // 0x2b8(0x08)
	struct FGameplayTag InVehicleTag; // 0x2c0(0x08)
	struct FGameplayTag UsingContinuousSkill; // 0x2c8(0x08)
	struct FGameplayTag HoldingSkill; // 0x2d0(0x08)
	struct FGameplayTag AutoCancelOnInputReleased; // 0x2d8(0x08)
	struct FGameplayTag MassInvisibilityStatusTag; // 0x2e0(0x08)
	struct FGameplayTag MassInvisibilityPrepareStatusTag; // 0x2e8(0x08)
	struct FGameplayTag SuperRadarChooseStatusTag; // 0x2f0(0x08)
	struct FGameplayTag RadarScanningStatusTag; // 0x2f8(0x08)
	struct FGameplayTag EMPStatusTag; // 0x300(0x08)
	struct FGameplayTag FreezeStatusTag; // 0x308(0x08)
	struct FGameplayTag PerspectiveByRadarStatusTag; // 0x310(0x08)
	struct FGameplayTag InhibitDebuffStatusTag; // 0x318(0x08)
	struct FGameplayTag DeathVergeStatusTag; // 0x320(0x08)
	struct FGameplayTag DeathStatusTag; // 0x328(0x08)
	struct FGameplayTag InhibitOpenScopeStatusTag; // 0x330(0x08)
	struct FGameplayTag InhibitWeaponInputStatusTag; // 0x338(0x08)
	struct FGameplayTag InhibitWeaponFireInputStatusTag; // 0x340(0x08)
	struct FGameplayTag InhibitMoveStatusTag; // 0x348(0x08)
	struct FGameplayTag InhibitUnCrouchStatusTag; // 0x350(0x08)
	struct FGameplayTag InhibitAimOffsetStatusTag; // 0x358(0x08)
	struct FGameplayTag InhibitLeftHandWeaponAttachTag; // 0x360(0x08)
	struct FGameplayTag InhibitInteractionOption; // 0x368(0x08)
	struct FGameplayTag InhibitContinuousTreatStatusTag; // 0x370(0x08)
	struct FGameplayTag InhibitFireStatusTag; // 0x378(0x08)
	struct FGameplayTag VJetChargingStatusTag; // 0x380(0x08)
	struct FGameplayTag HJetChargingStatusTag; // 0x388(0x08)
	struct FGameplayTag GenericTalentActivationStatusTag; // 0x390(0x08)
	struct FGameplayTag TrackingMasterStatusTag; // 0x398(0x08)
	struct FGameplayTag ShieldMultiRecoverTag; // 0x3a0(0x08)
	struct FGameplayTag ShieldMultiRecoverOnGoingTag; // 0x3a8(0x08)
	struct FGameplayTag OpenAirDropTag; // 0x3b0(0x08)
	struct FGameplayTag ResurrectTeammateTag; // 0x3b8(0x08)
	struct FGameplayTag ReviveTeammateTag; // 0x3c0(0x08)
	struct FGameplayTag ReviveSelfTag; // 0x3c8(0x08)
	struct FGameplayTag HasRotationInputStatusTag; // 0x3d0(0x08)
	struct FGameplayTag InSmokeStatusTag; // 0x3d8(0x08)
	struct FGameplayTag StartCruiseEventTag; // 0x3e0(0x08)
	struct FGameplayTag IntoParachuteZoneEventTag; // 0x3e8(0x08)
	struct FGameplayTag ForceParachuteEventTag; // 0x3f0(0x08)
	struct FGameplayTag FinishCruiseEventTag; // 0x3f8(0x08)
	struct FGameplayTag LaunchEventTag; // 0x400(0x08)
	struct FGameplayTag VaultEventTag; // 0x408(0x08)
	struct FGameplayTag StepEventTag; // 0x410(0x08)
	struct FGameplayTag WallRunEventTag; // 0x418(0x08)
	struct FGameplayTag WallRunJumpEventTag; // 0x420(0x08)
	struct FGameplayTag HitRecoverEventTag; // 0x428(0x08)
	struct FGameplayTag MeleeAttackEventTag; // 0x430(0x08)
	struct FGameplayTag FireEventTag; // 0x438(0x08)
	struct FGameplayTag BoltEventTag; // 0x440(0x08)
	struct FGameplayTag EquipEventTag; // 0x448(0x08)
	struct FGameplayTag SwapEventTag; // 0x450(0x08)
	struct FGameplayTag ReloadEventTag; // 0x458(0x08)
	struct FGameplayTag VehicleReloadEventTag; // 0x460(0x08)
	struct FGameplayTag VehicleFireEventTag; // 0x468(0x08)
	struct FGameplayTag PickUpEventTag; // 0x470(0x08)
	struct FGameplayTag AutoPickUpEventTag; // 0x478(0x08)
	struct FGameplayTag RepairVehicleEventTag; // 0x480(0x08)
	struct FGameplayTag SpawnRadarEventTag; // 0x488(0x08)
	struct FGameplayTag DyingEventTag; // 0x490(0x08)
	struct FGameplayTag KillOrAssistEventTag; // 0x498(0x08)
	struct FGameplayTag GottenOnVehicleEventTag; // 0x4a0(0x08)
	struct FGameplayTag GottenOffVehicleEventTag; // 0x4a8(0x08)
	struct FGameplayTag VehicleForJetEventTag; // 0x4b0(0x08)
	struct FGameplayTag SideLeavingEventTag; // 0x4b8(0x08)
	struct FGameplayTag SideJoiningEventTag; // 0x4c0(0x08)
	struct FGameplayTag UltimateForbidenEventTag; // 0x4c8(0x08)
	struct FGameplayTag UltimateBlockEventTag; // 0x4d0(0x08)
	struct FGameplayTag UltimateForbidenStatusTag; // 0x4d8(0x08)
	struct FGameplayTag UltimateSkillBlockStatusTag; // 0x4e0(0x08)
	struct FGameplayTag SuperSkillCDReducedStatusTag; // 0x4e8(0x08)
	struct FGameplayTag TacticalForbidenEventTag; // 0x4f0(0x08)
	struct FGameplayTag TacticalBlockEventTag; // 0x4f8(0x08)
	struct FGameplayTag TacticalForbidenStatusTag; // 0x500(0x08)
	struct FGameplayTag TacticalSkillCDReducedStatusTag; // 0x508(0x08)
	struct FGameplayTag TacticalSkillBlockStatusTag; // 0x510(0x08)
	struct FGameplayTag BigWaterGunActivatingTag; // 0x518(0x08)
	struct FGameplayTag AirDropTag; // 0x520(0x08)
	struct FGameplayTag NightComesBuff; // 0x528(0x08)
	struct FGameplayTag NightComesActorContinous; // 0x530(0x08)
	struct FGameplayTag SuperRadarScanTag; // 0x538(0x08)
	struct FGameplayTag RadarScanningTag; // 0x540(0x08)
	struct FGameplayTag RoleAbilityRootTag; // 0x548(0x08)
	struct FGameplayTag RoleAbilityRootTypeTag; // 0x550(0x08)
	struct FGameplayTag SkillTypeTag; // 0x558(0x08)
	struct FGameplayTag SummonTypeTag; // 0x560(0x08)
	struct FGameplayTag ProjectileTypeTag; // 0x568(0x08)
	struct FGameplayTag SummonedJumpPadLaunchCooldownTag; // 0x570(0x08)
	struct FGameplayTag ShieldMultiRecoverCoolDownTag; // 0x578(0x08)
	struct FGameplayTag GenericTalentCooldownTag; // 0x580(0x08)
	struct FGameplayTag VJetCooldownTag; // 0x588(0x08)
	struct FGameplayTag HJetCooldownTag; // 0x590(0x08)
};

// Class Solarland.MaterialChangePriorityTags
// Size: 0x58 (Inherited: 0x30)
struct UMaterialChangePriorityTags : UDataAsset {
	struct FGameplayTag Default; // 0x30(0x08)
	struct FGameplayTag Radar; // 0x38(0x08)
	struct FGameplayTag Stealth; // 0x40(0x08)
	struct FGameplayTag WholeShield; // 0x48(0x08)
	struct FGameplayTag ThermalImaging; // 0x50(0x08)
};

// Class Solarland.VisibilityFlagTags
// Size: 0x70 (Inherited: 0x30)
struct UVisibilityFlagTags : UDataAsset {
	struct FGameplayTag Default; // 0x30(0x08)
	struct FGameplayTag Cruise; // 0x38(0x08)
	struct FGameplayTag Stealth; // 0x40(0x08)
	struct FGameplayTag CameraOverlap; // 0x48(0x08)
	struct FGameplayTag DissolvedDeath; // 0x50(0x08)
	struct FGameplayTag WholeShield; // 0x58(0x08)
	struct FGameplayTag MassInvisibility; // 0x60(0x08)
	struct FGameplayTag MassInvisibilityWarning; // 0x68(0x08)
};

// Class Solarland.CharacterMontageTags
// Size: 0x48 (Inherited: 0x30)
struct UCharacterMontageTags : UDataAsset {
	struct FGameplayTag TeamRescueMontageTag; // 0x30(0x08)
	struct FGameplayTag RechargeShieldTag; // 0x38(0x08)
	struct FGameplayTag UpgradeShieldTag; // 0x40(0x08)
};

// Class Solarland.CharacterGlobalConfig
// Size: 0x50 (Inherited: 0x30)
struct UCharacterGlobalConfig : UDataAsset {
	struct FGameplayCueTag TeamPerspectiveCueTag_LocalPlayer; // 0x30(0x08)
	struct FGameplayCueTag TeamPerspectiveCueTag_Teammate; // 0x38(0x08)
	struct TArray<struct UActorEffect*> PersistentActorEffectClasses; // 0x40(0x10)
};

// Class Solarland.CharacterMVPConfig
// Size: 0x60 (Inherited: 0x30)
struct UCharacterMVPConfig : UDataAsset {
	struct FSoftObjectPath AnimPath; // 0x30(0x18)
	struct FSoftObjectPath LevelPath; // 0x48(0x18)
};

// Class Solarland.CharacterSkillAttributeSet
// Size: 0xd0 (Inherited: 0x30)
struct UCharacterSkillAttributeSet : USolarAttributeSet {
	struct FGameplayAttributeData TacticalSkillCD; // 0x30(0x10)
	struct FGameplayAttributeData TacticalSkillCDBase; // 0x40(0x10)
	struct FGameplayAttributeData TacticalSkillCDParamA; // 0x50(0x10)
	struct FGameplayAttributeData TacticalSkillCDParamB; // 0x60(0x10)
	struct FGameplayAttributeData TacticalSkillCDFixedValue; // 0x70(0x10)
	struct FGameplayAttributeData SuperSkillCD; // 0x80(0x10)
	struct FGameplayAttributeData SuperSkillCDBase; // 0x90(0x10)
	struct FGameplayAttributeData SuperSkillCDParamA; // 0xa0(0x10)
	struct FGameplayAttributeData SuperSkillCDParamB; // 0xb0(0x10)
	struct FGameplayAttributeData SuperSkillCDFixedValue; // 0xc0(0x10)

	void OnRep_TacticalSkillCDParamB(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDParamB // (Native|Protected|HasOutParms) // @ game+0x1c5b480
	void OnRep_TacticalSkillCDParamA(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDParamA // (Native|Protected|HasOutParms) // @ game+0x1c3c9c0
	void OnRep_TacticalSkillCDFixedValue(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDFixedValue // (Native|Protected|HasOutParms) // @ game+0x1c5b280
	void OnRep_TacticalSkillCDBase(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_TacticalSkillCDBase // (Native|Protected|HasOutParms) // @ game+0x1c3ca70
	void OnRep_SuperSkillCDParamB(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDParamB // (Native|Protected|HasOutParms) // @ game+0x1c60450
	void OnRep_SuperSkillCDParamA(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDParamA // (Native|Protected|HasOutParms) // @ game+0x1c5b3d0
	void OnRep_SuperSkillCDFixedValue(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDFixedValue // (Native|Protected|HasOutParms) // @ game+0x1c603a0
	void OnRep_SuperSkillCDBase(struct FGameplayAttributeData& OldValue); // Function Solarland.CharacterSkillAttributeSet.OnRep_SuperSkillCDBase // (Native|Protected|HasOutParms) // @ game+0x1c5af50
};

// Class Solarland.CharacterSkinConfig
// Size: 0x1e0 (Inherited: 0x30)
struct UCharacterSkinConfig : UDataAsset {
	struct FSoftObjectPath SkinIcon; // 0x30(0x18)
	struct FSoftObjectPath DefaultIcon; // 0x48(0x18)
	struct FSoftObjectPath SkinRes; // 0x60(0x18)
	struct FSoftObjectPath CharaSkinRes; // 0x78(0x18)
	struct FSoftObjectPath ShieldRes; // 0x90(0x18)
	struct FSoftObjectPath InvincibleMAT; // 0xa8(0x18)
	struct FSoftClassPath AnimBPRes; // 0xc0(0x18)
	struct FSoftObjectPath OrnamentRes; // 0xd8(0x18)
	struct FSoftClassPath OrnamentABPRes; // 0xf0(0x18)
	struct FName OrnamentAttachSocket; // 0x108(0x08)
	struct FTransform OrnamentRelativeTransform; // 0x110(0x30)
	struct TMap<struct FGameplayTag, struct FStaticMeshOrnamentConfig> StaticMeshOrnamentsConfig; // 0x140(0x50)
	struct TMap<struct FGameplayTag, struct FSkeletalMeshOrnamentConfig> SkeletalMeshOrnamentsConfig; // 0x190(0x50)

	struct TMap<struct FGameplayTag, struct FStaticMeshOrnamentConfig> GetStaticMeshOrnamentsConfig(); // Function Solarland.CharacterSkinConfig.GetStaticMeshOrnamentsConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c60160
	struct FSoftObjectPath GetSkinRes(); // Function Solarland.CharacterSkinConfig.GetSkinRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1c60130
	struct FSoftObjectPath GetSkinIcon(); // Function Solarland.CharacterSkinConfig.GetSkinIcon // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1c60100
	struct TMap<struct FGameplayTag, struct FSkeletalMeshOrnamentConfig> GetSkeletalMeshOrnamentsConfig(); // Function Solarland.CharacterSkinConfig.GetSkeletalMeshOrnamentsConfig // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c60060
	struct FSoftObjectPath GetInvincibleMAT(); // Function Solarland.CharacterSkinConfig.GetInvincibleMAT // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1c60000
	struct FSoftObjectPath GetCharaSkinRes(); // Function Solarland.CharacterSkinConfig.GetCharaSkinRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1c5ffd0
	struct FSoftObjectPath GetAnimBPRes(); // Function Solarland.CharacterSkinConfig.GetAnimBPRes // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1c5ffa0
};

// Class Solarland.SoundGroupBase
// Size: 0x28 (Inherited: 0x28)
struct USoundGroupBase : UObject {
};

// Class Solarland.SoundGroupSimple
// Size: 0x38 (Inherited: 0x28)
struct USoundGroupSimple : USoundGroupBase {
	struct FString SoundEvent; // 0x28(0x10)
};

// Class Solarland.SoundGroupByTeammate
// Size: 0x58 (Inherited: 0x28)
struct USoundGroupByTeammate : USoundGroupBase {
	struct FString SelfEvent; // 0x28(0x10)
	struct FString TeammateEvent; // 0x38(0x10)
	struct FString OtherEvent; // 0x48(0x10)
};

// Class Solarland.SoundGroupByBattle
// Size: 0x58 (Inherited: 0x28)
struct USoundGroupByBattle : USoundGroupBase {
	struct FString IAttackOtherEvent; // 0x28(0x10)
	struct FString OtherAttackMeEvent; // 0x38(0x10)
	struct FString OtherEvent; // 0x48(0x10)
};

// Class Solarland.CharacterSoundConfig
// Size: 0x100 (Inherited: 0x30)
struct UCharacterSoundConfig : UDataAsset {
	struct TMap<enum class ECharacterSoundOpt, struct FString> SoundEventTable; // 0x30(0x50)
	struct TMap<struct FName, struct USoundGroupBase*> SoundGroupTable; // 0x80(0x50)
	struct FTransform DefaultTransform; // 0xd0(0x30)
};

// Class Solarland.CheckBoxGroup
// Size: 0x1c0 (Inherited: 0x160)
struct UCheckBoxGroup : UNamedSlot {
	struct FMulticastInlineDelegate OnStateChangedEvent; // 0x160(0x10)
	struct FMulticastInlineDelegate OnStateChangedEventEx; // 0x170(0x10)
	struct UCheckBox* RevertToCachedChild; // 0x180(0x08)
	struct UCheckBox* LastCheckedChild; // 0x188(0x08)
	struct UPanelWidget* GroupRoot; // 0x190(0x08)
	bool bAllowSwitchOff; // 0x198(0x01)
	enum class EUseType UseType; // 0x199(0x01)
	char pad_19A[0x6]; // 0x19a(0x06)
	struct TArray<struct UCheckBox*> CheckBoxList; // 0x1a0(0x10)
	char pad_1B0[0x10]; // 0x1b0(0x10)

	void SetSelectIndex(int32_t Index); // Function Solarland.CheckBoxGroup.SetSelectIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1c60760
	void RevertLastCheck(); // Function Solarland.CheckBoxGroup.RevertLastCheck // (Final|Native|Public|BlueprintCallable) // @ game+0x1c60740
	bool RemoveGroupChild(struct UCheckBox* Child); // Function Solarland.CheckBoxGroup.RemoveGroupChild // (Final|Native|Public|BlueprintCallable) // @ game+0x1c60590
	void OnStateChanged(bool bIsChecked); // Function Solarland.CheckBoxGroup.OnStateChanged // (Final|Native|Protected) // @ game+0x1c60500
	int32_t GetSelectedIndex(); // Function Solarland.CheckBoxGroup.GetSelectedIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x1c60030
	void CleanCheckedState(); // Function Solarland.CheckBoxGroup.CleanCheckedState // (Final|Native|Public|BlueprintCallable) // @ game+0x1c5ff80
	struct TArray<struct UCheckBox*> CheckChildrenState(int32_t& CheckedChildIndex); // Function Solarland.CheckBoxGroup.CheckChildrenState // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c5fea0
	bool AddGroupChild(struct UCheckBox* Child); // Function Solarland.CheckBoxGroup.AddGroupChild // (Final|Native|Public|BlueprintCallable) // @ game+0x1c5fe10
};

// Class Solarland.CommonTwiceConfirmBaseWidget
// Size: 0x340 (Inherited: 0x340)
struct UCommonTwiceConfirmBaseWidget : USolarUserWidget {
};

// Class Solarland.ComponentButtonBaseWidget
// Size: 0x348 (Inherited: 0x340)
struct UComponentButtonBaseWidget : USolarUserWidget {
	struct USolarButton* OperateArea; // 0x340(0x08)
};

// Class Solarland.CrashReportManager
// Size: 0x30 (Inherited: 0x28)
struct UCrashReportManager : UObject {
	char pad_28[0x8]; // 0x28(0x08)

	void SetUserId(struct FString& UserId); // Function Solarland.CrashReportManager.SetUserId // (Final|Native|Public|HasOutParms) // @ game+0xae7770
	void ReportLuaException(struct FString ErrorMsg, struct FString Traceback, bool bHandled); // Function Solarland.CrashReportManager.ReportLuaException // (Final|Native|Static|Public) // @ game+0x1c60620
};

// Class Solarland.CrosshairCanvasPanel
// Size: 0x228 (Inherited: 0x168)
struct UCrosshairCanvasPanel : UCanvasPanel {
	struct TMap<enum class ECrossHairState, struct FStateMapItemStruct> CrosshairStateConfigList; // 0x168(0x50)
	struct TArray<struct UWidget*> IgonreWidgetToStateMap; // 0x1b8(0x10)
	struct TArray<struct FUICrossHairSpreadStruct> SpreadItemList; // 0x1c8(0x10)
	struct TArray<struct FUICrossHairAimColorStruct> AimColorItemList; // 0x1d8(0x10)
	struct UTweenImage* ReloadingTween; // 0x1e8(0x08)
	struct UGaugeImage* BulletGauge; // 0x1f0(0x08)
	struct UTweenImage* OverloadingTween; // 0x1f8(0x08)
	struct UProgressBar* OverloadBar_Normal; // 0x200(0x08)
	struct UProgressBar* OverloadBar_Warn; // 0x208(0x08)
	struct UTweenWidget* OverloadNormalPanelTween; // 0x210(0x08)
	struct TArray<struct UProgressBar*> CoolDownBars; // 0x218(0x10)
};

// Class Solarland.CrossHairWidget
// Size: 0x300 (Inherited: 0x260)
struct UCrossHairWidget : UUserWidget {
	struct TMap<enum class EWeaponType, struct FCrosshairLayout> CrosshairStorageLayout; // 0x260(0x50)
	struct FCrosshairSprite CrosshairSprites; // 0x2b0(0x30)
	char pad_2E0[0x8]; // 0x2e0(0x08)
	struct UCrosshairCanvasPanel* RootPanel; // 0x2e8(0x08)
	float MinSpread; // 0x2f0(0x04)
	char pad_2F4[0x4]; // 0x2f4(0x04)
	struct FCrosshairLayout CurrentLayout; // 0x2f8(0x04)
	char pad_2FC[0x4]; // 0x2fc(0x04)

	void SetCrosshairSprite(struct UPaperSprite* InSprite); // Function Solarland.CrossHairWidget.SetCrosshairSprite // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnWeaponFired(); // Function Solarland.CrossHairWidget.OnWeaponFired // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnUpdateReloadProgress(float InReloadProgress, int32_t InMaxAmmo); // Function Solarland.CrossHairWidget.OnUpdateReloadProgress // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnUpdateGatlingRoll(float DeltaTmie, float InRollSpeedInterp, bool bWantFire); // Function Solarland.CrossHairWidget.OnUpdateGatlingRoll // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnUpdateCoolDownProgress(float InCoolDownProgress); // Function Solarland.CrossHairWidget.OnUpdateCoolDownProgress // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnUpdateChargeProgress(bool InbCharging, int32_t InChargeMode, float InChargeProgress, int32_t InChargeBurstCount); // Function Solarland.CrossHairWidget.OnUpdateChargeProgress // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnUpdateAimState(bool InbLockEnemy); // Function Solarland.CrossHairWidget.OnUpdateAimState // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnReloadStarted(float InReloadTime); // Function Solarland.CrossHairWidget.OnReloadStarted // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnReloadFinished(bool InbReloadSuccess, int32_t InReloadAmmo, int32_t InReservedAmmo, int32_t InMaxAmmo); // Function Solarland.CrossHairWidget.OnReloadFinished // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnPlayWeaponSpecialFire(enum class ECrossHairSpecialFireState InState, float PlayRate); // Function Solarland.CrossHairWidget.OnPlayWeaponSpecialFire // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnOverloadStateChanged(bool bEnter); // Function Solarland.CrossHairWidget.OnOverloadStateChanged // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnCrosshairInNormalState(); // Function Solarland.CrossHairWidget.OnCrosshairInNormalState // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void OnAmmoChanged(int32_t InReservedAmmo, int32_t InMaxAmmo, bool InbFirst); // Function Solarland.CrossHairWidget.OnAmmoChanged // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void InitializeCrosshairSpread(float Spread); // Function Solarland.CrossHairWidget.InitializeCrosshairSpread // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void InitializeCrosshair(enum class EWeaponType WeaponType, bool bIsWeaponEnergy); // Function Solarland.CrossHairWidget.InitializeCrosshair // (Final|Native|Public|BlueprintCallable) // @ game+0x1c64130
	void HandleCrosshairState(enum class ECrossHairState InCrosshairState, bool InbQuitState); // Function Solarland.CrossHairWidget.HandleCrosshairState // (Final|Native|Protected) // @ game+0x1c63f10
	struct UWidget* GetSpreadCanvasWidget(); // Function Solarland.CrossHairWidget.GetSpreadCanvasWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct UUserWidget* GetReloadWidget(); // Function Solarland.CrossHairWidget.GetReloadWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct UUserWidget* GetOverloadWidget(); // Function Solarland.CrossHairWidget.GetOverloadWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct UUserWidget* GetCoolDownWidget(); // Function Solarland.CrossHairWidget.GetCoolDownWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct UUserWidget* GetChargeWidget(); // Function Solarland.CrossHairWidget.GetChargeWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct UUserWidget* GetAmmoWidget(); // Function Solarland.CrossHairWidget.GetAmmoWidget // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	struct FVector2D CalcDeltaScaleBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaScaleBySpread // (Native|Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x1c63d50
	struct FVector2D CalcDeltaPosBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaPosBySpread // (Native|Event|Public|HasDefaults|BlueprintEvent|Const) // @ game+0x1c63cb0
	float CalcDeltaAngleBySpread(float Spread); // Function Solarland.CrossHairWidget.CalcDeltaAngleBySpread // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c63c20
};

// Class Solarland.CruiseAssetSet
// Size: 0x58 (Inherited: 0x30)
struct UCruiseAssetSet : UDataAsset {
	struct FSoftClassPath CapsuleActorClass; // 0x30(0x18)
	struct TArray<struct FSoftClassPath> CruiseAbilityClasses; // 0x48(0x10)
};

// Class Solarland.CustomConsoleCommandsComponent
// Size: 0xb0 (Inherited: 0xb0)
struct UCustomConsoleCommandsComponent : UActorComponent {

	void ExecGMCommand(struct FString CommandParameters, struct TArray<struct FString>& ArgsStr); // Function Solarland.CustomConsoleCommandsComponent.ExecGMCommand // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.CustomGameModeHUD
// Size: 0x380 (Inherited: 0x380)
struct ACustomGameModeHUD : ABattleHUDBase {

	struct TSoftObjectPtr<USolarUserWidget> ShowPanelUI(enum class EUIPanelName PanelName); // Function Solarland.CustomGameModeHUD.ShowPanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1c64cd0
	void ClosePanelUI(enum class EUIPanelName PanelName); // Function Solarland.CustomGameModeHUD.ClosePanelUI // (Final|Native|Public|BlueprintCallable) // @ game+0x1c63e90
};

// Class Solarland.CustomNoticeTable
// Size: 0xc8 (Inherited: 0xc8)
struct UCustomNoticeTable : UDataTable {
};

// Class Solarland.CustomNoticeImageTable
// Size: 0xc8 (Inherited: 0xc8)
struct UCustomNoticeImageTable : UDataTable {
};

// Class Solarland.GameManagerBase
// Size: 0x228 (Inherited: 0x228)
struct AGameManagerBase : AInfo {
};

// Class Solarland.CustomRoomManager
// Size: 0x310 (Inherited: 0x228)
struct ACustomRoomManager : AGameManagerBase {
	int32_t RoomTeamMemberLimit; // 0x228(0x04)
	int32_t RoomLeftTime; // 0x22c(0x04)
	bool bIsGameStarted; // 0x230(0x01)
	char pad_231[0xdf]; // 0x231(0xdf)

	void ReceiveTournamentDealy(); // Function Solarland.CustomRoomManager.ReceiveTournamentDealy // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x7e17a0
	void ReceivePlayerRemoved(struct ASCMPlayerState* Player, enum class ERemovedReasonType Reason); // Function Solarland.CustomRoomManager.ReceivePlayerRemoved // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1c64b80
	void OnTournamentDealy(); // Function Solarland.CustomRoomManager.OnTournamentDealy // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnRoomOwnerLeftRoom(); // Function Solarland.CustomRoomManager.OnRoomOwnerLeftRoom // (Final|Native|Public|BlueprintCallable) // @ game+0x1c645e0
	void OnPlayerRemovedFromRoom(struct ASCMPlayerState* Player, enum class ERemovedReasonType Reason); // Function Solarland.CustomRoomManager.OnPlayerRemovedFromRoom // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x224bbb0
	bool OnGameStart(); // Function Solarland.CustomRoomManager.OnGameStart // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnClientRoomDataReady(); // Function Solarland.CustomRoomManager.OnClientRoomDataReady // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x224bbb0
	bool IsRoomOwner(struct ASCMPlayerState* Player); // Function Solarland.CustomRoomManager.IsRoomOwner // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure) // @ game+0x1c64340
	bool IsRoomHasMinimalSides(); // Function Solarland.CustomRoomManager.IsRoomHasMinimalSides // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c64310
	bool IsRoomHasEnoughPlayers(); // Function Solarland.CustomRoomManager.IsRoomHasEnoughPlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c642e0
	void ExecuteGameStart(); // Function Solarland.CustomRoomManager.ExecuteGameStart // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1257850
};

// Class Solarland.DeathTreasureBox
// Size: 0x6e0 (Inherited: 0x598)
struct ADeathTreasureBox : ASolarTreasureBoxActor {
	float CharacterPickupRange; // 0x598(0x04)
	float CurrEnergyValue; // 0x59c(0x04)
	float CurrExtraEnergyValue; // 0x5a0(0x04)
	char pad_5A4[0x4]; // 0x5a4(0x04)
	struct FString PlayerId; // 0x5a8(0x10)
	struct FString NickName; // 0x5b8(0x10)
	bool IsPickuped; // 0x5c8(0x01)
	char pad_5C9[0x7]; // 0x5c9(0x07)
	struct TArray<struct ASolarPlayerWeapon*> WeaponList; // 0x5d0(0x10)
	struct TArray<struct FBoxChargingInfo> ChargingChars; // 0x5e0(0x10)
	float ResurrectDistance; // 0x5f0(0x04)
	enum class EBResurrectionState CurrResurrectionState; // 0x5f4(0x01)
	char pad_5F5[0x3]; // 0x5f5(0x03)
	float ReviveTotalTime; // 0x5f8(0x04)
	float ReviveStartTime; // 0x5fc(0x04)
	struct USkeletalMeshComponent* PreViewMesh; // 0x600(0x08)
	struct FName ReviveStartSound; // 0x608(0x08)
	struct FName ReviveBeforeCompleteSound; // 0x610(0x08)
	struct FName ReviveCompleteSound; // 0x618(0x08)
	struct FName ReviveFailedSound; // 0x620(0x08)
	float ResurrectionBeforeSoundTime; // 0x628(0x04)
	char pad_62C[0x4]; // 0x62c(0x04)
	struct UParticleSystem* ReviveCompletePS; // 0x630(0x08)
	struct FName ReviveCompletePSAttachedSocket; // 0x638(0x08)
	float PreviewMeshZOffset; // 0x640(0x04)
	float PreviewMeshZRotation; // 0x644(0x04)
	char pad_648[0x10]; // 0x648(0x10)
	struct USceneComponent* FXPosComponent; // 0x658(0x08)
	struct TArray<struct TSoftObjectPtr<UParticleSystem>> QualityPS; // 0x660(0x10)
	char pad_670[0x10]; // 0x670(0x10)
	struct UActorEffect* RevivePreviewEffectClass; // 0x680(0x08)
	char pad_688[0x8]; // 0x688(0x08)
	struct TMap<enum class ECharacterBodyScaleType, struct FSoftObjectPath> PreviewAnim; // 0x690(0x50)

	void ReceiveSetUIEnable(bool IsShow); // Function Solarland.DeathTreasureBox.ReceiveSetUIEnable // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveRemoveEffect(struct ASolarCharacter* SolarChar); // Function Solarland.DeathTreasureBox.ReceiveRemoveEffect // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveRefreshExtraEnergy(struct FString Message); // Function Solarland.DeathTreasureBox.ReceiveRefreshExtraEnergy // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void ReceiveAddEffect(struct ASolarCharacter* SolarChar); // Function Solarland.DeathTreasureBox.ReceiveAddEffect // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnUntrigger(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Solarland.DeathTreasureBox.OnUntrigger // (Final|Native|Protected) // @ game+0x1c64a40
	void OnTrigger(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult); // Function Solarland.DeathTreasureBox.OnTrigger // (Final|Native|Protected|HasOutParms) // @ game+0x1c64830
	void OnRep_ReviveStartTime(); // Function Solarland.DeathTreasureBox.OnRep_ReviveStartTime // (Final|Native|Protected) // @ game+0x1c645c0
	void OnRep_PickupedChanged(); // Function Solarland.DeathTreasureBox.OnRep_PickupedChanged // (Final|Native|Public) // @ game+0x1c645a0
	void OnRep_CurrExtraEnergyValueChanged(); // Function Solarland.DeathTreasureBox.OnRep_CurrExtraEnergyValueChanged // (Final|Native|Public) // @ game+0x1c64580
	void OnRep_BResurrectionStateChanged(); // Function Solarland.DeathTreasureBox.OnRep_BResurrectionStateChanged // (Final|Native|Public) // @ game+0x1c64560
	void OnRefreshPickupStatusEffect(bool IsShow); // Function Solarland.DeathTreasureBox.OnRefreshPickupStatusEffect // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	bool IsInResurrectRange(struct ASolarCharacter* InReqCharacter, float& RealDistance); // Function Solarland.DeathTreasureBox.IsInResurrectRange // (Final|Native|Public|HasOutParms) // @ game+0x1c64200
	bool CanBuyResurrect(struct ASolarCharacter* InReqCharacter); // Function Solarland.DeathTreasureBox.CanBuyResurrect // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x1c63df0
};

// Class Solarland.DeathViewGoodsSlotWidget
// Size: 0x3f0 (Inherited: 0x340)
struct UDeathViewGoodsSlotWidget : USolarUserWidget {
	struct UImage* Img_Icon; // 0x340(0x08)
	struct UTextBlock* Txt_Num; // 0x348(0x08)
	struct FSlateBrush ImageOuter; // 0x350(0x98)
	int32_t ItemID; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)

	void OnSpectateTargetItemsChanged(struct TArray<struct FReplicateItemData> InItemDatas); // Function Solarland.DeathViewGoodsSlotWidget.OnSpectateTargetItemsChanged // (Final|Native|Protected) // @ game+0x1c64740
};

// Class Solarland.DeathViewHPWidget
// Size: 0x3e0 (Inherited: 0x340)
struct UDeathViewHPWidget : USolarUserWidget {
	char pad_340[0x38]; // 0x340(0x38)
	bool bSplitHPBar; // 0x378(0x01)
	char pad_379[0x7]; // 0x379(0x07)
	struct USolarShieldProgressBoard* AdvBar_Shield; // 0x380(0x08)
	struct USolarHPProgressBoard* AdvBar_HP; // 0x388(0x08)
	char pad_390[0x20]; // 0x390(0x20)
	struct FLinearColor HPColorNormal; // 0x3b0(0x10)
	struct FLinearColor HPColorDying; // 0x3c0(0x10)
	char pad_3D0[0x10]; // 0x3d0(0x10)

	void UpdateShieldValue(enum class EShieldWidgetState WidgetState, float InCurValue, float InChangeValue, enum class EShieldRechargeState RechargeState, bool bFixPreAdd); // Function Solarland.DeathViewHPWidget.UpdateShieldValue // (Final|Native|Public) // @ game+0x1c64f80
	void UpdateHPColor(enum class ERescueState InRescueState); // Function Solarland.DeathViewHPWidget.UpdateHPColor // (Final|Native|Public) // @ game+0x1c64f00
	void UpdateHPBar(float InCurHealth, float InMaxHealth); // Function Solarland.DeathViewHPWidget.UpdateHPBar // (Final|Native|Public) // @ game+0x1c64e40
	void ShowShieldUI(bool bIsShow); // Function Solarland.DeathViewHPWidget.ShowShieldUI // (Final|Native|Public) // @ game+0x1c64d90
	void OnSpecTargetChanged(struct ASolarPlayerState* OldTarget, struct ASolarPlayerState* NewTarget); // Function Solarland.DeathViewHPWidget.OnSpecTargetChanged // (Final|Native|Private) // @ game+0x1c64680
	void OnCharacterEndPlay(struct ASolarCharacter* Character); // Function Solarland.DeathViewHPWidget.OnCharacterEndPlay // (Final|Native|Private) // @ game+0x1c643e0
	void InitShieldHUD(float InCurValue, float InMaxValue, int32_t QualityColor, bool bIsAdvancedShield); // Function Solarland.DeathViewHPWidget.InitShieldHUD // (Final|Native|Public) // @ game+0x1c63fe0
};

// Class Solarland.DeathViewTeammateWidget
// Size: 0x3b0 (Inherited: 0x340)
struct UDeathViewTeammateWidget : USolarUserWidget {
	float SwitchCDTime; // 0x340(0x04)
	char pad_344[0x4]; // 0x344(0x04)
	struct UUIComponentNationalFlag* UI_Component_NationalFlag; // 0x348(0x08)
	struct UTextBlock* Txt_PlayerName; // 0x350(0x08)
	struct UImage* Img_View_Name_Bg; // 0x358(0x08)
	struct UImage* Img_TeamPos; // 0x360(0x08)
	struct UImage* Img_View_TeamPos_Bg; // 0x368(0x08)
	struct USizeBox* Panel_TeamPos; // 0x370(0x08)
	struct UOverlay* Panel_Death; // 0x378(0x08)
	struct UOverlay* Panel_Selected; // 0x380(0x08)
	struct UImage* Img_Loading; // 0x388(0x08)
	struct UWidget* ScaleBox_1; // 0x390(0x08)
	struct UWidgetAnimation* Sel_Anim; // 0x398(0x08)
	char pad_3A0[0x8]; // 0x3a0(0x08)
	struct ASolarPlayerState* CurrentPlayerState; // 0x3a8(0x08)

	void TrySelect(); // Function Solarland.DeathViewTeammateWidget.TrySelect // (Final|Native|Private) // @ game+0x1c64e20
	void SetTeamPos(int32_t PosInTeam); // Function Solarland.DeathViewTeammateWidget.SetTeamPos // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void SetPlayerState(struct ASolarPlayerState* TargetPS); // Function Solarland.DeathViewTeammateWidget.SetPlayerState // (Final|Native|Public|BlueprintCallable) // @ game+0x1c64c50
	void OnSelectedPlayerChanged(struct ASolarPlayerState* SelectedPS); // Function Solarland.DeathViewTeammateWidget.OnSelectedPlayerChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1c64600
	void OnHPChanged(char PosInTeam, float CurHP, float MaxHP); // Function Solarland.DeathViewTeammateWidget.OnHPChanged // (Final|Native|Private) // @ game+0x1c64460
};

// Class Solarland.DeathViewWidget
// Size: 0x378 (Inherited: 0x340)
struct UDeathViewWidget : USolarUserWidget {
	char pad_340[0x8]; // 0x340(0x08)
	struct UDeathViewHPWidget* DeathViewHP; // 0x348(0x08)
	struct UCanvasPanel* Panel_ScopeUI; // 0x350(0x08)
	struct USolarTextBlock* Text_PlayerLevel; // 0x358(0x08)
	struct USolarTextBlock* Txt_Lv_Head; // 0x360(0x08)
	struct UImage* Img_Lv_Bg_2; // 0x368(0x08)
	struct UImage* Img_Lv_Border_2; // 0x370(0x08)

	void OnSpecTargetChanged(struct ASolarSpectateInfo* SpectateInfo); // Function Solarland.DeathViewWidget.OnSpecTargetChanged // (Final|Native|Private) // @ game+0x1c685b0
	void OnLocalSpecInfoReady(struct ASolarSpectateInfo* SpecInfo); // Function Solarland.DeathViewWidget.OnLocalSpecInfoReady // (Final|Native|Private) // @ game+0x1c68510
	void OnCharacterLevelUp(int32_t InLevel, int32_t InOldLevel, struct FString DynamicTip); // Function Solarland.DeathViewWidget.OnCharacterLevelUp // (Final|Native|Private) // @ game+0x1c683e0
	void AddScopeToPanel(struct UUserWidget* InChildWidget, bool bInSpectate); // Function Solarland.DeathViewWidget.AddScopeToPanel // (Final|Native|Private) // @ game+0x1c67c20
};

// Class Solarland.DebugReplicator
// Size: 0x228 (Inherited: 0x228)
struct ADebugReplicator : AActor {
};

// Class Solarland.DebugReplicatorCharacter
// Size: 0x240 (Inherited: 0x228)
struct ADebugReplicatorCharacter : ADebugReplicator {
	int32_t aiCharacterID; // 0x228(0x04)
	char pad_22C[0x4]; // 0x22c(0x04)
	struct FString BotAIDebugInfo; // 0x230(0x10)
};

// Class Solarland.DefenderManager
// Size: 0x2b8 (Inherited: 0x228)
struct ADefenderManager : AGameManagerBase {
	struct FMulticastInlineDelegate OnRepDefenderListNotify; // 0x228(0x10)
	struct FTerminatorNotifyUIConfig TerminatorNotifyUIConfig; // 0x238(0x28)
	struct ASolarTrailEffect* TrailEffect; // 0x260(0x08)
	struct FString DefenderSide; // 0x268(0x10)
	struct TArray<struct ASCMPlayerState*> DefenderList; // 0x278(0x10)
	char pad_288[0x8]; // 0x288(0x08)
	struct FString TerminatorPlayerId; // 0x290(0x10)
	char pad_2A0[0x18]; // 0x2a0(0x18)

	bool UpdateCheckTerminator(struct ASCMPlayerState* InKiller, struct ASCMPlayerState* InKilled); // Function Solarland.DefenderManager.UpdateCheckTerminator // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c68f30
	void StartConfirmDefender(); // Function Solarland.DefenderManager.StartConfirmDefender // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c68f10
	void ShowDefenderUIForReplay(); // Function Solarland.DefenderManager.ShowDefenderUIForReplay // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnRep_DefenderList(); // Function Solarland.DefenderManager.OnRep_DefenderList // (Final|Native|Public) // @ game+0x1c68590
	bool IsTerminator(struct FString InSolarPlayerID); // Function Solarland.DefenderManager.IsTerminator // (Final|Native|Public|BlueprintCallable) // @ game+0x1c68330
	bool IsDefender(struct FString InPlayerSide); // Function Solarland.DefenderManager.IsDefender // (Final|Native|Public|BlueprintCallable) // @ game+0x1c68280
	struct TArray<struct ASCMPlayerState*> GetDefenderList(); // Function Solarland.DefenderManager.GetDefenderList // (Final|Native|Public|BlueprintCallable) // @ game+0x1c67d90
};

// Class Solarland.DelayNode
// Size: 0x80 (Inherited: 0x70)
struct UDelayNode : UActionNode {
	float DelayTime; // 0x70(0x04)
	char pad_74[0xc]; // 0x74(0x0c)
};

// Class Solarland.DrawLinePanel
// Size: 0x448 (Inherited: 0x340)
struct UDrawLinePanel : USolarUserWidget {
	float MapSize; // 0x340(0x04)
	float CurrentFOV; // 0x344(0x04)
	struct FLinearColor SafeAreaColor; // 0x348(0x10)
	struct FLinearColor PosionCircleColor; // 0x358(0x10)
	struct FLinearColor DotLineColor; // 0x368(0x10)
	struct FLinearColor AirlineProgressColor; // 0x378(0x10)
	struct FLinearColor CapsuleBackgroundColor; // 0x388(0x10)
	struct FLinearColor AirdropBackgroundColor; // 0x398(0x10)
	float AirdropAirlineSizeY; // 0x3a8(0x04)
	float MaterialCircleSize; // 0x3ac(0x04)
	float DotLineDottedLength; // 0x3b0(0x04)
	float DotLineDottedInterval; // 0x3b4(0x04)
	char pad_3B8[0x8]; // 0x3b8(0x08)
	struct TArray<struct FDotLineData> DotLineDataList; // 0x3c0(0x10)
	struct TArray<struct FCircleData> CircleDataList; // 0x3d0(0x10)
	struct USolarMapManager* MapManager; // 0x3e0(0x08)
	struct TWeakObjectPtr<struct ASolarCapsuleRoot> CapsuleRoot; // 0x3e8(0x08)
	struct FSoftObjectPath CircleMaterialPath; // 0x3f0(0x18)
	struct FSoftObjectPath DottedLineMaterialPath; // 0x408(0x18)
	struct TArray<struct UMaterialInstanceDynamic*> CircleMaterialInstanceArray; // 0x420(0x10)
	struct TArray<struct UMaterialInstanceDynamic*> DottedLineMaterialInstanceArray; // 0x430(0x10)
	float InitFOV; // 0x440(0x04)
	char pad_444[0x4]; // 0x444(0x04)

	void RemoveDotLine(int32_t DotLineID); // Function Solarland.DrawLinePanel.RemoveDotLine // (Final|Native|Public|BlueprintCallable) // @ game+0x1c689f0
	void RemoveCircle(int32_t CircleID); // Function Solarland.DrawLinePanel.RemoveCircle // (Final|Native|Public|BlueprintCallable) // @ game+0x1c68970
	void InitializePanelFOV(float InFOV); // Function Solarland.DrawLinePanel.InitializePanelFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x1c681f0
	int32_t AddDotLine(struct AActor* StartPointActor, struct AActor* EndPointActor, struct FLinearColor Color); // Function Solarland.DrawLinePanel.AddDotLine // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1c67b10
	int32_t AddCircle(struct FVector2D Center, float Radius, struct FLinearColor Color); // Function Solarland.DrawLinePanel.AddCircle // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1c67a00
};

// Class Solarland.DurationTalent
// Size: 0x450 (Inherited: 0x420)
struct UDurationTalent : UCharacterTalent {
	struct UGameplayEffect* DurationEffectClass; // 0x420(0x08)
	struct TArray<struct UGameplayEffect*> DurationSubEffectClasses; // 0x428(0x10)
	char pad_438[0x18]; // 0x438(0x18)

	void StartDurationEffectFailed(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.DurationTalent.StartDurationEffectFailed // (Final|Native|Protected|HasOutParms) // @ game+0x1c515e0
	void ReceiveDurationEffectFinished(struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo); // Function Solarland.DurationTalent.ReceiveDurationEffectFinished // (Final|Native|Protected|HasOutParms) // @ game+0x1c68810
};

// Class Solarland.ElectricShop_Weapon
// Size: 0x4d8 (Inherited: 0x340)
struct UElectricShop_Weapon : USolarUserWidget {
	struct FMulticastInlineDelegate OnWeaponUpdateRequested; // 0x340(0x10)
	struct FMulticastInlineDelegate OnShieldUpdateRequested; // 0x350(0x10)
	struct UWidgetSwitcher* WidgetSwitcher_weapon; // 0x360(0x08)
	struct UCanvasPanel* Weapon; // 0x368(0x08)
	struct UImage* Img_Level_Bg; // 0x370(0x08)
	struct UOverlay* Level_Indicator; // 0x378(0x08)
	struct UHorizontalBox* Panel_Level; // 0x380(0x08)
	struct UTextBlock* Txt_Level; // 0x388(0x08)
	struct UImage* Img_Arrow; // 0x390(0x08)
	struct USolarTextBlock* Txt_Max; // 0x398(0x08)
	struct USolarImage* Img_Weapon; // 0x3a0(0x08)
	struct UImage* Img_Shield; // 0x3a8(0x08)
	struct UWidgetSwitcher* WidgetSwitcher_Upgrade; // 0x3b0(0x08)
	struct USolarImage* Upgrade_BG; // 0x3b8(0x08)
	struct USolarTextBlock* Txt_UpgradeState; // 0x3c0(0x08)
	struct UHorizontalBox* Panel_ElectricCost; // 0x3c8(0x08)
	struct UOverlay* Overlay_Discount; // 0x3d0(0x08)
	struct UTextBlock* Txt_ElectricityNum_Undiscounted; // 0x3d8(0x08)
	struct UTextBlock* Txt_ElectricityNum; // 0x3e0(0x08)
	struct USolarTextBlock* Txt_UpgradeState_Disable; // 0x3e8(0x08)
	struct UHorizontalBox* Panel_ElectricCost_Disable; // 0x3f0(0x08)
	struct UOverlay* Overlay_Discount_2; // 0x3f8(0x08)
	struct UTextBlock* Txt_ElectricityNum_Undiscounted_2; // 0x400(0x08)
	struct UTextBlock* Txt_ElectricityNum_Disable; // 0x408(0x08)
	struct USolarTextBlock* Txt_UpgradeState_Disable_2; // 0x410(0x08)
	struct UCanvasPanel* Weapon_UpgradeSuccess; // 0x418(0x08)
	struct UImage* Image_BG2_3; // 0x420(0x08)
	struct USolarTextBlock* Txt_Upgrade2; // 0x428(0x08)
	struct UCanvasPanel* Weapon_None; // 0x430(0x08)
	struct UImage* Image_BG2; // 0x438(0x08)
	struct UImage* Image_BG2_2; // 0x440(0x08)
	struct UWidgetAnimation* Succeed_Anim; // 0x448(0x08)
	bool bIsWeapon; // 0x450(0x01)
	char pad_451[0x17]; // 0x451(0x17)
	int32_t MaxWeaponLevel; // 0x468(0x04)
	char pad_46C[0x34]; // 0x46c(0x34)
	struct TArray<struct FString> WeaponLevelBGNames; // 0x4a0(0x10)
	struct FString WeaponLevelBGPrefix; // 0x4b0(0x10)
	struct FString ShieldIconPrefix; // 0x4c0(0x10)
	struct TWeakObjectPtr<struct ASolarPlayerWeapon> CurrentWeapon; // 0x4d0(0x08)

	void UpdateUpgradeData(struct ASolarPlayerWeapon* InWeapon, float Discount); // Function Solarland.ElectricShop_Weapon.UpdateUpgradeData // (Final|Native|Public) // @ game+0x1c691e0
	void UpdateShieldUpgradeData(float Discount); // Function Solarland.ElectricShop_Weapon.UpdateShieldUpgradeData // (Final|Native|Public) // @ game+0x1c69160
	void ShowUpgradeEffect(); // Function Solarland.ElectricShop_Weapon.ShowUpgradeEffect // (Final|Native|Protected) // @ game+0x1c68ef0
	void SetWeaponWidgetSwitcherIndex(int32_t InNewIndex); // Function Solarland.ElectricShop_Weapon.SetWeaponWidgetSwitcherIndex // (Final|Native|Public) // @ game+0x1c68ca0
	void SetUpgradeState(); // Function Solarland.ElectricShop_Weapon.SetUpgradeState // (Final|Native|Protected) // @ game+0x1c68c80
	void SetUpgradeIndicator(); // Function Solarland.ElectricShop_Weapon.SetUpgradeIndicator // (Final|Native|Protected) // @ game+0x1c68c60
	void SetIndicatorVisibility(enum class EShopWeaponUpgradeState InState); // Function Solarland.ElectricShop_Weapon.SetIndicatorVisibility // (Final|Native|Protected) // @ game+0x1c68b50
	void SetElectricCostState(enum class EShopWeaponUpgradeState InState); // Function Solarland.ElectricShop_Weapon.SetElectricCostState // (Final|Native|Protected) // @ game+0x1c68ad0
	void RequestUpgradeWeapon(); // Function Solarland.ElectricShop_Weapon.RequestUpgradeWeapon // (Final|Native|Protected) // @ game+0x1c68a90
	void RequestUpgradeShield(); // Function Solarland.ElectricShop_Weapon.RequestUpgradeShield // (Final|Native|Protected) // @ game+0x1c68a70
	void RefreshCurrentShieldProperty(int32_t InShieldID); // Function Solarland.ElectricShop_Weapon.RefreshCurrentShieldProperty // (Final|Native|Protected) // @ game+0x1c688f0
	void OnWeaponUpdateRequested__DelegateSignature(struct ASolarPlayerWeapon* Weapon); // DelegateFunction Solarland.ElectricShop_Weapon.OnWeaponUpdateRequested__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x224bbb0
	void OnUpgradeWeaponSuccess(struct ASolarPlayerWeapon* InWeapon, struct ASolarCharacter* InCharacter); // Function Solarland.ElectricShop_Weapon.OnUpgradeWeaponSuccess // (Final|Native|Protected) // @ game+0x1c686d0
	void OnUpgradeShieldSuccess(struct ASolarCharacter* InCharacter); // Function Solarland.ElectricShop_Weapon.OnUpgradeShieldSuccess // (Final|Native|Protected) // @ game+0x1c68650
	void OnUpgradeCooldown(); // Function Solarland.ElectricShop_Weapon.OnUpgradeCooldown // (Final|Native|Protected) // @ game+0x1c68630
	void OnShieldUpdateRequested__DelegateSignature(struct ASolarCharacter* ShieldCharacter); // DelegateFunction Solarland.ElectricShop_Weapon.OnShieldUpdateRequested__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x224bbb0
	void InitWeaponUpgradeCost(); // Function Solarland.ElectricShop_Weapon.InitWeaponUpgradeCost // (Final|Native|Protected) // @ game+0x8ba190
	void HideUpgradeEffect(); // Function Solarland.ElectricShop_Weapon.HideUpgradeEffect // (Final|Native|Protected) // @ game+0x1c681d0
	float GetWeaponUpgradeCost(int32_t InWeaponLevel); // Function Solarland.ElectricShop_Weapon.GetWeaponUpgradeCost // (Final|Native|Protected) // @ game+0x1c68140
	struct FString GetWeaponLvBgFullPath(int32_t WeaponLv); // Function Solarland.ElectricShop_Weapon.GetWeaponLvBgFullPath // (Final|Native|Protected) // @ game+0x1c68070
	struct FString GetShieldLvBgFullPath(int32_t ShieldLv); // Function Solarland.ElectricShop_Weapon.GetShieldLvBgFullPath // (Final|Native|Protected) // @ game+0x1c68070
	float GetDiscountedCost(float Cost); // Function Solarland.ElectricShop_Weapon.GetDiscountedCost // (Final|Native|Protected) // @ game+0x1c67e20
	void CheckEnergyAvaliable(float InValue); // Function Solarland.ElectricShop_Weapon.CheckEnergyAvaliable // (Final|Native|Public) // @ game+0x1c67d10
	void BindDelegates(); // Function Solarland.ElectricShop_Weapon.BindDelegates // (Final|Native|Protected) // @ game+0x1c67cf0
};

// Class Solarland.ElectronicTreasureBox
// Size: 0x5d8 (Inherited: 0x598)
struct AElectronicTreasureBox : ASolarTreasureBoxActor {
	struct FString OnFinishSpawnLoopAudio; // 0x598(0x10)
	struct FString OnStopLoopAudio; // 0x5a8(0x10)
	struct FString OnOpenAudio; // 0x5b8(0x10)
	struct FSpawnedActorHandle CachedActorHandle; // 0x5c8(0x04)
	char pad_5CC[0xc]; // 0x5cc(0x0c)
};

// Class Solarland.EmojiBubbleSubsystem
// Size: 0x48 (Inherited: 0x30)
struct UEmojiBubbleSubsystem : UGameInstanceSubsystem {
	char pad_30[0x10]; // 0x30(0x10)
	struct UDataTable* EmojiTable; // 0x40(0x08)

	void ShowEmojiBubbleToContainerInLobby(int32_t EmojiID, struct ASolarLobbyCharacter* InLobbyCharacter, struct FString PlayerId); // Function Solarland.EmojiBubbleSubsystem.ShowEmojiBubbleToContainerInLobby // (Final|Native|Public) // @ game+0x1c68de0
	void ShowEmojiBubbleToContainer(int32_t EmojiID, struct ASolarCharacter* InCharacter); // Function Solarland.EmojiBubbleSubsystem.ShowEmojiBubbleToContainer // (Final|Native|Public) // @ game+0x1c68d20
	void ResetAllEmojiBubble(); // Function Solarland.EmojiBubbleSubsystem.ResetAllEmojiBubble // (Final|Native|Public) // @ game+0x1c68ab0
	bool GetEmojiConfigByID(int32_t EmojiID, struct FEmojiBubbleConfig& OutConfig); // Function Solarland.EmojiBubbleSubsystem.GetEmojiConfigByID // (Final|Native|Public|HasOutParms) // @ game+0x1c67eb0
};

// Class Solarland.EmojiBubbleWidget
// Size: 0x588 (Inherited: 0x340)
struct UEmojiBubbleWidget : USolarUserWidget {
	char pad_340[0x10]; // 0x340(0x10)
	float ShowTime; // 0x350(0x04)
	char pad_354[0x34]; // 0x354(0x34)
	struct UWidgetAnimation* EmojiBegin_Anim; // 0x388(0x08)
	struct UWidgetAnimation* EmojiEnd_Anim; // 0x390(0x08)
	struct UImage* Img_Emoji; // 0x398(0x08)
	bool IsSpecialEmoji; // 0x3a0(0x01)
	char pad_3A1[0x3]; // 0x3a1(0x03)
	int32_t EmojiOffsetInLobby; // 0x3a4(0x04)
	struct FVector2D LobbyEmojiSize; // 0x3a8(0x08)
	struct FRuntimeFloatCurve EmojiSizeCurve; // 0x3b0(0x88)
	struct FRuntimeFloatCurve EnemyEmojiSizeCurve; // 0x438(0x88)
	int32_t TeamMateEmojiOffset; // 0x4c0(0x04)
	int32_t SelfEmojiOffset; // 0x4c4(0x04)
	struct TArray<enum class EUsePlayerType> EmoteAppearSoundConfig; // 0x4c8(0x10)
	struct TArray<enum class EUsePlayerType> EmoteSoundConfig; // 0x4d8(0x10)
	char pad_4E8[0xa0]; // 0x4e8(0xa0)

	void UpdateEmojiContent(int32_t EmojiID); // Function Solarland.EmojiBubbleWidget.UpdateEmojiContent // (Final|Native|Public) // @ game+0x1c690e0
	void SetIsInLobbyTeam(bool IsInLobbyTeam); // Function Solarland.EmojiBubbleWidget.SetIsInLobbyTeam // (Final|Native|Public) // @ game+0x1c68bd0
	void OnEndAnimationFinished(); // Function Solarland.EmojiBubbleWidget.OnEndAnimationFinished // (Final|Native|Public) // @ game+0x1c684f0
};

// Class Solarland.EShopGoodsObject
// Size: 0x50 (Inherited: 0x28)
struct UEShopGoodsObject : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	int32_t ProductID; // 0x30(0x04)
	int32_t ItemID; // 0x34(0x04)
	int32_t Price; // 0x38(0x04)
	int32_t Num; // 0x3c(0x04)
	float CoolDown; // 0x40(0x04)
	int32_t Generation; // 0x44(0x04)
	bool bIsRecommend; // 0x48(0x01)
	char pad_49[0x7]; // 0x49(0x07)

	void UpdateData(struct FElectricShopItem& InItemData, bool InRecommend); // Function Solarland.EShopGoodsObject.UpdateData // (Final|Native|Public|HasOutParms) // @ game+0x1c68ff0
};

// Class Solarland.EventAction
// Size: 0x80 (Inherited: 0x70)
struct UEventAction : UActionNode {
	char pad_70[0x10]; // 0x70(0x10)
};

// Class Solarland.ExpWidget
// Size: 0x358 (Inherited: 0x340)
struct UExpWidget : USolarUserWidget {
	int32_t LocalTextIndex; // 0x340(0x04)
	char pad_344[0x4]; // 0x344(0x04)
	struct USolarTextBlock* SolarText_WP_Exp; // 0x348(0x08)
	struct UWidgetAnimation* Exp_Anim; // 0x350(0x08)

	void PlayGetEXPAnimation(int32_t InExp); // Function Solarland.ExpWidget.PlayGetEXPAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x1c68790
	struct FString GetExpDisplayStringWithValue(int32_t Value); // Function Solarland.ExpWidget.GetExpDisplayStringWithValue // (Final|Native|Public|BlueprintCallable) // @ game+0x1c67fa0
};

// Class Solarland.FeedbackCanvasPanel
// Size: 0x1b8 (Inherited: 0x168)
struct UFeedbackCanvasPanel : UCanvasPanel {
	struct TMap<struct FString, struct FFeedbackSingleData> FeedbackMap; // 0x168(0x50)
};

// Class Solarland.FeedbackWidget
// Size: 0x2a0 (Inherited: 0x260)
struct UFeedbackWidget : UUserWidget {
	struct UFeedbackCanvasPanel* FeedbackPanel; // 0x260(0x08)
	float VisibilityTime; // 0x268(0x04)
	float VisibilityTimer; // 0x26c(0x04)
	struct FFeedbackSingleData CurrentFeedbackSingleData; // 0x270(0x30)
};

// Class Solarland.FireInputWidget
// Size: 0x370 (Inherited: 0x138)
struct UFireInputWidget : UWidget {
	struct FSlateBrush JoyStickThumb; // 0x138(0x98)
	struct FSlateBrush JoyStickThumbPress; // 0x1d0(0x98)
	struct FSlateBrush JoyStickIcon; // 0x268(0x98)
	struct FVector2D VisualSize; // 0x300(0x08)
	struct FVector2D ThumbSize; // 0x308(0x08)
	struct FVector2D InputScale; // 0x310(0x08)
	struct FVector2D IconSize; // 0x318(0x08)
	float ActiveOpacity; // 0x320(0x04)
	float InactiveOpacity; // 0x324(0x04)
	float TimeUntilDeactive; // 0x328(0x04)
	bool bPreventReCenter; // 0x32c(0x01)
	char pad_32D[0x13]; // 0x32d(0x13)
	struct FMulticastInlineDelegate OnJoystickPressed; // 0x340(0x10)
	struct FMulticastInlineDelegate OnJoystickRelease; // 0x350(0x10)
	struct FMulticastInlineDelegate OnInputYawAndPitch; // 0x360(0x10)

	void SetJoyStickThumbBrush(struct FButtonStyle& ButtonStyle); // Function Solarland.FireInputWidget.SetJoyStickThumbBrush // (Final|Native|Public|HasOutParms) // @ game+0x1c6d970
	void SetJoyStickIcon(struct FSlateBrush& Icon); // Function Solarland.FireInputWidget.SetJoyStickIcon // (Final|Native|Public|HasOutParms) // @ game+0x1c6d7e0
	void SetInputScale(struct FVector2D Scale); // Function Solarland.FireInputWidget.SetInputScale // (Final|Native|Public|HasDefaults) // @ game+0x1c6d760
	void ResetControlInput(); // Function Solarland.FireInputWidget.ResetControlInput // (Final|Native|Public) // @ game+0x1c6d6a0
};

// Class Solarland.GameArgs
// Size: 0x48 (Inherited: 0x28)
struct UGameArgs : UObject {
	char pad_28[0x8]; // 0x28(0x08)
	struct TArray<struct FString> CommandLineArgs; // 0x30(0x10)
	bool SkipTutorial; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	bool ExecGameArgs(struct FString Args, struct FString& FailReason); // Function Solarland.GameArgs.ExecGameArgs // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0xae69f0
};

// Class Solarland.GameDataManager
// Size: 0x11b0 (Inherited: 0x228)
struct AGameDataManager : AGameManagerBase {
	struct TArray<int32_t> IntegerValues; // 0x228(0x10)
	struct TArray<float> FloatValues; // 0x238(0x10)
	struct TArray<char> ByteValues; // 0x248(0x10)
	struct TArray<bool> BoolValues; // 0x258(0x10)
	struct TArray<struct FVector> FVectorValues; // 0x268(0x10)
	struct TArray<struct FString> FStringValues; // 0x278(0x10)
	char pad_288[0x60]; // 0x288(0x60)
	struct FSCMHostData GlobalDataMap; // 0x2e8(0x488)
	struct TMap<struct FString, struct FSCMHostData> SideDataMap; // 0x770(0x50)
	struct TMap<struct FString, struct FSCMHostData> PlayerDataMap; // 0x7c0(0x50)
	struct FSCMHostData SideDataDefaultTemplate; // 0x810(0x488)
	struct FSCMHostData PlayerDataDefaultTemplate; // 0xc98(0x488)
	struct TMap<struct FString, struct URank*> RanKMap; // 0x1120(0x50)
	char pad_1170[0x20]; // 0x1170(0x20)
	struct UDataTable* DataTable; // 0x1190(0x08)
	struct UDataTable* GeneralDataTable; // 0x1198(0x08)
	char pad_11A0[0x10]; // 0x11a0(0x10)

	void RemoveHost(enum class ESCMHostType HostType, struct FString HostID); // Function Solarland.GameDataManager.RemoveHost // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6d5a0
	void RemoveData(enum class ESCMHostType HostType, struct FString HostID, struct FString DataName, enum class ESCMDataSetType DataSetType); // Function Solarland.GameDataManager.RemoveData // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6d430
	void NotifyRemoveHost(enum class ESCMHostType HostType, struct FString HostID); // Function Solarland.GameDataManager.NotifyRemoveHost // (Net|Native|Event|NetMulticast|Protected) // @ game+0x1c6cfd0
	void AddDataByTableRow(struct FName RowName, struct FSCMDataBoardRow& InTableRow); // Function Solarland.GameDataManager.AddDataByTableRow // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1c6b820
};

// Class Solarland.GameEventComponent
// Size: 0xd8 (Inherited: 0xd0)
struct UGameEventComponent : UGameModeCompBase {
	float WorldTime; // 0xd0(0x04)
	char pad_D4[0x4]; // 0xd4(0x04)

	void ReceiveInit(); // Function Solarland.GameEventComponent.ReceiveInit // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	void InitializeEventList(); // Function Solarland.GameEventComponent.InitializeEventList // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
	int32_t GetAliveCount(); // Function Solarland.GameEventComponent.GetAliveCount // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c6bf90
	void CheckEventList(float DeltaTime); // Function Solarland.GameEventComponent.CheckEventList // (Event|Protected|BlueprintEvent) // @ game+0x224bbb0
};

// Class Solarland.GameJobManager
// Size: 0x450 (Inherited: 0x228)
struct AGameJobManager : AGameManagerBase {
	struct FMulticastInlineDelegate SideListChangeEvent; // 0x228(0x10)
	struct TArray<struct FSCMSideData> SideData; // 0x238(0x10)
	struct TArray<struct FSCMSideData> AttrData; // 0x248(0x10)
	struct TMap<struct FString, uint32_t> SideIndexMap; // 0x258(0x50)
	struct TMap<struct FString, struct ASCMPlayerState*> PlayerIndexMap; // 0x2a8(0x50)
	struct TArray<struct ASCMPlayerState*> OBPlayerList; // 0x2f8(0x10)
	char pad_308[0x20]; // 0x308(0x20)
	struct UDataTable* JobDataTable; // 0x328(0x08)
	struct FSideAttributeSetArray SideAttributeSets; // 0x330(0x120)

	bool UnBindPlayerQuitSideEvent(struct FString TargetSide, struct FDelegate& InEvent); // Function Solarland.GameJobManager.UnBindPlayerQuitSideEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6de80
	bool UnBindPlayerJoinSideEvent(struct FString TargetSide, struct FDelegate& InEvent); // Function Solarland.GameJobManager.UnBindPlayerJoinSideEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6dd70
	bool SwitchPlayerSideAndJob(struct ASCMPlayerState* PlayerA, struct ASCMPlayerState* PlayerB); // Function Solarland.GameJobManager.SwitchPlayerSideAndJob // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6dbf0
	bool SwitchPlayers(struct ASCMPlayerState* PlayerA, struct ASCMPlayerState* PlayerB); // Function Solarland.GameJobManager.SwitchPlayers // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6dcb0
	bool SwitchPlayerPosInTeam(struct ASCMPlayerState* PlayerA, struct ASCMPlayerState* PlayerB); // Function Solarland.GameJobManager.SwitchPlayerPosInTeam // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6db30
	bool SwitchOBPlayerAndPlayer(struct ASCMPlayerState* OBPlayer, struct ASCMPlayerState* Player); // Function Solarland.GameJobManager.SwitchOBPlayerAndPlayer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6da70
	void SideListChangeEvent__DelegateSignature(struct TArray<struct FSCMSideData>& SideList); // DelegateFunction Solarland.GameJobManager.SideListChangeEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x224bbb0
	void SetTimerToNoticeSideDataChanged(); // Function Solarland.GameJobManager.SetTimerToNoticeSideDataChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6da50
	void ServerSidePosInTeamChange(struct FString SideName); // Function Solarland.GameJobManager.ServerSidePosInTeamChange // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1c6d6c0
	void RenumberAllPlayerPosInTeam(); // Function Solarland.GameJobManager.RenumberAllPlayerPosInTeam // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6d680
	bool PreAssignOBToPlayer(struct ASCMPlayerState* Player); // Function Solarland.GameJobManager.PreAssignOBToPlayer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6d3a0
	bool PreAssignJobToPlayer(struct ASCMPlayerState* Player, struct FString Side, struct FString Job, int32_t PosInTeam); // Function Solarland.GameJobManager.PreAssignJobToPlayer // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6d230
	void OnRep_SideDataList(); // Function Solarland.GameJobManager.OnRep_SideDataList // (Final|Native|Private) // @ game+0x1c6d210
	void OnRep_OBPlayerList(); // Function Solarland.GameJobManager.OnRep_OBPlayerList // (Final|Native|Private) // @ game+0x1c6d1f0
	void OnPlayerStateEndPlay(struct AActor* PlayerState, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameJobManager.OnPlayerStateEndPlay // (Final|Native|Private) // @ game+0x1c6d130
	void OnOBPlayerListChanged(struct ASCMPlayerState* ChangedPlayer); // Function Solarland.GameJobManager.OnOBPlayerListChanged // (Final|Native|Private) // @ game+0x1c6d0b0
	bool IsPlayerSameTeam(struct ASCMPlayerState* TargetPlayer, struct FString TargetPlayerID); // Function Solarland.GameJobManager.IsPlayerSameTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6cee0
	bool IsExistSideJob(struct FString NewSide, struct FString JobName); // Function Solarland.GameJobManager.IsExistSideJob // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6cde0
	bool IsExistSide(struct FString NewSide); // Function Solarland.GameJobManager.IsExistSide // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6cd30
	bool IsEmptyPosInTeam(struct FString SideName, int32_t PosInTeam); // Function Solarland.GameJobManager.IsEmptyPosInTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6cc40
	struct TArray<int32_t> GetTeamAssignableNumArray(); // Function Solarland.GameJobManager.GetTeamAssignableNumArray // (Final|Native|Public) // @ game+0x1c6cbc0
	bool GetSidePreJoinPlayerList(struct FString SideName, struct TArray<struct ASCMPlayerState*>& OutPreJoinPlayerList); // Function Solarland.GameJobManager.GetSidePreJoinPlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c6cab0
	bool GetSidePlayerList(struct FString SideName, struct TArray<struct ASCMPlayerState*>& OutPlayerList); // Function Solarland.GameJobManager.GetSidePlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c6c9a0
	bool GetSideJobPlayerList(struct FString SideName, struct FString JobName, struct TArray<struct ASCMPlayerState*>& OutPlayerList); // Function Solarland.GameJobManager.GetSideJobPlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c6c840
	bool GetSideData(struct FString InSideName, struct FSCMSideData& outData); // Function Solarland.GameJobManager.GetSideData // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6c6a0
	bool GetSideAttributeSet(struct FSideAttributeSet& OutSet, struct FString InSideName); // Function Solarland.GameJobManager.GetSideAttributeSet // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c6c500
	bool GetPreOBPlayerIDList(struct TArray<struct FString>& OutPlayerIDList); // Function Solarland.GameJobManager.GetPreOBPlayerIDList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c6c420
	struct ASCMPlayerState* GetPlayerByPosInTeam(struct FString Side, char PosInTeam); // Function Solarland.GameJobManager.GetPlayerByPosInTeam // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6c330
	struct ASCMPlayerState* GetPlayerByPlayerID(struct FString InPlayerID); // Function Solarland.GameJobManager.GetPlayerByPlayerID // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6c280
	bool GetOBPlayerList(struct TArray<struct ASCMPlayerState*>& OutPlayerList); // Function Solarland.GameJobManager.GetOBPlayerList // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1c6c1c0
	bool GetJobDataBySideAndJob(struct FString NewSide, struct FString NewJob, struct FSCMJobData& outData); // Function Solarland.GameJobManager.GetJobDataBySideAndJob // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6c050
	int32_t GetAssignedSideCount(); // Function Solarland.GameJobManager.GetAssignedSideCount // (Final|Native|Public|BlueprintCallable) // @ game+0x1c6c020
	int32_t GetAllSidePlayerNumber(); // Function Solarland.GameJobManager.GetAllSidePlayerNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c6bff0
	struct TArray<struct FSCMSideData> GetAllSideData(); // Function Solarland.GameJobManager.GetAllSideData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c6bfc0
	bool FindEmptyPosInTeam(struct FString SideName, int32_t& OutPosInTeam); // Function Solarland.GameJobManager.FindEmptyPosInTeam // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6bea0
	bool ChangePlayerToOB(struct ASCMPlayerState* Player); // Function Solarland.GameJobManager.ChangePlayerToOB // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6be10
	bool ChangePlayerPosInTeam(struct ASCMPlayerState* Player, int32_t PosInTeam); // Function Solarland.GameJobManager.ChangePlayerPosInTeam // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6bd50
	bool ChangePlayerJob(struct ASCMPlayerState* Player, struct FString NewSide, struct FString NewJob, int32_t PosInTeam); // Function Solarland.GameJobManager.ChangePlayerJob // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c6bbe0
	bool BindPlayerQuitSideEvent(struct FString TargetSide, struct FDelegate& InEvent); // Function Solarland.GameJobManager.BindPlayerQuitSideEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6bad0
	bool BindPlayerJoinSideEvent(struct FString TargetSide, struct FDelegate& InEvent); // Function Solarland.GameJobManager.BindPlayerJoinSideEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1c6b9c0
};

// Class Solarland.LevelWorldCompositionSetting
// Size: 0x88 (Inherited: 0x38)
struct ULevelWorldCompositionSetting : UDeveloperSettings {
	struct TMap<struct FSoftObjectPath, struct FVector> BackupLevelStreamingLocationMap; // 0x38(0x50)
};

// Class Solarland.GameLevelManager
// Size: 0x478 (Inherited: 0x228)
struct AGameLevelManager : AGameManagerBase {
	char pad_228[0x20]; // 0x228(0x20)
	struct FString DesiredLoadLevel; // 0x248(0x10)
	char pad_258[0x10]; // 0x258(0x10)
	struct TArray<struct FString> DesiredLoadElementLevels; // 0x268(0x10)
	struct TArray<struct FString> DesiredUnLoadElementLevels; // 0x278(0x10)
	char pad_288[0xa8]; // 0x288(0xa8)
	struct TMap<struct FString, struct ULevelStreamingDynamic*> LevelKeyToObject; // 0x330(0x50)
	struct TSet<struct ASolarCharacter*> MovementDisabledCharacters; // 0x380(0x50)
	char pad_3D0[0x60]; // 0x3d0(0x60)
	struct TArray<struct FString> LoadingElementLevelNames; // 0x430(0x10)
	struct TArray<struct FString> UnLoadingElementLevelNames; // 0x440(0x10)
	char pad_450[0x18]; // 0x450(0x18)
	struct AGameMapElementManager* MapElementManager; // 0x468(0x08)
	char pad_470[0x8]; // 0x470(0x08)

	void SetMinimapFootprintVisible(bool bVisible); // Function Solarland.GameLevelManager.SetMinimapFootprintVisible // (Event|Public|BlueprintEvent) // @ game+0x224bbb0
	void OnStreamingLevelLoaded(); // Function Solarland.GameLevelManager.OnStreamingLevelLoaded // (Final|Native|Private) // @ game+0x1c71ad0
	void OnScoutPlayerDepart(); // Function Solarland.GameLevelManager.OnScoutPlayerDepart // (Final|Native|Public) // @ game+0x1c71ab0
	void OnRep_DesiredUnLoadElementLevels(); // Function Solarland.GameLevelManager.OnRep_DesiredUnLoadElementLevels // (Final|Native|Private) // @ game+0x1c71a90
	void OnRep_DesiredLoadLevel(); // Function Solarland.GameLevelManager.OnRep_DesiredLoadLevel // (Final|Native|Private) // @ game+0x1c71a70
	void OnRep_DesiredLoadElementLevels(); // Function Solarland.GameLevelManager.OnRep_DesiredLoadElementLevels // (Final|Native|Private) // @ game+0x1c71a50
	void OnLevelLoaded(); // Function Solarland.GameLevelManager.OnLevelLoaded // (Final|Native|Private) // @ game+0x1c71a30
	void OnElementStreamingLevelUnLoaded(); // Function Solarland.GameLevelManager.OnElementStreamingLevelUnLoaded // (Final|Native|Private) // @ game+0x1c71560
	void OnElementStreamingLevelLoaded(); // Function Solarland.GameLevelManager.OnElementStreamingLevelLoaded // (Final|Native|Private) // @ game+0x1c71540
	void OnCharacterEndPlay(struct AActor* Actor, enum class EEndPlayReason EndPlayReason); // Function Solarland.GameLevelManager.OnCharacterEndPlay // (Final|Native|Private) // @ game+0x1c71480
	void LevelManagerTick(); // Function Solarland.GameLevelManager.LevelManagerTick // (Final|Native|Private) // @ game+0x1c713e0
	int32_t GetCurrentMapID(); // Function Solarland.GameLevelManager.GetCurrentMapID // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c70f50
	struct FString GetCurrentLevel(); // Function Solarland.GameLevelManager.GetCurrentLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1c70e90
};

// Class Solarland.GameMapElementManager
// Size: 0x2e8 (Inherited: 0x228)
struct AGameMapElementManager : AGameManagerBase {
	struct TMap<struct FString, struct ASCMMapElementBase*> MapElementListWithID; // 0x228(0x50)
	struct TArray<struct ASCMMapElementBase*> MapElementList; // 0x278(0x10)
	struct TArray<struct ASCMPlayerStart*> PlayerStartList; // 0x288(0x10)
	char pad_298[0x50]; // 0x298(0x50)

	void OnAddNewMapElement(struct AActor* InNewActor); // Function Solarland.GameMapElementManager.OnAddNewMapElement // (Final|Native|Public) // @ game+0x1c71400
};

// Class Solarland.GameModeGlobalSetting
// Size: 0x90 (Inherited: 0x28)
struct UGameModeGlobalSetting : UObject {
	struct FMulticastInlineDelegate OnGlobalSettingChanged; // 0x28(0x10)
	bool bCanVJetInWater; // 0x38(0x01)
	bool bCanHJetInWater; // 0x39(0x01)
	bool bOverrideVJetCD; // 0x3a(0x01)
	char pad_3B[0x1]; // 0x3b(0x01)
	float OverridenVJetCD; // 0x3c(0x04)
	bool bOverrideHJetCD; // 0x40(0x01)
	char pad_41[0x3]; // 0x41(0x03)
	float OverridenHJetCD; // 0x44(0x04)
	bool bEnableJetCost; // 0x48(0x01)
	enum class EJetAltitudeLimitationMode JetAltitudeLimitationMode; // 0x49(0x01)
	bool bEnableEnergyCost; // 0x4a(0x01)
	bool bEnableDamage; // 0x4b(0x01)
	bool bEnableTeamDamage; // 0x4c(0x01)
	bool bEnableMinHPLock; // 0x4d(0x01)
	char pad_4E[0x2]; // 0x4e(0x02)
	float MinHPToLock; // 0x50(0x04)
	bool bEnableSkydiveFollowMovement; // 0x54(0x01)
	bool bEnableBigMap; // 0x55(0x01)
	bool bShowVehicleOnMap; // 0x56(0x01)
	bool bShowMapVoiceStep; // 0x57(0x01)
	bool bShowMapVoiceFight; // 0x58(0x01)
	char pad_59[0x3]; // 0x59(0x03)
	int32_t KillStreakEndNoticeNumber; // 0x5c(0x04)
	int32_t KillLeaderMinKillNumber; // 0x60(0x04)
	bool bShowRevengeNotice; // 0x64(0x01)
	bool bShowKillStreakEndNotice; // 0x65(0x01)
	bool bShowTotalKillNotice; // 0x66(0x01)
	bool bShowKillDownNotice; // 0x67(0x01)
	bool bShowKillLeaderNotice; // 0x68(0x01)
	bool bShowKillLeaderShutDownNotice; // 0x69(0x01)
	bool bShowClearTeamNotice; // 0x6a(0x01)
	enum class EWeaponInfiniteAmmoMode WeaponInfiniteAmmoMode; // 0x6b(0x01)
	enum class ESolarAssistAimSwitchFlag AssistAimSwitchFlag; // 0x6c(0x01)
	bool bEnableWeaponPartEffectTip; // 0x6d(0x01)
	char pad_6E[0x2]; // 0x6e(0x02)
	struct TArray<float> WeaponLevelDamageFactorArray; // 0x70(0x10)
	bool bDestroyItemOnDiscard; // 0x80(0x01)
	bool bDestroyWeaponOnDiscard; // 0x81(0x01)
	bool bCanRebirth; // 0x82(0x01)
	bool bCanLoginBattle; // 0x83(0x01)
	bool bEnableBattlePrompt; // 0x84(0x01)
	bool bEnableBattlePrompt_BeginPlay; // 0x85(0x01)
	bool bKillPlayerWhenOut; // 0x86(0x01)
	char pad_87[0x1]; // 0x87(0x01)
	int32_t ConfigGameModeId; // 0x88(0x04)
	char pad_8C[0x4]; // 0x8c(0x04)

	void SetWeaponInfiniteAmmoMode(enum class EWeaponInfiniteAmmoMode NewValue); // Function Solarland.GameModeGlobalSetting.SetWeaponInfiniteAmmoMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73690
	void SetTeamDamageEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetTeamDamageEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73600
	void SetSkydiveFollowMovementEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetSkydiveFollowMovementEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73570
	void SetShowVehicleOnMap(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetShowVehicleOnMap // (Final|Native|Public|BlueprintCallable) // @ game+0x1c734e0
	void SetShowTotalKillNotice(bool InShowTotalKillNotice); // Function Solarland.GameModeGlobalSetting.SetShowTotalKillNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73460
	void SetShowShowClearTeamNotice(bool InShowClearTeamNotice); // Function Solarland.GameModeGlobalSetting.SetShowShowClearTeamNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c733e0
	void SetShowRevengeNotice(bool InShowRevengeNotice); // Function Solarland.GameModeGlobalSetting.SetShowRevengeNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73360
	void SetShowMapVoiceStep(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetShowMapVoiceStep // (Final|Native|Public|BlueprintCallable) // @ game+0x1c732d0
	void SetShowMapVoiceFight(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetShowMapVoiceFight // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73240
	void SetShowKillStreakEndNotice(bool InShowKillStreakEndNotice); // Function Solarland.GameModeGlobalSetting.SetShowKillStreakEndNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c731c0
	void SetShowKillLeaderShutDownNotice(bool InShowKillLeaderShutDownNotice); // Function Solarland.GameModeGlobalSetting.SetShowKillLeaderShutDownNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73140
	void SetShowKillLeaderNotice(bool InShowKillLeaderNotice); // Function Solarland.GameModeGlobalSetting.SetShowKillLeaderNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c730c0
	void SetShowKillDownNotice(bool InShowKillDownNotice); // Function Solarland.GameModeGlobalSetting.SetShowKillDownNotice // (Final|Native|Public|BlueprintCallable) // @ game+0x1c73040
	void SetMinHPToLock(float NewValue); // Function Solarland.GameModeGlobalSetting.SetMinHPToLock // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72fc0
	void SetMinHPLockEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetMinHPLockEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72f30
	void SetKillStreakEndNoticeNumber(int32_t InKillStreakEndNoticeNumber); // Function Solarland.GameModeGlobalSetting.SetKillStreakEndNoticeNumber // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72eb0
	void SetKillPlayerWhenOut(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetKillPlayerWhenOut // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72e30
	void SetKillLeaderMinKillNumber(int32_t InKillLeaderMinKillNumber); // Function Solarland.GameModeGlobalSetting.SetKillLeaderMinKillNumber // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72db0
	void SetJetCostEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetJetCostEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72d20
	void SetJetAltitudeLimitationMode(enum class EJetAltitudeLimitationMode NewValue); // Function Solarland.GameModeGlobalSetting.SetJetAltitudeLimitationMode // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72ca0
	void SetGameCanRebirth(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetGameCanRebirth // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72c20
	void SetEnergyCostEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetEnergyCostEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72b90
	void SetDamageEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetDamageEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72b00
	void SetCanVJetInWater(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetCanVJetInWater // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72a70
	void SetCanLoginBattle(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetCanLoginBattle // (Final|Native|Public|BlueprintCallable) // @ game+0x1c729f0
	void SetCanHJetInWater(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetCanHJetInWater // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72960
	void SetBigMapEnabled(bool bNewValue); // Function Solarland.GameModeGlobalSetting.SetBigMapEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1c728d0
	void SetAssistAimSwitchFlag(enum class ESolarAssistAimSwitchFlag InFlag); // Function Solarland.GameModeGlobalSetting.SetAssistAimSwitchFlag // (Final|Native|Public|BlueprintCallable) // @ game+0x1c72850
	void ReceiveSettingChanged(); // Function Solarland.GameModeGlobalSetting.ReceiveSettingChanged // (Final|Native|Protected) // @ game+0x1c72830
	bool IsVJetCDOverriden(); // Function Solarland.GameModeGlobalSetting.IsVJetCDOverriden // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c713c0
	bool IsTeamDamageEnabled(); // Function Solarland.GameModeGlobalSetting.IsTeamDamageEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c713a0
	bool IsSkydiveFollowMovementEnabled(); // Function Solarland.GameModeGlobalSetting.IsSkydiveFollowMovementEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71380
	bool IsShowVehicleOnMap(); // Function Solarland.GameModeGlobalSetting.IsShowVehicleOnMap // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71360
	bool IsShowTotalKillNotice(); // Function Solarland.GameModeGlobalSetting.IsShowTotalKillNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71340
	bool IsShowRevengeNotice(); // Function Solarland.GameModeGlobalSetting.IsShowRevengeNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71320
	bool IsShowMapVoiceStep(); // Function Solarland.GameModeGlobalSetting.IsShowMapVoiceStep // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71300
	bool IsShowMapVoiceFight(); // Function Solarland.GameModeGlobalSetting.IsShowMapVoiceFight // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c712e0
	bool IsShowKillStreakEndNotice(); // Function Solarland.GameModeGlobalSetting.IsShowKillStreakEndNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c712c0
	bool IsShowKillLeaderShutDownNotice(); // Function Solarland.GameModeGlobalSetting.IsShowKillLeaderShutDownNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28bc0
	bool IsShowKillLeaderNotice(); // Function Solarland.GameModeGlobalSetting.IsShowKillLeaderNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c28a60
	bool IsShowKillDownNotice(); // Function Solarland.GameModeGlobalSetting.IsShowKillDownNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c712a0
	bool IsShowClearTeamNotice(); // Function Solarland.GameModeGlobalSetting.IsShowClearTeamNotice // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71280
	bool IsMinHPLockEnabled(); // Function Solarland.GameModeGlobalSetting.IsMinHPLockEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71260
	bool IsKillPlayerWhenOut(); // Function Solarland.GameModeGlobalSetting.IsKillPlayerWhenOut // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71240
	bool IsJetCostEnabledEnabled(); // Function Solarland.GameModeGlobalSetting.IsJetCostEnabledEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71220
	bool IsHJetCDOverriden(); // Function Solarland.GameModeGlobalSetting.IsHJetCDOverriden // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71200
	bool IsGameCanRebirth(); // Function Solarland.GameModeGlobalSetting.IsGameCanRebirth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c711e0
	bool IsGameCanLoginBattle(); // Function Solarland.GameModeGlobalSetting.IsGameCanLoginBattle // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c711c0
	bool IsEnergyCostEnabled(); // Function Solarland.GameModeGlobalSetting.IsEnergyCostEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71190
	bool IsEnableWeaponPartEffectTip(); // Function Solarland.GameModeGlobalSetting.IsEnableWeaponPartEffectTip // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71170
	bool IsDestroyWeaponOnDiscard(); // Function Solarland.GameModeGlobalSetting.IsDestroyWeaponOnDiscard // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71150
	bool IsDestroyItemOnDiscard(); // Function Solarland.GameModeGlobalSetting.IsDestroyItemOnDiscard // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71130
	bool IsDamageEnabled(); // Function Solarland.GameModeGlobalSetting.IsDamageEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71110
	bool IsBigMapEnabled(); // Function Solarland.GameModeGlobalSetting.IsBigMapEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c710f0
	enum class EWeaponInfiniteAmmoMode GetWeaponInfiniteAmmoMode(); // Function Solarland.GameModeGlobalSetting.GetWeaponInfiniteAmmoMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c710d0
	float GetOverridenVJetCD(); // Function Solarland.GameModeGlobalSetting.GetOverridenVJetCD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c710b0
	float GetOverridenHJetCD(); // Function Solarland.GameModeGlobalSetting.GetOverridenHJetCD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71090
	float GetMinHPToLock(); // Function Solarland.GameModeGlobalSetting.GetMinHPToLock // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x846ee0
	int32_t GetKillStreakEndNoticeNumber(); // Function Solarland.GameModeGlobalSetting.GetKillStreakEndNoticeNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71070
	int32_t GetKillLeaderMinKillNumber(); // Function Solarland.GameModeGlobalSetting.GetKillLeaderMinKillNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71050
	enum class EJetAltitudeLimitationMode GetJetAltitudeLimitationMode(); // Function Solarland.GameModeGlobalSetting.GetJetAltitudeLimitationMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c71030
	float GetDamageFactorByWeaponLevel(int32_t InWeaponLevel); // Function Solarland.GameModeGlobalSetting.GetDamageFactorByWeaponLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c70f80
	int32_t GetConfigGameModeId(); // Function Solarland.GameModeGlobalSetting.GetConfigGameModeId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c70e70
	enum class ESolarAssistAimSwitchFlag GetAssistAimSwitchFlag(); // Function Solarland.GameModeGlobalSetting.GetAssistAimSwitchFlag // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c70e50
	bool CanVJetInWater(); // Function Solarland.GameModeGlobalSetting.CanVJetInWater // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c70e30
	bool CanHJetInWater(); // Function Solarland.GameModeGlobalSetting.CanHJetInWater // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1c70e10
};

// Class Solarland.GameModeSettingInterface
// Size: 0x28 (Inherited: 0x28)
struct UGameModeSettingInterface : UInterface {

	struct UGameModeGlobalSetting* GetGameModeSetting(); // Function Solarland.GameModeSettingInterface.GetGameModeSetting // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1c2f2f0
};

// Class Solarland.GameplayTagReflectorSetting
// Size: 0x78 (Inherited: 0x28)
struct UGameplayTagReflectorSetting : UObject {
	struct TMap<struct FName, struct FSoftObjectPath> ReflectedTagsSet; // 0x28(0x50)
};

// Class Solarland.GameplayVibrateDataAsset
// Size: 0x80 (Inherited: 0x30)
struct UGameplayVibrateDataAsset : UDataAsset {
	struct TMap<enum class EGameplayVibrateCategory, struct FVibrateIntensityPlayParams> CategoryIntensityMap; // 0x30(0x50)
};

// Class Solarland.GameplayVibrateSettings
// Size: 0x60 (Inherited: 0x38)
struct UGameplayVibrateSettings : UDeveloperSettings {
	struct TSoftObjectPtr<UGameplayVibrateDataAsset> GameplayVibrateConfig; // 0x38(0x28)
};

// Class Solarland.GameReviveItemManager
// Size: 0x248 (Inherited: 0x228)
struct AGameReviveItemManager : AGameManagerBase {
	int32_t MaxReviveUsage; // 0x228(0x04)
	float ReviveItemRepoTime; // 0x22c(0x04)
	float ReviveProximityRadius; // 0x230(0x04)
	float ReviveHeight; // 0x234(0x04)
	float ReviveWaitTime; // 0x238(0x04)
	bool bGlobalUseRevieItem; // 0x23c(0x01)
	char pad_23D[0x3]; // 0x23d(0x03)
	float DownedReviveButtonDelayTime; // 0x240(0x04)
	char pad_244[0x4]; // 0x244(0x04)

	void SetGlobalUseReviveItem(bool InCanUseItem); // Function Solarland.GameReviveItemManager.SetGlobalUseReviveItem // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c78980
	bool PlayerTryUseReviveItem(struct ASolarPlayerState* InPlayerState, int32_t InUseNum); // Function Solarland.GameReviveItemManager.PlayerTryUseReviveItem // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1c788c0
	void OnTeammateReviveManagerRefresh(); // Function Solarland.GameReviveItemManager.OnTeammateReviveManagerRefresh // (Final|Native|Protected|BlueprintCallable) // @ game+0x1c788a0
	void OnRep_GlobalUseRevieItem(); // Function Solarland.GameReviveItemManager.OnRep_GlobalUseRevieItem // (Final|Native|Protected) // @ game+0x1c788a0
	bool IsPlayerReviving(struct ASolarPlayerState* InPlayerState); // Function Solarland.GameReviveItemManager.IsPlayerReviving // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x224bbb0
	float GetReviveWaitTime(); // Function Solarland.GameReviveItemManager.GetReviveWaitTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1c78870
	float GetReviveProximityRadius(); // Function Solarland.GameReviveItemManager.GetReviveProximityRadius // (Final|Native|Public|BlueprintCallable) // @ game+0x1c78840
	float GetReviveItemRepoTime(); // Function Solarland.GameReviveItemManager.GetReviveItemRepoTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1c78810
	int32_t GetReviveItemID(); // Function Solarland.GameReviveItemManager.GetReviveItemID // (Final|Native|Public|BlueprintCallable) // @ game+0x1c787e0
	float GetReviveHeight(); // Function Solarland.GameReviveItemManager.GetReviveHeight // (Final|Native|Public|BlueprintCallable) // @ game+0x1c787b0
	int32_t GetPlayerReviveItemNum(struct ASolarPlayerState* InPlayerState); // Function Solarland.GameReviveItemManager.GetPlayerReviveItemNum // (Final|Native|Public|BlueprintCallable) // @ game+0x1c78720
	int32_t GetMaxReviveUsage(); // Function Solarland.GameReviveItemManager.GetMaxReviveUsage // (Final|Native|Public|BlueprintCallable) // @ game+0x1c786f0
	float GetDownedReviveButtonDelayTime(); // Function Solarland.GameReviveItemManager.GetDownedReviveButtonDelayTime // (Final|Native|Public|BlueprintCallable) // @ game+0x1c786a0
